{"title":"Doctor Who Confidential - 2011 - Season 06 - 13 Episodes","uid":10905599,"size":14410110180,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:001c66d5ebb673d1a0753563e70de3a343f9be4c&amp;dn=Doctor+Who+Confidential+-+2011+-+Season+06+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bnaron","files":-1,"time":1409184715,"description":"                            Doctor Who Confidential\n                               2011 - Season 06\n                                13 HD Episodes\n\n\nSeries Description Courtesy:\n\nWikipedia, The Free Encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&lt;/a&gt;\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third. BBC Three also broadcast a cut-down edition of the program, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\n\n\n\nEpisode Synopses Courtesy Of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2011-04-23 - Coming to America (Video:H264 1280x720, 3238kbps, 25fps - Audio:AAC 44.1kHz, 152kbps, 6 channels)\n\nDoctor Who Confidential travels Stateside with the cast and crew to show how Doctor Who created its very own American Dream. In Utah, Confidential follows the director's quest to find the perfect movie-style backdrop to one of the most ambitious scenes to date. Matt Smith dons his stetson and gives us a run-down of the USA filming and the crew talk us through the thrills of filming in the Utah desert. Back on home ground, we bring you the creation of the Oval Office, the much-debated return of River Song and a whole load of backstage action from this spectacular two-parter. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Alex Kingston.\n\n\n2011-04-30 - Breaking the Silence (Video:H264 1280x720, 3268kbps, 25fps - Audio:AAC 44.1kHz, 171kbps, 6 channels)\n\nKaren Gillan and Arthur Darvill take us on a wild west tour, deep in the heart of the American desert. The Doctor Who crew are filming in a very unusual location of super-size scale and Confidential covers the entire journey from the States to the stars. Alex Kingston speculates about the mysterious River Song and The Silence have their say on one of the scariest monsters to date. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Alex Kingston.\n\n\n2011-05-07 - Ship Ahoy! (Video:H264 1280x720, 3137kbps, 25fps - Audio:AAC 44.1kHz, 197kbps, 6 channels)\n\nDoctor Who Confidential sets sail for a behind-the-scenes journey on board the Doctor Who pirate ship. Karen Gillan is a swinging success when she gets to grips with swash buckling and, with exclusive access to all areas of production, we find out how the crew creates a storm at sea. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Hugh Bonneville.\n\n\n2011-05-14 - Bigger on the Inside (Video:H264 1280x720, 3238kbps, 25fps - Audio:AAC 44.1kHz, 181kbps, 6 channels)\n\nAcclaimed fantasy author Neil Gaiman takes us on a personal tour of the Doctor's magical machine, and Confidential goes behind the scenes to find out what life is like on a junkyard planet.\n\n\n2011-05-21 - Double Trouble (Video:H264 1280x720, 3323kbps, 25fps - Audio:AAC 44.1kHz, 155kbps, 6 channels)\n\nConfidential follows the Doctor inside a mysterious medieval monastery to find out just what is going on with 'The Flesh'. We discover the truth behind Rory's latest love interest and learn the tricks about filming with doubles. We find out what it's like to be a guest star on Doctor Who through the eyes of actor Marshall Lancaster and there are interviews with Karen Gillan, Arthur Darvill, Sarah Smart, Mark Bonnar and writer Matthew Graham.       \n\n\n2011-05-28 - Take Two (Video:H264 1280x720, 3310kbps, 25fps - Audio:AAC 44.1kHz, 129kbps, 6 channels)\n\nConfidential hangs out with the stars in the 'Tent of Fun' and takes a look at how filming with doppelgangers can mean double the trouble. We discover whether playing The Doctor has given Matt Smith an insight into another world, while writer Matthew Graham takes a journey of discovery and sees one of his most powerful new characters coming to life. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Sarah Smart.\n\n\n2011-06-04 - The Born Identity (Video:H264 1280x720, 3258kbps, 25fps - Audio:AAC 44.1kHz, 149kbps, 6 channels)\n\nConfidential goes behind the scenes for the epic series finale set on the asteroid, Demons Run. We discover how the Doctor Who team create the newest baddies, turn a small platoon of clerics into an army and transform an alley in Cardiff into Jack the Ripper's London. Features a day in the life of a Doctor Who enemy and in-depth interviews with Karen Gillan, Arthur Darvill, Alex Kingston, Frances Barber and lead writer Steven Moffat.\n\n2011-08-27 - River Runs Wild (Video:H264 1280x720, 4169kbps, 25fps - Audio:AAC 44.1kHz, 195kbps, 6 channels)\n\nAchtung! Explosions, vintage bikes, cornfields and time travel make for a mind-boggling start to the second batch of Doctor Who adventures.Confidential is back on set with Matt Smith and Karen Gillan in 1930s Berlin. We hang out backstage with the cast and crew and bring you all the behind-the-scenes action as the series gets back into full swing. We also bring you Script to Screen - the making of a mini Doctor Who episode written by schoolchildren and brought to life by Matt Smith and the Doctor Who team. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Steven Moffat.\n\n\n2011-09-03 - About a Boy (Video:H264 1280x720, 3154kbps, 25fps - Audio:AAC 44.1kHz, 178kbps, 6 channels)\n\nSeries going behind the scenes of Doctor Who. Confidential is on location, presenting action from a 17th century estate in the Gloucestershire countryside and a high-rise housing estate in Bristol. The cast have a bit of a sing-song, there's a long night with the one of the assistant directors and the special effects team show how sometimes good old-fashioned green goop is the only way. Mark Gatiss talks about writing for three consecutive TV Doctors and, in script to Screen, find out who plays an all-important historical figure. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill, Mark Gatiss and Steven Moffat.\n\n\n2011-09-10 - What Dreams May Come (Video:H264 1280x720, 3287kbps, 25fps - Audio:AAC 44.1kHz, 198kbps, 6 channels)\n\nConfidential is out and about with Karen Gillan (Amy Pond) and Arthur Darvill (Rory Williams). Can Karen get up to 100mph around one of the UK's fastest racetracks and can Arthur rise to the challenge of swimming in a tank of sharks? The team are also on set at Wales Millennium Centre to fend off some brutal new enemies and viewers get to experience a 'Day in the Life' of the camera department. Also featured is another Script to Screen, as our storyboard artist brings the story to life. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and Steven Moffat.\n\n\n2011-09-17 - Heartbreak Hotel (Video:H264 1280x720, 2762kbps, 25fps - Audio:AAC 44.1kHz, 157kbps, 6 channels)\n\nConfidential is on set with David Walliams as he makes his Doctor Who debut. Find out what made writer Toby Whithouse set his latest Doctor adventure in a hotel with a difference and discover how to make heads turn in a room full of ventriloquist dummies. Spend 'A Day in the Life' with the writer on a very revealing set visit when he finally gets face to face with his very own creation, plus more teasers on Death is the Only Answer - an exclusive three-minute Doctor Who episode written by schoolchildren. Featuring interviews with Matt Smith, Karen Gillan, Arthur Darvill and David Walliams.\n\n\n2011-09-24 - Open All Hours (Video:H264 1280x720, 3234kbps, 25fps - Audio:AAC 44.1kHz, 175kbps, 6 channels)\n\nMatt Smith is reunited with an old friend as James Corden returns as Craig, the Doctor's house-mate. The pair discuss the merits of filming at night in a department store with baby co-stars. Radio 1 DJ Greg James also provides an insight into his cameo appearance, and the winners of the Script to Screen contest are given a chance to meet the Time Lord himself on set.\n\n\n2011-10-01 - When Time Froze (Video:H264 1280x720, 3068kbps, 25fps - Audio:AAC 44.1kHz, 236kbps, 6 channels)\n\nActress Alex Kingston provides an explanation of River Song's complex time-line with the Doctor, and The Script to Screen contest draws to a close with Death Is the Only Answer, a three-minute episode written by the pupils of Oakley Junior School in Basingstoke, Hampshire, in which the Doctor make use of a little-known Time Lord weapon before helping a fellow time-traveler find his way home.\n\n\n\n","torrent":{"xt":"urn:btih:001c66d5ebb673d1a0753563e70de3a343f9be4c","amp;dn":"Doctor+Who+Confidential+-+2011+-+Season+06+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001c66d5ebb673d1a0753563e70de3a343f9be4c","infoHashBuffer":{"type":"Buffer","data":[0,28,102,213,235,182,115,209,160,117,53,99,231,13,227,163,67,249,190,76]},"announce":[],"urlList":[]}}