{"title":"Turbo FAST - Season 1, Episodes 01-13","uid":12240379,"size":2649872782,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0128b8ac22c977fefdf24a76a824cdc3efeba7d3&amp;dn=Turbo+FAST+-+Season+1%2C+Episodes+01-13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"NantoVision","files":13,"time":1439769359,"description":"Turbo FAST is an American flash-animated television series based on the 2013 computer-animated film Turbo. Produced by DreamWorks Animation Television and animated by Titmouse, it is the first in-house traditionally-animated production for DreamWorks Animation since the film Sinbad: Legend of the Seven Seas was released in 2003.\n\nThe series picks up right after the film. After Turbo the Snail's improbable win at the Indianapolis 500, the superfast racer finds his life forever changed after he returns from his victory tour. Namely, Tito, his human companion, has built Starlite City, a massive miniature city with an elaborate adjoining race track for Turbo and his fellow snails to live and race in. However, Turbo finds his new life no less hectic as he and his friends face new rivals of all varieties eager to take the champion on. Regardless of the danger, Turbo and his colleagues of the Fast Action Stunt Team are ready for the challenge.\n\nIf you'd like me to post more episodes of Turbo FAST, please leave me a thank-you comment! After your download completes, please leave the torrent open for as long as possible so that it will be fully seeded for others to enjoy. If people continue to seed, I will continue to post new episodes","torrent":{"xt":"urn:btih:0128b8ac22c977fefdf24a76a824cdc3efeba7d3","amp;dn":"Turbo+FAST+-+Season+1%2C+Episodes+01-13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0128b8ac22c977fefdf24a76a824cdc3efeba7d3","infoHashBuffer":{"type":"Buffer","data":[1,40,184,172,34,201,119,254,253,242,74,118,168,36,205,195,239,235,167,211]},"announce":[],"urlList":[]}}