{"title":"Winter Sonata Anime English Sub 26 Episodes","uid":9233662,"size":1537855833,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:018fc0f0bd8bdd8143f6c79f2aa2b60ee1fc49f7&amp;dn=Winter+Sonata+Anime+English+Sub+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iorgu10","files":26,"time":1385129189,"description":"The story begins when Joon-sang, the son of an eminent musician, moves to Chuncheon, a rural city in South Korea. As an extraordinarily talented student, Joon-sang is welcomed by his fellow students as well as his teachers, but remains a quiet, introverted teenager. As he intends to find out about his biological father, whom his mother claims has died, his search to find out more about his father is what made him want to move to the province. Having an identity crisis in adolescence because of the father he has never met, and blaming his mother for this, Joon-sang believes that no one truly loves him.\n\nOn his way to school one day, Joon-sang's classmate Yoo-jin, while sitting next to him on the bus, falls asleep on his shoulder. Joon-sang soon falls in love with Yoo-jin, who opens her innocent heart to him. Their love, however, is cut short after Joon-sang is seriously injured in a car accident and, due to brain damage, suffers from amnesia, unable to remember anything prior to his accident.\n\nJoon-sang's mother, yearning for Joon-sang's love and respect, has Joon-sang brainwashed by a psychologist, so that Joon-sang will not remember his painful childhood as an illegitimate child. As a result, Joon-sang's memories prior to the accident are erased. Joon-sang's mother decides to move to the United States with Joon-sang, where he can start a new life under the identity of Lee Min-hyeong. His friends and teachers are told that Joon-sang is dead.\n\nTen years later, Min-hyeong is an award-winning architect in the United States. He does not remember anything about his life in Korea. He is completely different, an open-minded person who cares about other people, including his mother. He returns to Korea and Yoo-jin sees him on the street, prompting her to put off her engagement to her childhood friend Sang-hyeok. Little does she know that Min-hyeong is dating her friend and sometime past rival Chae-rin. The story's plot intensifies when Yoo-jin begins to work for the firm where Min-hyeong is employed, and tries to find out if he is her supposedly dead first love Joon-sang.\n","torrent":{"xt":"urn:btih:018fc0f0bd8bdd8143f6c79f2aa2b60ee1fc49f7","amp;dn":"Winter+Sonata+Anime+English+Sub+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"018fc0f0bd8bdd8143f6c79f2aa2b60ee1fc49f7","infoHashBuffer":{"type":"Buffer","data":[1,143,192,240,189,139,221,129,67,246,199,159,42,162,182,14,225,252,73,247]},"announce":[],"urlList":[]}}