{"title":"Sunfly 287 / SFMW 919","uid":5320959,"size":233527372,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:01c25ef6b8901995faa82efe37109591b46943d8&amp;dn=Sunfly+287+%2F+SFMW+919&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ajksssss","files":60,"time":1264860623,"description":"SF287:\n\n01. 21st Century Breakdown - In the style of Green Day\n02. The Climb - In the style of Joe McElderry\n03. I Will Not Bow - In the style of Breaking Benjamin\n04. Replay - In the style of Iyaz\n05. 3 Words - In the style of Cheryl Cole Feat. Will.I.Am\n06. Video Phone - In the style of Beyonce\n07. Need You Now - In the style of Lady Antebellum\n08. Doesn't Mean Anything - In the style of Alicia Keys\n09. Hold On - In the style of Michael BublÃƒÂ©\n10. Fifteen - In the style of Taylor Swift\n11. I Want To Know What Love Is - In the style of Mariah Carey\n12. Break - In the style of Three Days Grace\n13. Do I - In the style of Luke Bryan\n14. Hold Up A Light - In the style of Take That\n15. You Are Not Alone - In the style of X-Factor Finalists 2009\n\n\nMW919:\n\n01. We Weren't Born To Follow - In the style of Bon Jovi\n02. Toes - In the style of The Zac Brown Band\n03. Mountains - In the style of Biffy Clyro\n04. Did You See Me Coming? - In the style of Pet Shop Boys\n05. Bring On The Dancing Horses - In the style of Echo &amp; The Bunnymen\n06. Jump Then Fall - In the style of Taylor Swift\n07. Could Have Told You So - In the style of Halo James\n08. Munich - In the style of Editors\n09. To Love Again - In the style of Alesha Dixon\n10. I Don't Believe You - In the style of Pink\n11. Love Letter - In the style of Bonnie Raitt\n12. Sweet Child O' Mine - In the style of Taken By Trees\n13. Two Is Better Than One - In the style of Boys Like Girls Feat. Taylor Swift\n14. This Is My Life - In the style of Shirley Bassey\n15. On The Amazon - In the style of Don McLean","torrent":{"xt":"urn:btih:01c25ef6b8901995faa82efe37109591b46943d8","amp;dn":"Sunfly+287+%2F+SFMW+919","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01c25ef6b8901995faa82efe37109591b46943d8","infoHashBuffer":{"type":"Buffer","data":[1,194,94,246,184,144,25,149,250,168,46,254,55,16,149,145,180,105,67,216]},"announce":[],"urlList":[]}}