{"title":"Stargate SG-1 S01 D4 (repost) 2lions-Team","uid":5346818,"size":4649505657,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:04d7f7ae9f5a3d096ba0e86747fea656987180c6&amp;dn=Stargate+SG-1+S01+D4+%28repost%29+2lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wietseherman","files":-1,"time":1265666247,"description":"\n\n\nStargate SG-1 S01 D4 (repost)\n\nNL informatie\n\nThe Torment of Tantalus  - Daniel Jackson ontdekt van een oude film dat de stargate al in 1944 open geweest is en gaat naar de planeet waar Ernest Littlefield is achtergelaten. Daar ontdekt hij een boek over de Zin van het Leven dat achtergelaten is door de vier grote rassen.\n\nBloodlines - Rya'c, de zoon van Teal'c, heeft de leeftijd bereikt dat hij een Goa'uldlarve geÃƒÂ¯mplanteerd moet krijgen.\n\nFire and Water - SG-1 heeft valse herinneringen aan de dood van Daniel, die vastgehouden wordt voor ondervraging door een amfibisch wezen.\n\nHathor - Hathor, een Goa'uldkoningin met onweerstaanbare feromonen, probeert de mannen van Stargate Command onder haar invloed te brengen en een nieuw soort Goa'uld te kweken.\n\nEnglisch Information\n\nThe Torment of Tantalus  - SG-1 go to Heliopolis (PB2-908) and recovers Dr. Ernest Littlefield, who went through the Stargate in 1945 and never returned. Daniel nearly stays behind to study a 'book' detailing the meaning of human existence, left behind by the Four Great Races. \n\nBloodlines - Teal'c's son Rya'c is to be implanted with his first Goa'uld larva on Chulak, so SG-1 goes to prevent it. However, Rya'c falls ill and can only be saved by a symbiote; Teal'c donates his own, and receives a stolen one for himself. We also meet Teal'c's first teacher Bra'tac, formerly the greatest of all Jaffa warriors and now still a spry 133 years old, who had taught Teal'c that the Goa'uld were false gods. \n\nFire and Water - On P3X-866, SG-1 is given a false memory of Daniel's death by his alien abductor Nem. Nem is a member of an amphibious species named Oannes (Ohne), and wants to know from Daniel what happened to his mate Omoroca in ancient Babylon. Ultimately, Daniel remembers the obscure fact from his studies of ancient myths, and is allowed to go home. \n\nHathor - The Goa'uld Hathor (one of the mothers of all Goa'uld) brainwashes the men of the SGC with pheromones, and nearly makes O'Neill host to a larval Goa'uld conceived with Daniel. She flees after the unaffected women of Stargate Command retake the facility. \n\n\n\nSource    : retail\nFormat    : DVD5\nVideo     : Pal\nSound     : DD 5.1\nLanguages : EN FR\nMenu      : Yes\nExtra     : No\nSubs      : FR NL EN\n\n\nBrought to you by\nBack to Basic\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding.\n\n*****************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************************","torrent":{"xt":"urn:btih:04d7f7ae9f5a3d096ba0e86747fea656987180c6","amp;dn":"Stargate+SG-1+S01+D4+%28repost%29+2lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d7f7ae9f5a3d096ba0e86747fea656987180c6","infoHashBuffer":{"type":"Buffer","data":[4,215,247,174,159,90,61,9,107,160,232,103,71,254,166,86,152,113,128,198]},"announce":[],"urlList":[]}}