{"title":"Abraham and Isaac (Animated Christian Movie)","uid":5212161,"size":236685385,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:04fbac7ea285ef2fe379bd3bd0c4b3c73507a36d&amp;dn=Abraham+and+Isaac+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IndianChristian","files":3,"time":1260641816,"description":"Abraham and Isaac (Animated Christian Movie)\n\n\nAbraham keeps faith in God, and exhibits extraordinary courage in following God's will. That faith and courage remain strong, even when Abraham is tested to the limit. When God sees the power of Abraham's faith, He rewards Abraham with unlimited blessings. The Lord has promised Abram and Sarai that they would have children as countless as the stars. Yet they are growing old, so Sarai tells Abram to take her servant Hagar as a wife. Perhaps she will bear a son. Ishmael is born to Hagar. But Ishmael is not the son promised by God. The Lord appears to Abrams and renews his promise. As a symbol of this covenant, God renames Abram and Sarai. Henceforth, they are known as Abraham and Sarah. Miraculously, Sarah gives birth to Isaac. Gad tells Abraham that he should care for Ishmael,&quot;but my promise and my inheritance shall go to Isaac.&quot; As a dutiful son, Isaac helps his father with ritual sacrifices. &quot;Do you know why we sacrifice our finest lamb?&quot; Abraham asks him. &quot;Because God has given us everything,&quot; the boy replies, &quot;we must give him our best.&quot; The answer pleases his father. &quot;Promise me Isaac,&quot; says Abraham, &quot;that you will always do what the Lord asks.&quot; Isaac confirms that he will. The Lord appears to Abraham, and tells him that he must sacrifice Isaac. Shaken but obedient to God, Abraham prepares to kill Isaac. Isaac lies down on the altar of ritual sacrifice, willing to give up his life to God. Suddenly, the Lord speaks to Abraham: &quot;Lay not thy hand upon the lad. Abraham, because thou hast done this thing, and has not withheld thy son, I will multiply thy seed like the stars in heaven. And by thy seed, thou shalt be blessed, because thou hast obeyed my voice.&quot;\n\nRuntime: 26 mins\nLanguage: English (No-Subtitles)\nYear: 1992\nMy Rating: 10/10\nQuality: 9/10 \n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. That's not all. \nOut of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. \n\n2. Please seed the movies. If possible make copies and distribute to your poor neighbors especially during this Christmas. And please do pray for the movie makers and their families.\n\nRemember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;026b6c666b636c616a706b71766b636c3032323b427b636a6d6d2c616d2c6b6c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\n\n","torrent":{"xt":"urn:btih:04fbac7ea285ef2fe379bd3bd0c4b3c73507a36d","amp;dn":"Abraham+and+Isaac+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04fbac7ea285ef2fe379bd3bd0c4b3c73507a36d","infoHashBuffer":{"type":"Buffer","data":[4,251,172,126,162,133,239,47,227,121,189,59,208,196,179,199,53,7,163,109]},"announce":[],"urlList":[]}}