{"title":"RSX DDoS // Premium RuneScape DDoS Tool Cracked  13th April","uid":6315264,"size":623906,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:05944b66656575bc9908d51cb6dd279e2050ad6b&amp;dn=RSX+DDoS+%2F%2F+Premium+RuneScape+DDoS+Tool+Cracked++13th+April+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iHugh","files":1,"time":1302685139,"description":"RuneScape DDoS Tool is now back with RSX, which dramtically improves from X8. Our team have spent countless hours ensuring that RSX DDoS works 100% of the time, 100% efficiently. RSX returns to fill from where RSX8 left off. With over 500 new shell booters added, X8 will stress your victims connection more than ever before. Gone are the days of users with fast connections being able to withstand your lag attacks. Victory is now yours. Wheather it be open world PvP, or Staking, RSX is ensured to grant you victory. With RSX comes a much faster IP ejection, meaning less crucial time wasted while DDoS attacking your opponent. RuneScape X DDoS Tool currently sends over 4,500 connection requests to you victims internet connection. ALL UK and US personal internet connections are unable to withstand this, and will severely lag, giving you the opportune time to slice, smash, dice and crash your weapons upon your enemy! Game on. Win on. RSX on.\n\n------------------\nInst allation Guide\n------------------\n\n1. Download RSX8, PLEASE SEED.\n2. Open RuneScape X. (If an error message appears, ignore it, RSX8 should still be working)\n3. Once you get into the game, the program should Pop-Out.\n4. Enter the Wilderness or Al-Kahrid Duel Arena.\n5. The light on the left hand side should go green.\n6. Type your opponents name\n7. Click ' Fetch IP '\n8. As soon as you decide to attack, press ' Launch DDoS '\n9. Wait for the loading bar to complete (1 second or less)\n10. Attack and secure victory!\n\n------------------\n      Notice\n------------------\n\nRSX DDoS Tool is UNABLE to alter the ACTUAL GAME CLIENT, and therefor is unable to disable auto-retaliate. All the tool can do is destroy your opponents internet connection!","torrent":{"xt":"urn:btih:05944b66656575bc9908d51cb6dd279e2050ad6b","amp;dn":"RSX+DDoS+%2F%2F+Premium+RuneScape+DDoS+Tool+Cracked++13th+April+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05944b66656575bc9908d51cb6dd279e2050ad6b","infoHashBuffer":{"type":"Buffer","data":[5,148,75,102,101,101,117,188,153,8,213,28,182,221,39,158,32,80,173,107]},"announce":[],"urlList":[]}}