{"title":"Cheaters DVDRip DivX","uid":4294908,"size":734560344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09736bb56b2a582a70dc12ba05ea2f1e71ddb2d4&amp;dn=Cheaters+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":3,"time":1216047236,"description":"HBO Films, 20 May 2000\nWritten and Directed by John Stockwell\nEleven students conspire with their teacher to cheat on an academic competition.\n\nIf the only way to win a scholastic contest was to cheat, would you do it?\n\nNew York Times, Tuesday, May 16, 2000\nCheaters Learned a Lesson, Sort Of By DIRK JOHNSON\n\nCHICAGO, May 15 -- Five years after shaming their school by cheating to win a statewide academic contest, some of the former Steinmetz High School students on the quiz team now say they have a single regret: being caught.\n\nWhen Steinmetz High School, with an enrollment drawn from working-class neighborhoods, won the statewide academic decathlon championship in 1995, toppling a prestigious magnet school, Whitney Young, the student scholars were hailed in Chicago as heroic underdogs.\n\nBut when the decathlon board analyzed the extraordinarily high test scores by the Steinmetz students, questions about cheating arose. The Academic Decathlon Association, the sponsor of one of the nations most prestigious academic championships, had discovered, among other peculiarities, that only 12 students in the nation had posted a score of 900 or better on the math quiz and that 6 of those students were from Steinmetz.\n\nAfter the decathlon board demanded that the Steinmetz scholars take a validation test, the students and their teacher, Dr. Gerald Plecki, refused, saying indignantly that they had been victims of assumptions that a poorer school could never achieve so brilliantly.\n\nIs cheating wrong? Right under the correct circumstances? What if it were your child that cheated, would it be ok then? Dr. Gerald Plecki: Do you think Bill Gates fired the guys who brought him the Apple Operating system code? He probably promoted them.\n\nJeff Daniels ... Dr. Gerard Plecki \nJena Malone ... Jolie Fitch \nPaul Sorvino ... Constantine Kiamos \nLuke Edwards ... Darius Bettus \nBlake Heron ... Matt Kur \nDov Tiefenbach ... Irwin Flickas \n\nDVDRip&gt;DivX/No Subs/NTSC/640x480/796kbps/23.976fps/mp3/48KHz/2ch stereo/115Kbps/105min/700Mb","torrent":{"xt":"urn:btih:09736bb56b2a582a70dc12ba05ea2f1e71ddb2d4","amp;dn":"Cheaters+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09736bb56b2a582a70dc12ba05ea2f1e71ddb2d4","infoHashBuffer":{"type":"Buffer","data":[9,115,107,181,107,42,88,42,112,220,18,186,5,234,47,30,113,221,178,212]},"announce":[],"urlList":[]}}