{"title":"Galton &amp; Simpsons Half Hour - S01 - Audio Comedy - MP3 - Slimoo","uid":5727995,"size":109804353,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0aac3d71686f1bb7fb8ed28cae83a06fdd2ab641&amp;dn=Galton+%26+Simpsons+Half+Hour+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":8,"time":1280535797,"description":"Galton &amp; Simpson's Half Hour - Series 01 - Audio Comedy - BBC Radio 2 via DVB-T\n4 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\n\nThe legendary writing partnership of Ray Galton and Alan Simpson began in 1949, when the pair met whilst undergoing treatment for TB at Milford Sanitorium. By 1951, they were writing professionally for the BBC and they have since written over 600 scripts and won numerous awards for their work on radio, TV and film, including Hancock's Half Hour and Steptoe And Son.\n\nBBC Radio 2 marks the 60th anniversary of their writing partnership with a series of half-hour comedies, \nThe four episodes were originally written for television by Ray and Alan and especially adapted by them for Radio 2.\n\n\n\n\n1: A football fanatic on his way to a Wembley Cup Final with his heavily pregnant wife and his best friend. An early labour, an emergency stop and the disappearance of the priceless tickets lead to a comedic study in political incorrectness and male chauvinism. First broadcast on Yorkshire Television back in 1974 and starred Brian Glover, Maureen Lipman and Peter Jones \n\n\n2: A Rolls Royce and a banger meet in a very narrow country lane, somewhere in Cornwall, and both drivers refuse to back up. Between the AA, the RAC and the Cornish Constabulary, a solution is finally found, temporarily.\nThe drama was one of Galton &amp; Simpson's Comedy Playhouse Scripts for the BBC, first broadcast in 1963\n\n\n3: We all know one. The man next door, on the bus, in the pub, or if you're really unlucky the one who comes round your house, night after night, just when you're settling down to watch a long awaited film on television. The last thing you need is a bitter two hour long dispute over the identity of a bit player.\nThe drama was first broadcast on Yorkshire Television in 1977 and starred Leonard Rossiter and Patricia Hayes \n\n\n4: When Arthur Bunclarke... with an E... did his patriotic duty in donating a pint of his blood, he was unaware until the prick of the needle that he was the proud possessor of one of the rarest blood groups in the world. Which was just as well as things turned out. First broadcast on BBC-TV Hancock's Half in 1961 and starred Tony Hancock.\n\n\n\nCast:\nIntro's - Paul Merton\n1: Frank Skinner\n2: David Mitchell &amp; Robert Webb\n3: Rik Mayall and June Whitfield \n4: Paul Merton\n\n\n\n\n\nGalton &amp; Simpson's Half Hour - S01 - E01 - You'll Never Walk Alone\nGalton &amp; Simpson's Half Hour - S01 - E02 - Impasse\nGalton &amp; Simpson's Half Hour - S01 - E03 - I Tell You It's Burt Reynolds\nGalton &amp; Simpson's Half Hour - S01 - E04 - The Blood Donor\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 27mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:0aac3d71686f1bb7fb8ed28cae83a06fdd2ab641","amp;dn":"Galton+%26+Simpsons+Half+Hour+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aac3d71686f1bb7fb8ed28cae83a06fdd2ab641","infoHashBuffer":{"type":"Buffer","data":[10,172,61,113,104,111,27,183,251,142,210,140,174,131,160,111,221,42,182,65]},"announce":[],"urlList":[]}}