{"title":"Forbidden Holywood Collection Vol. 2 - Disk 2 - DVD9- Three on a","uid":9260543,"size":5661904896,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0ad28f570af7b407c6bb727e9395349cacb9ee42&amp;dn=Forbidden+Holywood+Collection+Vol.+2+-+Disk+2+-+DVD9-+Three+on+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":23,"time":1385618250,"description":"Forbidden Holywood Collection Vol. 2 - Disk 2 - DVD9- Three on a Match (1932) - Female (1933) [DDR]\n-------------------------------------------------------------------------------\n\nTHREE ON A MATCH 1932\nThree on a Match is a 1932 crime drama released by Warner Bros. \nThe film was directed by Mervyn LeRoy and stars Joan Blondell, Ann Dvorak and Bette Davis. \nThe film also features Warren William, Lyle Talbot, Humphrey Bogart (in his first tough-guy role), Allen Jenkins and Edward Arnold.\n\nThe film depicts the passage of time through several montage sequences, which drew positive criticism from the Spokane Spokesman-Review which described the film as utilizing &quot;a brand new approach and treatment... \nThe parade of time is cleverly portrayed through news headlines down the years, popular song sheets, reproduced on screen, and excerpts from the news weeklies from 1919 and 1932.&quot;\n\nTIME felt the film did not carry much weight, unlike previous Glasmon-Bright productions and that the suicide at the end was more implausible than tragic.\n\nFilm critic Kaspar Monahan lauded the performances in the film but called the &quot;erratic&quot; scenario &quot;loses its convincing flavor midway;&quot; \nHe also criticized Davis' role as &quot;superfluous... except that her presence is needed to give some excuse for the title.&quot;\n\nMordaunt Hall of the New York Times felt Three on a Match was tedious and distasteful as well as unintelligent.\n\nCAST:-\nJoan Blondell as Mary Keaton, also known as Mary Bernard. A tomboy as a child, Mary spent time in a reform school, before becoming an entertainer.\nAnn Dvorak as Vivian Kirkwood, a beautiful woman from a background of wealth. She is married to Robert Kirkwood, and is the mother of their young son.\nBette Davis as Ruth Wescott. Serious and studious as a child, Ruth works as a stenographer.\nWarren William as Robert Kirkwood, Vivian's husband, a successful attorney.\nLyle Talbot as Michael Loftus\nHumphrey Bogart as Harve\nAllen Jenkins as Dick\nEdward Arnold as Ace\nJack Webb (uncredited) boy in schoolyard\n\nDirected by Mervyn LeRoy\nProduced by Samuel Bischoff, Raymond Griffith, Darryl F. Zanuck\nScreenplay by Lucien Hubbard\nStory by Kubec Glasmon, John Bright\n\nTHREE ON A MATCH (superstition)\nThree on a match (also known as third on a match) is a supposed superstition among soldiers during the Crimean War to World War I. The superstition goes that if three soldiers lit their cigarettes from the same match, one of the three would be killed or that the man who was third on the match would be shot. Since then it has been considered bad luck for three people to share a light from the same match.\n\nThe belief was that when the first soldier lit his cigarette, the enemy would see the light; when the second soldier lit his cigarette from the same match, the enemy would take aim and note if the soldier was friendly or foe; when the third soldier lit his cigarette from the same match, the enemy would fire. Another explanation for this was that the first to light the match gave an enemy marksman the range to the target, the second gave the windage on the target, and the third one was shot using this information.\n\nFirst National Pictures released a film in 1932 called The Match King, starring Warren William;[6] it was loosely based on the life of the Swedish match tycoon Ivar Kreuger and depicts the protagonist creating the &quot;three on a match&quot; superstition in order to sell more matches.\n\nThe 1932 Hollywood film Three on a Match made use of the superstition, but also had a graphic of a &quot;Believe it or Not&quot; newspaper clip that explains Kreuger's exploitation of the superstition. The character in the film who is &quot;third on the match&quot; does die at the end of the picture and the final scene depicts the surviving two sharing a match.\n\nSYNOPSIS:- Three on a Match (1932)\nThree friends from childhood, Mary (Blondell), Ruth (Davis), and Vivian (Dvorak), meet again as young adults after some time apart. They each light a cigarette from the same match and discuss the superstition that such an act is unlucky and that Vivian, the last to light her cigarette, will be the first to die.\n\nMary is an entertainer who has established stability in her life after spending some time in a reform school, while Ruth works as a stenographer. Vivian is the best off of the three, married to successful lawyer Robert Kirkwood (Warren William) and with a young son, but she has grown dissatisfied with her life. Just before she is about to leave on an ocean cruiser with her son, gambler Michael Loftus (Lyle Talbot) persuades Vivian to run away with him. She soon becomes addicted to cocaine (this is not explicitly spelled out, but a young Humphrey Bogart, playing a hood named Harve, mimes the dissolute woman's habit by brushing his hand under his nose in one scene, winkingly).\n\nConcerned about Vivian's neglect of her son, Mary tells Robert where to find his boy. Robert retrieves his son and divorces Vivian. Mary and Robert become better acquainted and eventually marry.\n\nMeanwhile, Vivian's money runs out and Michael owes $2,000 to three sadistic gangsters, Harve, Dick (Allen Jenkins) and Ace (Edward Arnold), who tell him to pay up or else. \n\nDesperate, Michael tries to blackmail Robert by threatening to inform the press about Mary's criminal background. When that doesn't work, he kidnaps Robert's boy. However, in a selfless act of contrition and self-sacrifice, Vivian scrawls a message in lipstick on her nightgown and throws herself out the window of the fourth-floor apartment where she and her son are being held, alerting the authorities and saving her son's life at the cost of her own, making the superstitious comments at the beginning of the film about the last to light the cigarette being the first to die, accurate. (In real life, actress Ann Dvorak, the youngest of the three lead actresses, was also the first to die, in 1979, followed by Blondell later the same year, and, a decade later, Davis, in 1989.)\n\nThree women who were childhood schoolmates take different paths in life. Vivian marries a very wealthy lawyer and has an adorable boy. Mary, on the other hand, takes the hard road through reform school. After a superstitious faux pas, Vivian's luck turns. She strays from her steadfast husband to a life of debauchery and alcoholism. Meanwhile, Mary turns her life around and not only wins the heart of Vivian's ex-husband, but also becomes a loving step-mother to Vivian's only child. Then Vivian's worthless boyfriend makes a desperate move.\n\n=============================================================================\n\nForbidden Holywood Collection Vol. 2 - Disk 2 - Xvid 1cd - Female (1933) [DDR]\n\nFemale is a 1933 Warner Bros. pre-code film directed by Michael Curtiz and starring Ruth Chatterton and George Brent. It is based on the novel of the same name by Donald Henderson Clarke.\n\n    CAST:- \n    Ruth Chatterton as Alison Drake\n    George Brent as Jim Thorne\n    Lois Wilson as Harriet Brown, a schoolmate of Drake's\n    Johnny Mack Brown as George Cooper, an employee Drake invites to her mansion\n    Ruth Donnelly as Miss Frothingham, Drake's new secretary, after she decides \n     that male ones are too distracting\n    Ferdinand Gottschalk as Pettigew, Drake's office manager\n    Phillip Reed as Claybourne\n    Gavin Gordon as Briggs, another Drake conquest, transferred to Montreal when \n      he becomes lovestruck\n    Kenneth Thomson as Red\n    Huey White as Puggy, Drake's chauffeur\n    Douglas Dumbrille as Mumford, one of Drake's car dealers, who proposes as a \n     sort of business merger\n    Spencer Charters as Tom\n    Robert Greig as James, Drake's butler (uncredited)\n\n    Directed by Michael Curtiz, William Dieterle, William A. Wellman\n    Produced by Robert Presnell Sr.\n    Written by Donald Henderson Clarke (story), Gene Markey, Kathryn Scola\n\nSYNOPSIS:- Female (1933)\nAlison Drake (Ruth Chatterton) is the wealthy owner and hard-driving, no-nonsense head of a large automobile company, inherited from her father. Her work has caused her to lose her youthful romanticism, and she has casual affairs with men, including her own employees.\n\nAlison hosts a party at her mansion, but becomes fed up with the men out to either sell her things or marry her for her money. She dresses down and goes to an amusement park, where she picks up a man at a shooting gallery. They have fun together, but he refuses her offer to go home with him.\n\nThe next day, they meet again at her factory. To their mutual astonishment, he turns out to be Jim Thorne (George Brent), a gifted engineer she has ordered her underlings to hire away from her competition. Saying that she has no time now, Alison has him come to her mansion that night, supposedly to discuss his plans for the company in detail. She attempts to seduce him, but he rejects her as anything other than his employer.\n\nAnnoyed, she turns to her assistant, Pettigew (Ferdinand Gottschalk), for advice. He tells her that men want women who are softer and less independent, so she adjusts her tactics. \n\nShe tricks Jim into a picnic and wears him down. In the end, he succumbs to her charms.\n\nThe next day, he shows up at her office with a marriage license, but she informs him that she likes their relationship just the way it is. Outraged, he quits.\n\nAlison has another problem on her hands. Her company needs more financing to survive, but another firm is intent on taking advantage of the situation to take over and has gotten the local banks to turn her down. She sets up an appointment to meet with bankers in New York City, but then breaks down when she realizes that she cannot live without Jim.\n\nShe has the police track down which way he went and drives off after him. She eventually finds him (at another shooting gallery) and tells him that she is willing to get married. Then, he realizes that they can fly to New York in time to save her company. Even so, she tells him that he will run the firm, while she has nine children.\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 123 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 123 mins","torrent":{"xt":"urn:btih:0ad28f570af7b407c6bb727e9395349cacb9ee42","amp;dn":"Forbidden+Holywood+Collection+Vol.+2+-+Disk+2+-+DVD9-+Three+on+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad28f570af7b407c6bb727e9395349cacb9ee42","infoHashBuffer":{"type":"Buffer","data":[10,210,143,87,10,247,180,7,198,187,114,126,147,149,52,156,172,185,238,66]},"announce":[],"urlList":[]}}