{"title":"The Dixie Dregs - Dregs of the Earth","uid":4142333,"size":88095164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0c606c35a98a306642e17b835d35f8febcad6f4d&amp;dn=The+Dixie+Dregs+-+Dregs+of+the+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"onlycash","files":11,"time":1208554274,"description":"320K Mp3 Files\n\n\n1980 album on Arista. Contains eight tracks, including RoadExpense, Pride O The Farm and Twiggs Approved.\n\nThe Dixie Dregs are a jazz fusion band formed in the 1970s. Their mostly instrumental music fuses jazz, southern rock, bluegrass and classical forms in an often unique, virtuostic style.\n\n\n\nTrack listing\nRoad Expense (3:24) \nPride O the Farm (3:40) \nTwiggs Approved (4:29) \nHereafter (6:21) \nThe Great Spectacular (3:20) \nBroad Street Strut (3:54) \nIm Freaking Out (9:06) \nOld World (2:00) \n\nDixie Dregs\nSteve Morse - acoustic and electric guitars, banjo, pedal steel\nAndy West - fretted and fretless bass\nAllen Sloan - acoustic and electric violins, viola\nRod Morgenstein - drums and percussion\nT Lavitz - acoustic and electric piano, organ, synthesizer, clavinet\n\nAll songs written by Steve Morse\nPublished by Dregs Music Co., BMI\n\nProduced by Steve Morse\nRecorded at Axis Sound Studio, Atlanta, GA\n\nBillboard, May 10, 1980\n\nThe Dregs are a Southern quintet which defies categorization. The group rocks furiously, slides into slick bluegrass-pop laced with jazz and then drops into electric Elizabethan madrigals. Its busy, hard to follow and strictly instrumental. No vocals, but the musicianship is often superb. Best cuts: The Great Spectacular,Old World,Im Freaking Out. \n\n\nPeople Weekly, August 11, 1980\n\nThey certainly arent the dregs. And they arent exactly Dixie either, though two members of the five-man group, guitarist Steve Morse and bassist Andy West, met in high school in Augusta, Ga. The band does show a bluegrass tint, especially in the fiddling of Allen Sloan, who apprenticed, in part, with the Miami Philharmonic. In its more disciplined moments, the quintet goes into fuguelike bursts that resemble what a 16th-century band of wandering minstrels might have sounded like if they had had Fender lutes and an electrical system to plug into. More often the Dregs play bluesy rock, working off Morses compositions with dexterity and a sense of continuity. (There are no vocals) Sloan, Morse and drummer Rod Morgenstein-whose solo on Im Freaking Out is a marvel of melodic percussion-are especially praiseworthy on this, the five-year-old groups fifth LP. \n","torrent":{"xt":"urn:btih:0c606c35a98a306642e17b835d35f8febcad6f4d","amp;dn":"The+Dixie+Dregs+-+Dregs+of+the+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c606c35a98a306642e17b835d35f8febcad6f4d","infoHashBuffer":{"type":"Buffer","data":[12,96,108,53,169,138,48,102,66,225,123,131,93,53,248,254,188,173,111,77]},"announce":[],"urlList":[]}}