{"title":"Ass.Titans.5.XXX.DVDRiP.XviD-VBT","uid":6150139,"size":2425759638,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0ce876bda04b17565877fe05ea152f240abbbb57&amp;dn=Ass.Titans.5.XXX.DVDRiP.XviD-VBT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kelvin09","files":13,"time":1296850616,"description":"Cover\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4036_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4036_1.jpg.html&lt;/a&gt;\n\n\n\nScreens\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4035_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4035_2.jpg.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4034_3.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4034_3.jpg.html&lt;/a&gt;\n\nRiley Evans, Phoenix Marie, David Perry, Toni Ribas, Lea Lexis, Erik Everhard, Shannya Tweeks, Mike Angelo, Eliska Cross, Ian Scott, Bea Stiel, Frank Gun, Nick Lang, Cristina Bella, Evan Rochelle\n\n\nRaul Cristian's Ass Titans 5 continues the Cruel Media tradition of the finest and sexiest in international sluttage. Raul's handpicked selection of professional ass whores get royally dominated by his revolving team of shaved, well-hung, beefy male terminators, and no girl's ass is spared. The first scene documents a live Webcast with blonde American sluts Riley Evans and Phoenix Marie, teamed with two muscular gents who are dressed strangely in fishnets and women's wigs! They all get down to business, though, in an all-out, hard-core anal pounding party. Phoenix actually sits at the computer and chats with fans as she's getting her asshole reamed from behind! A short foot-job and lots of brutal sodomy later, the ladies each get a mouthful of sperm as a souvenir. Then little Lea Lexis takes on the massive member of Erik Everhard in a nasty scene of rough anal and ass-to-mouth penetration that's belied by the petite blonde's giggly, cheerful attitude. French brunette Shannya Tweeks seems to get more than she bargains for when two Euro-dicks torment her poor asshole with probing hands and swinging cocks. The submissive cutie is ridden like a beast of burden, crawling on all fours across the lawn while a maniac urges her forward by fucking her abused ass. With spitting, slapping and double anal penetration, porn doesn't get much rougher than this! After that, we meet Eliska, a cropped-hair beauty from the Lorraine region of France. She proves herself an expert cocksucker, and willing to take a double penetration. After getting her sphincter gaped wide from nonstop buggering, Eliska's ass is showered with two loads of semen. Not to be outdone, the next girl, Hungarian blonde Bea Stiel, takes on a team of three men who relentlessly fuck her throat and ass until her poor sphincter is swollen and purple. They each ejaculate in her open mouth, and Bea swallows it all. Finally, in a DVD bonus, veteran porn queen Cristina Bella gets the Cruel Media treatment from a stud who plows her tender asshole and her mouth in turn. Cristina ends up with a dilated anus and a mouthful of gooey cum. The butt sex here is positively Titanic!\nRaul Cristian's Ass Titans 5 is a double-disc DVD including a 35-minute bonus scene starring Christina Bella and photo slideshow.","torrent":{"xt":"urn:btih:0ce876bda04b17565877fe05ea152f240abbbb57","amp;dn":"Ass.Titans.5.XXX.DVDRiP.XviD-VBT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ce876bda04b17565877fe05ea152f240abbbb57","infoHashBuffer":{"type":"Buffer","data":[12,232,118,189,160,75,23,86,88,119,254,5,234,21,47,36,10,187,187,87]},"announce":[],"urlList":[]}}