{"title":"marco pistorello - (2007) - marco pistorello","uid":3696897,"size":68871310,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e10f9686398ed8af4ed66d2d650c7348fa7cab7&amp;dn=marco+pistorello+-+%282007%29+-+marco+pistorello+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"trnepalla","files":13,"time":1180099463,"description":"\nMPEG1, Layer III\nBitrate: 256 kb/s\nFreq. 44100 Hz\nMode: Joint Stereo\n\n &lt;a href=&quot;\nhttp://www.bladencountyrecords.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bladencountyrecords.com/&lt;/a&gt;\n\n\nRecommended If You Like: Seu Jorge, Django Reinhardt, Manu Chao\n\nI am 27, been in LA for one year, but since 2001 I started an on and off relationship with California, LA in particular but I also lived in San Francisco. I would spend 6 months/one year here, then go back to europe for 9/6 months and then come back. I didn&amp;#039;t always go back to Venezia, Italy where I was born and raised and where all my friends and family are, once I stayed in Paris for one year. Made good friends there too, but the &quot;music scene&quot; was kinda disappointing..\n\nBefore 2001 I played with a few different bands, the most dear of which to me was a black metal group that lasted for many years and whose music was very, progressive, jazzy, classic-influenced but yes metal and extremely dark.\n\nI played bass in that band, because guitars were already taken but I always played guitar, and &quot;sung&quot; (hi-pitched scream, constant, but awesome lyrics in very harsh and superb Italian, main influence was Shakespeare and Pasolini!!)\n\nAfter underdog success in the european underground metal scene of the 90s, death of one member and disbanding I formed a rock and roll trio with me fronting as guitarist/singer. The name of the band was Lobotomix. The name was perfect because none of my two bandmates (and good friends of mine) could ever answer to a question that started like &quot;D&amp;#039;ya remeber....?&quot; Music very much influenced by Ramones, Motorhead, Black Sabbath, Led Zeppelin, AC/DC but very modern at the same time. It was great vibes and great local success, but it didn&amp;#039;t go very far: my bandmates weren&amp;#039;t really serious about it, and I started traveling, which was very inspirational with songwriting anyway.\n\nI always played acoustic guitar on the side, and I thought to put down some of the songs I have always been playing.\n\nI didn&amp;#039;t go to Univerity (if this is what you mean with college), but I am not an High School drop-out unfortunately..\n\nI didn&amp;#039;t get my heart broken, but I got a kindney broken indeed: skateboarding can hurt. I had an accident while trying to slide a metal tube with my board in a skatepark, and I fell so badly that my whole body compressed my left kidney making it burst: literally broken in two. I had to stay in the hospital for ten days lying on a bed on my back, without changing position, ever! It was almost worse than jail, but my kidney healed by itself, without surgery. It stuck back together: unbelievable. Now it is perfect.\n\nI had to be very quiet for 6 months after the accident: no sport, no smoking, no drinking, no drugs. Anything that could alter my blood pressure. In that period I played a lot and came out with so many songs that I formed that rock band. I also started considering traveling a little more seriously: you could die tomorrow and what have you seen? Nothing, so I guess that was where it all began.\n\nI am very happy to have both my kidneys and both my testicles working thou. They cause me so much happyness and they make me swing while I rock and roll..\n\nI will be soon playing some shows in LA, and Portland too I hope, but I didn&amp;#039;t slept with many movie stars so far, but I met many. They just walk down the street like normal. The city is rich with freaks, transvestites, mads, bloods and cribs thou.. Why Italians do so much coke? Why all coke dealers in Central America are all Italians? I will answer this one another time.. ","torrent":{"xt":"urn:btih:0e10f9686398ed8af4ed66d2d650c7348fa7cab7","amp;dn":"marco+pistorello+-+%282007%29+-+marco+pistorello+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e10f9686398ed8af4ed66d2d650c7348fa7cab7","infoHashBuffer":{"type":"Buffer","data":[14,16,249,104,99,152,237,138,244,237,102,210,214,80,199,52,143,167,202,183]},"announce":[],"urlList":[]}}