{"title":"Prison Architect - Alpha 21c - Linux","uid":10262780,"size":117732323,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:0e27f420b689312ae3ae4142c6212bf26dc93816&amp;dn=Prison+Architect+-+Alpha+21c+-+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sharpshot94549","files":-1,"time":1401485940,"description":"Prison Architect Alpha 21c\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\nChange-Log \n\n= Narcotics\nPrisoners can now take drugs (typically smuggled in through visitation), and develop addictions\nAddiction gets stronger with each use of a drug\nPrisoners go into withdrawal if they do not get their drugs fix quick enough\nSome prisoners arrive with existing addictions, other prisoners try drugs when bored or dissatisfied\nAll drugs have a chance to cause an overdose, which is lethal unless immediately treated by a Doctor\nThe chance of overdose increases with the strength of the addiction\nCurrently included:\nHeroin\nCocain\nAlchohol\nTwo new Reform programs to help combat drug addiction:\nMethodone program, a chemical suppliment that helps remove the craving of addicted prisoners\nAlchoholics anonymous meeting, a group therapy session aimed at reducing the psychological dependence on booze\nPrisoners who refrain (or are prevented) from taking drugs for long enough to make it through withdrawal have a chance to cure their addiction, Cold Turkey style.\n= Advanced regime control\nYou can now control the regime for each security group independantly - Min sec / Normal sec / Max sec prisoners\nUse this to rotate the actions of your different prisoner categories throughout the day\nRegime 'Nothing' has been renamed 'Lockup', to better reflect its meaning. Prisoners must return to their cells during Lockup.\n= Language selector\nThere is now a Union Jack flag in the Main Menu (top left) which can be clicked on to change the game language.\nThis opens the language selector screen, which shows all currently installed language packs (MODS)\nIn the STEAM version this screen also lists ALL language packs currently available via the Steam Workshop Selecting any language pack will automatically download it and apply it, and the Union Jack icon will change appropriately\nTranslation work : Many more hard-coded strings have been exported to the language file, ready for translation\n= Surrender\nPrisoners now have a chance to surrender when faced with lethal force\nArmed guards shout warnings before opening fire. Weaker prisoners will surrender immediately, raising their hands in the air.\nMore aggressive prisoners may surrender after being shot at or wounded by gunfire.\nSurrendered prisoners are immediately 100% suppressed, and will return to their cells after the armed guards have passed. NOTE : Soldiers still do not shout warnings, and will not accept surrender once they have engaged a target.\n- You can now assign discretionary punishments from a Prisoners rap sheet - up to 24 hours Lockdown (in cell) or 24 hours in Solitary\n- Bank loans no longer count against you in the consideration of bankruptcy. So you can use a bank loan to escape bankruptcy if it is available.\n- Fixed : Army trucks no longer get stuck on locked Road Gates\n- In the &quot;Names in the Game&quot; list you can now select your entry and tick the box labelled &quot;This is me&quot;\nThis sets your prisoner avatar to this character. If you find yourself locked up within your prison, this is the prisoner who will embody you.\n- Many main menu screens now use better font sizes for lists\n- Nutritional policy moved to Policy window. Policy now unlocked by Warden\n- The maximum copy size of the Clone tool has been doubled from 6 squares to 12 squares\n- Dog sniff range (drug detection) has been reduced slightly\n- Improved visual effect for tazer fire","torrent":{"xt":"urn:btih:0e27f420b689312ae3ae4142c6212bf26dc93816","amp;dn":"Prison+Architect+-+Alpha+21c+-+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e27f420b689312ae3ae4142c6212bf26dc93816","infoHashBuffer":{"type":"Buffer","data":[14,39,244,32,182,137,49,42,227,174,65,66,198,33,43,242,109,201,56,22]},"announce":[],"urlList":[]}}