{"title":"Run your car on tap water","uid":4042239,"size":345212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12288225b6ca3f3e0bd2d5a15e377ebc4244ae2d&amp;dn=Run+your+car+on+tap+water&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"k5_flik","files":1,"time":1203736440,"description":"If you would like to start running your car on tap water alone and not pay for gas anymore this is some information that would be very helpful. It has designs and schematics for building the equipment with off the shelf parts. \n\nEasy to use. This is information that costs $30 plus off the internet. Spread the information everywhere.\n\nDownload this. Give it to everyone you know.\n\nUPDATE:\nJust so you know. I uploaded this before even testing it. This gives you a great start of what you will need to do to get a car running on water alone. I have been working on this project since I uploaded this. The idea works. I have a 78 shortbed chevy running off water alone. The trick is multiple cells running off of pulse modulation that creates a resonate tone that the water will break down on. If you use straight DC the cells will use 10x the amount of current then if you use pulse modulation. You must play around with this quite a bit to work. GREAT STARTER THOUGH!!! I will try to put together some schematics and drawings of my own working system. I am now working on an automatic system that will change frequencies to utilize the best efficiency for any water (distilled, tap, muddy, salt, etc...)","torrent":{"xt":"urn:btih:12288225b6ca3f3e0bd2d5a15e377ebc4244ae2d","amp;dn":"Run+your+car+on+tap+water","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12288225b6ca3f3e0bd2d5a15e377ebc4244ae2d","infoHashBuffer":{"type":"Buffer","data":[18,40,130,37,182,202,63,62,11,210,213,161,94,55,126,188,66,68,174,45]},"announce":[],"urlList":[]}}