{"title":"La Commune","uid":3647744,"size":3470974588,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12929f0c8e6e9c773a79046aa6df01e462568ac9&amp;dn=La+Commune&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gamma Point","files":2,"time":1174885281,"description":"La Commune (Paris, 1871) (2000) is a film by Peter Watkins about the Paris Commune. It is a historical re-enactment in the style of a documentary, and was shot in just 13 days in an abandoned factory on the outskirts of Paris. The large cast is mainly non-professional, including many immigrants from North Africa, and they did much of their own research for the project. As Watkins says, &quot;The Paris Commune has always been severely marginalized by the French education system, despite - or perhaps because - it is a key event in the history of the European working class, and when we first met, most of the cast admitted that they knew little or nothing about the subject. It was very important that the people become directly involved in our research on the Paris Commune, thereby gaining an experiential process in analyzing those aspects of the current French system which are failing in their responsibility to provide citizens with a truly democratic and participatory process.&quot;[1] Like many of Watkins&amp;#039; later films, it is quite lengthy - a long cut runs 5 hours and 45 minutes, though the more common version is 3 and a half hours long.\n\n-Wikipedia","torrent":{"xt":"urn:btih:12929f0c8e6e9c773a79046aa6df01e462568ac9","amp;dn":"La+Commune","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12929f0c8e6e9c773a79046aa6df01e462568ac9","infoHashBuffer":{"type":"Buffer","data":[18,146,159,12,142,110,156,119,58,121,4,106,166,223,1,228,98,86,138,201]},"announce":[],"urlList":[]}}