{"title":"Trooper Hook {Western} 1957","uid":7399169,"size":1284246633,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12af0ad3ed5291f2a11ba88121834ded1220d881&amp;dn=Trooper+Hook+%7BWestern%7D+1957&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1341015245,"description":"Just another western didn't see anything on site for it so thought would just add it for the western fans.  surprisingly enough a 1957 they left in black and white which adds a little more flair to a old western in my opinion\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0051111/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0051111/&lt;/a&gt;\n\nstory\n\nAfter a band of Indians kill a group of soldiers, Sergeant Hook captures them and their leader Nanches. Among the prisoners is Nanches' son and the boy's white mother captured by them nine years earlier. Hook's assignment is to escort the mother and son to the woman's husband. Traveling by stagecoach they learn that Nanches has escaped and it's not long before he and his warriors show up intent on reclaiming the boy.\n\nuser review\n\nI saw this film years ago, and still remember it for the incredible photography of the traveling stagecoach and backgrounds.The Cinematography rivals anything John Ford has done. The movie has received mediocre reviews, however, one should remember that the story was told as a ballad. I felt it dealt surprisingly well with inter-race prejudice. Barbara Stanwyck had a reputation for being pro-native-american. She acted her role as the white mother of an indian child well. Joel McCrea also was under-rated in his role as the sympathetic cavalryman. The supportings were solid gold character actors-Royal Dano as the stagecoach driver, Earl Holliman as the shy drifter, Rudolfo Hoyos as the Apache leader determined to get his son back. For a non-color film, it was better than most westerns of the era. I hope that someday it can be released on vhs for all to enjoy the wonderful camera work in it. ","torrent":{"xt":"urn:btih:12af0ad3ed5291f2a11ba88121834ded1220d881","amp;dn":"Trooper+Hook+%7BWestern%7D+1957","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12af0ad3ed5291f2a11ba88121834ded1220d881","infoHashBuffer":{"type":"Buffer","data":[18,175,10,211,237,82,145,242,161,27,168,129,33,131,77,237,18,32,216,129]},"announce":[],"urlList":[]}}