{"title":"[PS3] History: Legends of War Patton","uid":9772799,"size":4975494439,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:15320db0b850a045d9fd1d87f5485eb4942c123c&amp;dn=%5BPS3%5D+History%3A+Legends+of+War+Patton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":-1,"time":1394981347,"description":"Mission Types\n\n* Attack Mission - Eliminate the enemy units.\n* Defense Mission - Resist the enemy's advances during a number of turns and sometimes to protect certain units.\n* Infiltration Mission - Various objectives to be completed using only infantry units and avoiding alerting the enemy.\n* Sabotage Mission - Various objectives to be completed using only infantry units, but with the enemy on alert.\n\n\nTypes of Unit\n\n* Paratrooper-These elite units, trained in special tactics, are fast, powerful and very versatile. They are also very skilled at handling grenades.\n* Commando-These are the fastest and most powerful infantry units. They are especially skilled in infiltration, using their dagger to silently eliminate the enemy.\n* Sniper-Their special training gives them the ability to shoot over long distances without being discovered. One bullet, one enemy eliminated. These units are perfect for eliminating selected targets.\n* Medic- This unit will be necessary to heal your wounded soldiers. They should not be exposed to enemy fire.\n* Engineer-These units are specialized in repairing all types of vehicles during missions. They can be a great help, but must be protected from the enemy.\n* Reconnaissance-These are the units with the largest vision range. They are perfect for scouting an area in preparation for the arrival of the remaining troops.\n* Aerial Transporter -These aircraft can fly over the conflict zone and drop supplies, such as medic kits and ammo boxes.\n* Anti-tank Cannon - The Germans use anti-tank cannons against American armored vehicles with protection and great efficiency. Their Achilles' heel is grenades thrown by the infantry.\n* And many more!\n\nAssume the role of General Patton, commanding the Third U.S. Army, also known as &quot;Patton's Own&quot;. Lead your troops from the beaches of France to the city of Berlin, along a complete Campaign composed of 35 different missions, with varied objectives to fight Nazi forces, being possible to cause changes in the course of WWII History!!!\n\nLegends of War: Patton's Campaign is a strategy game where the Campaign mode combines two different game modes: a high-level strategic management part, to set up your army with the units of your choice which can be evolved to acquire new features and skills; and a tactical and turn-based part, where you will fight across different battlefields seeking the defeat of Nazi army with the least casualties and number of turns possible. 53 different types of units, distributed along infantry, armored vehicles and aircrafts Special units, including snipers, elite forces, commandos, fighters, and bombers In-game and video cinematics, depicting the evolution of the Campaign Special items in battlefields, implying units' power-ups Evolution of units along the Campaign, bringing some innovative RPG mechanics Go Head-to-Head with the a Hotseat multiplayer option Simple and effective control system, specially adapted for rich gameplay on a PSP\n____________________________________________________\n\nUSE LATEST WINRAR 5 TO EXTRACT!\n\nChange the game settings in multiMAN 04.55.00 to External, BD Mirror and set permissions if you've copied it to external usb drive. ","torrent":{"xt":"urn:btih:15320db0b850a045d9fd1d87f5485eb4942c123c","amp;dn":"%5BPS3%5D+History%3A+Legends+of+War+Patton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15320db0b850a045d9fd1d87f5485eb4942c123c","infoHashBuffer":{"type":"Buffer","data":[21,50,13,176,184,80,160,69,217,253,29,135,245,72,94,180,148,44,18,60]},"announce":[],"urlList":[]}}