{"title":"4Media_MP4_Converter_6.5.8_build_0602","uid":6492413,"size":34284755,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:15f3ad9de998079d61bab6d696056161cc12690d&amp;dn=4Media_MP4_Converter_6.5.8_build_0602&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1308935032,"description":"4Media MP4 Converter 6.5.8 build 0602\n\n4Media MP4 Converter provides the best and easiest MP4 video converting way to convert AVI to MP4, WMV to MP4, MPEG to MP4 and convert MP4 to AVI, MP3 for enjoying the fantastic movies and music on iPod, iPhone 3G, iPhone 3GS, iPhone 4, PSP, PS3, Apple TV, Xbox 360, Zune, iRiver PMP, Creative Zen Vision, Archos, etc.\n\nThe conversion of High-Definition videos is highly supported to bring you a more vivid movie world. Moreover, this MP4 converter gives you the capacities to take video snapshot, decode CD, customize parameters like bit rate and frame rate, split large files, etc. to realize personalized conversion.\n\nMultithread and batch conversion will make your MP4 converting process faster and easier. Download 4Media MP4 Converter for Windows to colorize your media life now.\n\nKey Features\nHigh MP4 conversion speed\nEngined with NVIDIA CUDA &amp; AMD APP technology,Detecting CPU automatically, supporting multithreading conversion, the conversion speed will be promoted with the better performance of your system.\n\nHigh compatibility of MP4 devices\nWith 4Media MP4 Converter, almost all video formats can be converted to MP4 videos so as to match PS3, PSP, iPod, iPhone 3G, iPhone 3GS, iPhone 4, Apple TV, Xbox 360, Zune, Archos AV500, Archos AV700, Archos Gmini402, iRiver PMP, Creative Zen Vision, etc.\n\nChoose various profiles for one\nIf you own more than one MP4 players, just choose multiple profiles for the same source to output at one time to meet the needs of multiple players. The profile list is sorted by different types.\n\nCompress or split file\nA Bitrate Calculator tool can help you compress a large file to smaller one, and if you want to keep the quality, try to split it into several smaller ones.\n\nMore settings\nSet start time and duration to get a segment, choose video size, bit rate, frame rate, aspect ratio, audio codec, sample rate and so on in this MP4 video converter.\n\nBatch process\nLoad as many video files as you like, and convert them to MP4 movies in batches with a single click.\n\nRun in background\nFor the convenience of running other important programs, you can run 4Media MP4 Converter in background to lower the priority.\n\nAfter done actions\nSet after done action as shutdown, hibernate, standby or exit.\n\nPower Management\nPower management and pictures from camera as input are available.\n\nMultiple languages and skins\nTo cater to kinds of mother-tongue users and moods, five languages and three skins are provided in this MP4 video converter.\n\nHome page - http://www.mp4converter.net/mp4-converter-win.html\n\n","torrent":{"xt":"urn:btih:15f3ad9de998079d61bab6d696056161cc12690d","amp;dn":"4Media_MP4_Converter_6.5.8_build_0602","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f3ad9de998079d61bab6d696056161cc12690d","infoHashBuffer":{"type":"Buffer","data":[21,243,173,157,233,152,7,157,97,186,182,214,150,5,97,97,204,18,105,13]},"announce":[],"urlList":[]}}