{"title":"Electromagnetics For Electrical Machines [2015] [PDF]","uid":12592380,"size":6083189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1612d1627e4b07eee323969c12af9aa7c7c8b8ff&amp;dn=Electromagnetics+For+Electrical+Machines+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1445121099,"description":"Title: Electromagnetics For Electrical Machines \r\nAuthor: Saurabh Kumar Mukerji, Ahmad Shahid Khan, Yatendra Pal Singh \r\nFormat: PDF \r\nHardcover: 439 pages \r\nPublisher: CRC Press; Har/Psc edition (March 6, 2015) \r\nLanguage: English \r\nISBN: 978-1498709132 \r\n\r\n\r\nElectromagnetics for Electrical Machines offers a comprehensive yet accessible treatment of the linear theory of electromagnetics and its application to the design of electrical machines. Leveraging valuable classroom insight gained by the authors during their impressive and ongoing teaching careers, this text emphasizes concepts rather than numerical methods, providing presentation/project problems at the end of each chapter to enhance subject knowledge.\r\n\r\nHighlighting the essence of electromagnetic field (EMF) theory and its correlation with electrical machines, this book:\r\n\r\n- Reviews Maxwell’s equations and scalar and vector potentials\r\n- Describes the special cases leading to the Laplace, Poisson’s, eddy current, and wave equations\r\n- Explores the utility of the uniqueness, generalized Poynting, Helmholtz, and approximation theorems\r\n- Discusses the Schwarz–Christoffel transformation, as well as the determination of airgap permeance\r\n- Addresses the skin effects in circular conductors and eddy currents in solid and laminated iron cores\r\n- Contains examples relating to the slot leakage inductance of rotating electrical machines, transformer leakage inductance, and theory of hysteresis machines\r\n- Presents analyses of EMFs in laminated-rotor induction machines, three-dimensional field analyses for three-phase solid rotor induction machines, and more\r\n\r\nElectromagnetics for Electrical Machines makes an ideal text for postgraduate-level students of electrical engineering, as well as of physics and electronics and communication engineering. It is also a useful reference for research scholars concerned with problems involving electromagnetics","torrent":{"xt":"urn:btih:1612d1627e4b07eee323969c12af9aa7c7c8b8ff","amp;dn":"Electromagnetics+For+Electrical+Machines+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1612d1627e4b07eee323969c12af9aa7c7c8b8ff","infoHashBuffer":{"type":"Buffer","data":[22,18,209,98,126,75,7,238,227,35,150,156,18,175,154,167,199,200,184,255]},"announce":[],"urlList":[]}}