{"title":"1987 AFC Championship - The Fumble [DVDrip, Engsubs]","uid":8932607,"size":1439115058,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:177ae4218db2301b97b2711e13364f4264656a15&amp;dn=1987+AFC+Championship+-+The+Fumble+%5BDVDrip%2C+Engsubs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1379491271,"description":"1987 AFC Championship - The Fumble [DVDrip, Engsubs]\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.34 GiB\nDuration                                 : 2h 44mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 702 pixels\nHeight                                   : 478 pixels\nDisplay aspect ratio                     : 4:3\nFrame rate mode                          : Variable\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1661336/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1661336/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/0e2be92d61b143906b399690ba0641e3cdedd8d3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/0e2be92d61b143906b399690ba0641e3cdedd8d3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Fumble&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Fumble&lt;/a&gt;\n\nGame summary\n        1\t2\t3\t4\tTotal\nBrowns\t0\t3\t21\t9\t33\nBroncos\t14\t7\t10\t7\t38\n\nat Mile High Stadium, Denver, Colorado\nGame time: 4:00 p.m. EST/2:00 p.m. MST\nGame attendance: 76,197\nReferee: Jim Tunney\nTV announcers (NBC): Dick Enberg and Merlin Olsen\n\nThis game is best remembered for The Fumble when Browns running back Earnest Byner fumbled at the Broncos' 2-yard line with 1:05 left. Also, these two teams were scheduled to meet during the regular season, however, the game happened to be scheduled during the week of games that was canceled (they were to meet on Monday Night Football).\n\nSeveral early Cleveland miscues helped the Broncos jump to an early 14-0 lead. First, Cleveland kick returner Gerald McNeil was tackled by Tony Boddie on his own 12-yard line. Then after a sack by Denver lineman Simon Fletcher, Bernie Kosar threw a pass that went through the arms of Webster Slaughter and into the hands of linebacker Freddie Gilbert on the Browns 17, setting up John Elway's 8-yard touchdown pass to Ricky Nattiel. On Cleveland's next drive, FB Kevin Mack lost a fumble while being tackled by Tony Lilly. One play later, Gene Lang's 42-yard run (easily surpassing the team's longest run of the season; 29 yards) gave Denver a first and goal situation. Elway eventually threw an incomplete pass on third and goal from the Browns 3-yard line, but a defensive holding penalty on Frank Minnifield gave Denver a first down at the 1, and running back Steve Sewell scored a touchdown on the next play.\n\nAfter the ensuing kickoff, Kosar completed a 25-yard pass to tight end Ozzie Newsome and a 19-yarder to Clarance Weathers on 3rd down and 17 on the way to a 29-yard field goal by Matt Bahr two minutes into the second quarter. But Denver stormed right back on an 80-yard drive that ended with a 1-yard touchodown run by Lang, making the score 21-3. A sack by Denver's Rulon Jones helped force the Browns to a three and out. This time all the Broncos could manage was a missed field goal by Rich Karlis. But once again Cleveland could not move the ball and turned it over with a fumble from receiver Brian Brennan that was recovered by cornerback Randy Robbins. This time the Browns defense stepped up, sacking Elway twice and forcing Denver's first punt of the game. After that, Kosar's 24-yard comepletion to Slaughter set up a 45-yard field goal attempt by Bahr, but he sent it wide right as time expired in the half.\n\nFour plays into the second half, Browns defensive back Felix Wright intercepted a pass from Elway, setting up Kosar's 18-yard touchdown pass to Reggie Langhorne. But less than a minute and a half later, Elway threw a short pass to receiver Mark Jackson, who broke a tackle from Mark Harper and evaded a tackle attempt from Wright on the way to an 80-yard touchdown reception (the longest play in Denver postseason history), giving the Broncos a 28-10 lead. Cleveland responded with two consecutive touchdowns. First Kosar threw a 32-yard touchdown pass to Byner. Then Broncos returner Ken Bell muffed the kickoff and was downed inside his own 10-yard line. Following a three and out, McNeil returned their punt to the Broncos 42. Kosar then completed four consecutive passes en route to a 4-yard touchdown run by Byner, making the score 28-24 with less than four minutes left in the third quarter. Denver struck back with a 38-yard field goal from Karlis to give them a seven-point lead going into the final period.\n\nIn the fourth quarter, the Browns drove 87 yards and tied the score with Kosar's 4-yard touchdown pass to Webster Slaughter, but it was countered by Elway's 20-yard touchdown pass to running back Sammy Winder with 4 minutes left in the game.\n\nAfter the ensuing kickoff, the Browns got the ball on their own 25-yard line. Byner started out the drive with a 16-yard burst and a 2-yard run, and then Kosar completed two passes to Brennan for 33 total yards. Following an encroachment flag on defensive lineman Andre Townsend and 6-yard run by Byner, an offsides penalty on Denver linebacker Karl Mecklenburg moved the ball to the Broncos 8-yard line with 1:12 remaining in regulation. The Browns had moved 67 yards in just six plays covering 2:41. On the next play, Byner took a handoff and appeared to be on his way to score the game-tying touchdown. But he was stripped of the ball by Broncos defensive back Jeremiah Castille, and fumbled at the 2-yard line. The Broncos recovered the fumble (Castille made the recovery), gave the Browns an intentional safety, and went on to win 38-33.\nByner's fumble ruined an otherwise superb performance, as he finished the game with 67 rushing yards, 7 receptions for 120 yards, and 2 touchdowns. Elway finished the game with 14 of 26 completions for 281 yards and 3 touchdowns with 1 interception, and also rushed for 36 yards. His top target was receiver Mark Jackson, who caught 4 passes for 134 yards and a touchdown. Nattiel added 5 receptions for 95 yards and a touchdown.\n\nThis game was later featured on NFL's Greatest Games.\n","torrent":{"xt":"urn:btih:177ae4218db2301b97b2711e13364f4264656a15","amp;dn":"1987+AFC+Championship+-+The+Fumble+%5BDVDrip%2C+Engsubs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177ae4218db2301b97b2711e13364f4264656a15","infoHashBuffer":{"type":"Buffer","data":[23,122,228,33,141,178,48,27,151,178,113,30,19,54,79,66,100,101,106,21]},"announce":[],"urlList":[]}}