{"title":"Randi Rhodes Show with Nicole Sandler - February 19 2013","uid":8166143,"size":48591824,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:18512f6dd80af3e62db5cfd662e1df442363c898&amp;dn=Randi+Rhodes+Show+with+Nicole+Sandler+-+February+19+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":4,"time":1361338787,"description":"Tuesday, February 19, 2013\n\nRandi will be back tomorrow (Wed), but Nicole Sandler's in today with some great guests...\n\n\nAfter the success of the 'Forward on Climate' rally in Washington, DC last weekend the biggest question many Americans have is &quot;What can I do to help?&quot; President and CEO of the National Wildlife Federation Larry Schweiger will tackle that question and detail how America's wildlife is struggling to keep up with the effects of climate change.\n\nThe Nation Magazine's Lee Fang will talk about his latest look at money in politics, co-written with Josh Eidelson. Their focus is Sylvia Matthews Burwell, the current head of the charitable arm of Walmart--and President Obama's pick to head the Office of Management and Budget.\n\nIn a less controversial vein, President Obama's proposal of preschool for all Americans has some pretty diverse and experienced support. This includes the backing of Randi Weingarten, president of the American Federation of Teachers, who will discuss how realistic and potentially beneficial the President's plan is.\n\nFinally, writer, comedienne, and journalism professor at Hofstra University Julianna Forlano will talk with Nicole about subjects from climate change to Obama's cabinet, and how absurd mainstream media's coverage of many of the most important topics really is.","torrent":{"xt":"urn:btih:18512f6dd80af3e62db5cfd662e1df442363c898","amp;dn":"Randi+Rhodes+Show+with+Nicole+Sandler+-+February+19+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18512f6dd80af3e62db5cfd662e1df442363c898","infoHashBuffer":{"type":"Buffer","data":[24,81,47,109,216,10,243,230,45,181,207,214,98,225,223,68,35,99,200,152]},"announce":[],"urlList":[]}}