{"title":"Tim Knol - Tim Knol (Self-Titled)(Retail)(2010)(Indie Folk Roots","uid":6440703,"size":328027170,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1972affa5b0dd87422b02bfd179577c4f439d458&amp;dn=Tim+Knol+-+Tim+Knol+%28Self-Titled%29%28Retail%29%282010%29%28Indie+Folk+Roots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SoundbaronPirateBay","files":25,"time":1306973513,"description":"Music : Indie : Lossless\n\n\n\n\n\n\nTim Knol - Tim Knol (Self-Titled)(Retail)(2010)(FLAC)(HQ Artwork Scans Included)\n\n\n\n\n\n\n\n\n\nDutch:\n\nTim Knol groeide op in Hoorn, waar hij ook, vanaf zijn tiende jaar, muziek begon te maken. Lokaal maakte hij indruk met de band Be Right Back waarin hij zong en gitaar speelde. Terwijl hij in die band speelde, werkte hij aan allerlei zij-projecten en nam hij ook solo nummers op. In mei 2008 speelde hij op De avond van het kippenvel van DJ St. Paul in de Utrechtse Ekko, onder andere samen met Anne Soldaat. Samen met onder andere Anne Soldaat nam hij enkele demo's op voor Excelsior Recordings. In mei 2009 besloot hij zijn band vaarwel te zeggen en echt solo door te gaan.\n\nIn juni 2009 verscheen het eerste resultaat van zijn solocarriÃƒÂ¨re, het nummer Cry van Godley &amp; Creme, op het online verzamelalbum Guilty pleasures van de Coverclub. Andere artiesten die te vinden zijn op deze verzamelaar zijn Silence is Sexy, The Gasoline Brothers en Solo.\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Tim_Knol&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Tim_Knol&lt;/a&gt;\n\n\n\nEnglish:\n\nTim Knol was born and raised in Hoorn, where he started making Music at the age of 10. Locally he made an impression with the band Be Right Back in which he sang and played guitar. While playing in that band, he also worked on various side projects and recorded a couple of solo tracks. In May 2008 he played at De avond van het kippenvel in Utrecht, where he got in contact with Anne Soldaat, formerly of Daryll-Ann. Together they recorded some demos for Excelsior Recordings. In May 2009 he decided to quit his band, and start a solo career. In June 2009 the first result from his solo career, a cover version of Godley &amp; Creme's Cry, appeared on the online compilation album Guilty pleasures. Other artists that appeared on that album ware Silence Is Sexy and Solo.\n\nDuring the Lowlands Festival in August 2009 Knol signed a record deal with Excelsior Recordings. His debut record got positive reviews in the Dutch media. On the album Knol is accopanied by Jacob de Greeuw, Jeroen Kleijn and Matthijs van Duijvenbode from Johan and Anne Soldaat and Reyer Zwart from Do-The-Undo. Knol first presented his songs as a support act for Johan, during their farewell tour in the second half of 2009. After a few try-out concerts, the first big performance of Knol with his new band was at the Noorderslag Festival in Groningen January 2010.\n\nHis debutalbum was released in Great-Britain May 24, 2010 by Excelsior Recordings.\n\nThe songs of Tim Knol are often compared to the roots rock of Gram Parsons, Wilco and Ryan Adams.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tim_Knol&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tim_Knol&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nTim Knol speelde in de folkrockgroep Be Right Back toen hij in contact kwam met Matthijs van Duijvenbode. Ze besloten samen een aantal nummers te schrijven, waarvan ze er ÃƒÂ©ÃƒÂ©n plaatsten op de myspace van Knol. Dit nummer kwam ter ore van Ferry Rosenboom, labelmanager van Excelsior Recordings, die Knol in mei 2009 een contract aanbood, dat getekend werd op Lowlands. Rooseboom raadde Knol aan contact te leggen met Anne Soldaat, waarna het drietal, met bassist Reyer Zwart en drummer Jeroen Kleijn de Studio Sound Enterprise in Weesp ingingen, om de nieuwe nummers op te nemen. Gedurende het opnameproces kwam Anne Soldaat nog met het nummer Only waiting op de proppen, dat hij speciaal geschreven had voor Knol. Ook werd er een nummer opgenomen dat Knol had geschreven met oud-Be Right Back lid Pieter Tensen. Eind 2009 verzorgde Knol, samen met Van Duijvenbode, het voorprogramma tijdens de afscheidstournee van Johan. Op Noorderslag 2010 presenteerde Knol enkele van nummers met zijn nieuwe live-band, die naast Van Duijvenbode en Soldaat bestond uit Kees Schaper en Jeroen Overman.\n\nOp 25 januari 2010 verscheen het album in de winkel en op 3 februari volgde een officiÃƒÂ«le presentatie in Paradiso Amsterdam. Het album kreeg zeer goede kriteken en kwam op 12 binnen in de Album Top 100. Na de release ging Knol op een uitgebreide clubtour, met ook enkele concerten in Duitsland. Ook volgden er diverse radio- en televisieoptredens, onder andere bij De Wereld Draait Door, GIEL, Evers Staat Op, Opium en VPRO's Nederpopshow. Direct na het verschijnen van het album, gingen Knol en Van Duijvenbode werken aan nieuwe nummers voor een volgende plaat. In april 2010 werd het nummer When I am king verkozen tot single, waarna het nummer regelmatig te horen was op diverse radiostations. Op 24 mei werd het album door Excelsior Recordings uitgegeven in Engeland. Hiermee was Tim Knol het eerste album dat de platenmaatschappij in Engeland uitgaf. In juli werd het nummer Sam opnieuw gemixt en in augustus als vinylsingle uitgegeven. Het nummer werd megahit op 3FM. De videoclip van het nummer werd gemaakt door Jean-Marc van Tol. Op 29 november werd het album opnieuw uitgebracht, met een bonusalbum met 9 akoestische versies van nummers van het album, onder de naam Music in my room.\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Tim_Knol_%28album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Tim_Knol_%28album%29&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\nTracklist:\n\n01. Clean Up\n02. Sam\n03. Sound Familiar\n04. When I Got Here\n05. Find All The Love\n06. Only Waiting\n07. Or So I'm Told\n08. When I Am King\n09. Must Assist\n10. Music In My Room\n11. Me &amp; A Lot Like You\n12. Silverman Hotel\n13. Driving Home\n14. Deepest Of Oceans\n\n\nMuzikanten:\n\n* Tim Knol - zang en gitaar\n* Anne Soldaat - gitaar en zang\n* Matthijs van Duijvenbode - keyboards en zang\n* Reyer Zwart - basgitaar, zang en mandoline\n* Jeroen Kleijn - drums\n\nGastmuzikanten:\n\n* Marieke de Bruijn String Quartet - viool\n* Roland van Beveren - pedal steel op 3, 5 en 10\n* Jacob de Greeuw - gitaar op 2, zang op 5 en 11\n* Kees Schaper - percussie op 4, 6, 9, 11 en 12\n* Jeroen Overman - percussie op 12\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Tim_Knol_%28album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Tim_Knol_%28album%29&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nENJOY &amp; AS ALWAYS: REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!\n\n\n","torrent":{"xt":"urn:btih:1972affa5b0dd87422b02bfd179577c4f439d458","amp;dn":"Tim+Knol+-+Tim+Knol+%28Self-Titled%29%28Retail%29%282010%29%28Indie+Folk+Roots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1972affa5b0dd87422b02bfd179577c4f439d458","infoHashBuffer":{"type":"Buffer","data":[25,114,175,250,91,13,216,116,34,176,43,253,23,149,119,196,244,57,212,88]},"announce":[],"urlList":[]}}