{"title":"MP4 Video Converter v4.2.0.56 Portable","uid":5099771,"size":19089185,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1a13eb897ca44d30b4b7271c2262ef3f3773db97&amp;dn=MP4+Video+Converter+v4.2.0.56+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":5,"time":1253838235,"description":"Wondershare MP4 Video Converter v4.2.0.56 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Activate are included. This is just the GiveAwayOfTheDay.com program for today. Get it while it lasts. And after it will be enough to use the Reg.reg file... :-)\n\n\nWondershare MP4 Video Converter is a powerful Video to MP4 Converter that can convert various video formats including both standard and high definition videos formats to MP4, M4V and AVI video. \n\nThis MP4 Video Converter supports multiple mobile players such as iPod, iPhone, PSP, Zune, BlackBerry, Walkman and Apple TV with excellent playback quality. It also provides you with flexible video editing options allowing you to get your ideal output video.\n\nKey Features:\nSupport converting both standard and HD video formats (AVI, MP4, MOV, FLV, M2TS, 3GP, WMV etc.). \nExtract audio from video to audio MP3, M4A and AAC. \nConvert video to MP4, M4V and AVI video for playback on iPod, iPhone, PSP, Zune, BlackBerry, Walkman and Apple TV etc. \nEdit video by trimming, cropping, adjusting video effect, adding watermark and subtitle with two real time preview windows. \nCapture pictures from video files and save the captured pictures on your computer. \nMerge multiple files into one single file. \nQuick and helpful online support. \nMore features on MP4 Video Converter.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.giveawayoftheday.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.giveawayoftheday.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.dvd-ripper-copy.com/mp4-video-converter.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvd-ripper-copy.com/mp4-video-converter.html&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:1a13eb897ca44d30b4b7271c2262ef3f3773db97","amp;dn":"MP4+Video+Converter+v4.2.0.56+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a13eb897ca44d30b4b7271c2262ef3f3773db97","infoHashBuffer":{"type":"Buffer","data":[26,19,235,137,124,164,77,48,180,183,39,28,34,98,239,63,55,115,219,151]},"announce":[],"urlList":[]}}