{"title":"Fort William Henry 1755-57: A Battle, Two Sieges and Bloody Mass","uid":11767291,"size":6505876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1aa79c00ac5a33b48090c3f158c798af5ab2d918&amp;dn=Fort+William+Henry+1755-57%3A+A+Battle%2C+Two+Sieges+and+Bloody+Mass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426896981,"description":"This book details the French and Indian War massacre by Iroquois of British and colonial troops in the Hudson River Valley that was fictionalized in The Last of the Mohicans.\n\nAfter the British garrison of Fort William Henry in the colony of New York surrendered to the besieging army of the French commander the Marquis de Montcalm in August 1757, it appeared that this particular episode of the French and Indian War was over. The spirited defence by Lt. Col. Munro of the 35th Regiment secured the British and Colonial troops the full honours of war, allowing them to march away with colours flying. \nWhat happened next became the most infamous incident of the war - the 'massacre' of Fort William Henry. As the garrison prepared to march for Fort Edward a flood of enraged Native Americans swept over the column, unleashing an unstoppable tide of slaughter. The incident forms an integral part of James Fenimore Cooper's classic novel The Last of the Mohicans. It is this version, later dramatically reconstructed in the film versions of the story, that has coloured our view of the incident to this day. But what really happened? \nAs part of a wide-ranging British strategy, Colonial troops were dispatched to the southern end of Lake George in 1755. At the subsequent battle of Lake George, these troops repulsed a French attack before commencing construction of a fort close by: Fort William Henry. Developments on other fronts in 1756 meant little occurred at the fort that year, but in 1757 it became a focal point for French ambition. Its garrison withstood an initial siege in March, but the French returned in August with a large army, and, following a siege conducted along formal European lines, the British garrison surrendered and marched away - only to be swept up in the most infamous incident of the French and Indian War.\nMuch new research on this campaign - including some fascinating archaeological work - has taken place over the last 20 years and yet, for many, it is still the image created by Cooper's novel that colours our understanding of what happened at Fort William Henry. This new study will update that view","torrent":{"xt":"urn:btih:1aa79c00ac5a33b48090c3f158c798af5ab2d918","amp;dn":"Fort+William+Henry+1755-57%3A+A+Battle%2C+Two+Sieges+and+Bloody+Mass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa79c00ac5a33b48090c3f158c798af5ab2d918","infoHashBuffer":{"type":"Buffer","data":[26,167,156,0,172,90,51,180,128,144,195,241,88,199,152,175,90,178,217,24]},"announce":[],"urlList":[]}}