{"title":"Forts Of The United States-A Historical Dictionary 16th Through","uid":9592059,"size":13509397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d221e75c50aebca44bf25e4acc6bc988e72672b&amp;dn=Forts+Of+The+United+States-A+Historical+Dictionary+16th+Through+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1391921709,"description":"Forts Of The United States: A Historical Dictionary, 16th Through 19th Centuries \nBud Hannings\n\nPDF: 744 pages\nPublisher: McFarland &amp; Company (February 28, 2006)\n\nForts of the United States is the result of more than 20 years of meticulous research. Author Hannings manages an American military history publishing company. The purpose of the dictionary is to provide &quot;a brief history of each of the fortifications established in what became the United States.&quot;\n\nThe dictionary records a wide-ranging number of forts that the European colonists and U.S. military built. It spans approximately 400 years, beginning in the 1500s and ending in 1898. Hannings includes &quot;all primary fortifications and many minor posts whose existence could be documented.&quot; The result is approximately 6,000 entries arranged alphabetically by state. Entries vary extensively in length since information on forts differs widely. For example, the entry for obscure Camp Newport in Maryland is limited to &quot;unknown date and location.&quot; In contrast, the article on well-known Fort McHenry is more detailed, containing information such as the date the structure was built, its location, and a discussion of Britain's unsuccessful attack on the fortress.\n\nIn addition to accounts of forts, the dictionary has several other useful features. For example, the text is complemented by six appendixes, among them a good overview and listing of forts built around Washington, D.C., during the Civil War. In addition, the volume contains a bibliography of secondary and primary resources and a precise index. Finally, black-and-white illustrations and photographs effectively capture the diversity of forts built across the country.\n\nForts of the United States provides an impressive and thorough record of American forts but may be problematic for users unfamiliar with this topic. Novice readers would benefit from a glossary and an introductory essay placing fortification within a historical context. These users may need to refer to Fortress America: The Forts That Defended America, 1600 to the Present (Da Capo, 2004), which provides a good historical synopsis, including Native American fortification. Hannings' dictionary will appeal to readers with an interest in fortified sites. It is recommended for public, academic, and special libraries with U.S. military history collections. Michelle Hendley","torrent":{"xt":"urn:btih:1d221e75c50aebca44bf25e4acc6bc988e72672b","amp;dn":"Forts+Of+The+United+States-A+Historical+Dictionary+16th+Through+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d221e75c50aebca44bf25e4acc6bc988e72672b","infoHashBuffer":{"type":"Buffer","data":[29,34,30,117,197,10,235,202,68,191,37,228,172,198,188,152,142,114,103,43]},"announce":[],"urlList":[]}}