{"title":"Fantasy Life by Matthew Berry (ePUB/Mobi)","uid":8824831,"size":8024827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1db7d213e24eb33809e6c85345c1528760f5cdc6&amp;dn=Fantasy+Life+by+Matthew+Berry+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1376818630,"description":"Fantasy Life: The Outrageous, Uplifting, and Heartbreaking World of Fantasy Sports from the Guy Who's Lived It\n\nNow a New York Times bestseller!\n\nFantasy football, fantasy baseball, fantasy basketball, even fantasy sumo wrestling: the world of fantasy sports is huge, and still growing. Today, more than 35 million people in the United States and Canada spend hours upon hours each week on their fantasy sports teams. And as the Senior Fantasy Sports Analyst for ESPN, Matthew Berry is on the front lines of what has grown from a niche subculture into a national pastime.\n\nIn Fantasy Life, Berry celebrates every aspect of the fantasy sports world. Brilliant trash talk. Unbelievable trophies. Insane draft day locations. Shake-your-head-in-disbelief punishments. Ingenious attempts at cheating. And surprisingly uplifting stories that remind us why we play these games in the first place.\n\nWritten with the same award-winning style that has made Berry one of the most popular columnists on ESPN.com, Fantasy Life is a book for both hard-core fantasy players and people who have never played before. Between tales of love and hate, birth and death, tattoos and furry animal costumes, the White House Situation Room and a 126-pound golden pelican, Matthew chronicles his journey from a fourteen-year-old fantasy player to the face of fantasy sports for the largest sports media company in the world.\n\n\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:1db7d213e24eb33809e6c85345c1528760f5cdc6","amp;dn":"Fantasy+Life+by+Matthew+Berry+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db7d213e24eb33809e6c85345c1528760f5cdc6","infoHashBuffer":{"type":"Buffer","data":[29,183,210,19,226,78,179,56,9,230,200,83,69,193,82,135,96,245,205,198]},"announce":[],"urlList":[]}}