{"title":"Outlaw Golf 2 [PS2-PC]","uid":8217341,"size":1435284416,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e6213539c7f07e412e08d5dc81e2f34d7602535&amp;dn=Outlaw+Golf+2+%5BPS2-PC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Cerebral222","files":-1,"time":1362371179,"description":"My favourite golf game.\n\nOutlaw Golf 2 is a golf video game developed by Hypnotix, that is intended for adults and mature teens.\n\nPlayers take control of 10 playable characters, each with their own unique caddy. The series is noted for its crude humor, particularly in regard to the characters, most of whom fall under an exaggerated archetype. These include a stripper, a hippie, a biker, and more.\n\nUnique to the series is the &quot;Composure Meter&quot;. The better you're playing, the higher your composure, and vice versa. The distance on your clubs increases/decreases as your composure goes up or down, respectively. This is designed to simulate frustration - the more shots you miss, the more frustrated you get, and the worse you play. In order to counteract this, you can beat or humiliate your caddy in some way, which raises your composure meter back up.\n\nThis is a PS2 [NTSC] ISO that's best played on PC to take advantage of better graphics. \nGamepad is best, but you can map the LiyPad to keyboard if you want to, just go to the Config section, then go to Controllers (PAD) &amp; go to Pad 1 to setup Pad/Keyboard, simple.\n\nPCSX2 v 1.0 plus my working configuration pictures are included.\nIf you've never used a PS2 emulator, just follow the instructions in the text file provided, it's very easy to use the PS2 emulator.\n\nScreens: http://bayimg.com/eakjeAaEC\n\nSystem requirements.\n\nNo small rigs for emulating PS2 games, a medium, to high end machine is best.\n\nTested on Windows 7 32 bit with 4 gig ram.\n1 gig AMD Radeon HD 6600 seris graphics card.\nE6700 2.93.GHz Core 2 duo processor.\nWorks perfectly.\n\nPlease seed for others.","torrent":{"xt":"urn:btih:1e6213539c7f07e412e08d5dc81e2f34d7602535","amp;dn":"Outlaw+Golf+2+%5BPS2-PC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6213539c7f07e412e08d5dc81e2f34d7602535","infoHashBuffer":{"type":"Buffer","data":[30,98,19,83,156,127,7,228,18,224,141,93,200,30,47,52,215,96,37,53]},"announce":[],"urlList":[]}}