{"title":"Edward Griffin - The Subversion Factor (Treason in Modern Americ","uid":3401981,"size":655486976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1fc646b19a03ce32a61c209471745460025d73cc&amp;dn=Edward+Griffin+-+The+Subversion+Factor+%28Treason+in+Modern+Americ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ReVIsed","files":1,"time":1130421985,"description":"This program deals with why the United States has retreated from world power since the close of World War II. The answer lies, not in the superiority of her adversaries nor in the lack of vision among her leaders. It is not a confusion factor but a subversion factor involving penetration into the highest levels of government. That long history of subversion began in the 1920s and continues to the present day.\n\nMany of the facts are taken from newsreels of the period. You will hear the testimony of former Communist &quot;moles&quot; who tell how they promoted each other within government agencies. You also will hear the truth about Alger Hiss from the men and women who actually knew and worked with him in the Communist Party. Included are little-known facts about the theft of the atomic bomb and Communist penetration into the OSS which later became the CIA.\n\nPerhaps the most shocking ? and important ? aspect of this program, however, is the history of how every defense we once had against internal subversion now has been dismantled. We are left with the cold realization that our government, not only has been highly infiltrated, but nothing can now be done about it under present law.\n\nInterviews of many top officials including Philip Agee, a CIA Operations Officer in Latin America; Ladislav Bittman, the officer in charge of the Department of Disinformation in Czechoslovakia; John Rees, editor and publisher of Information Digest; Morton Halperin, Chairman of the Campaign for Political Rights; and Mark Felt, FBI Associate Director now confirmed to be &quot;Deep Throat&quot;.\n\nYou can review a Word Document copy of the transcript here. The formatting is not complete, but will be updated shortly.\n\nThere are two complete programs on this cassette. The first one is &quot;Moles in High Places&quot;, and the second is &quot;The Open Gates of Troy&quot;, both written and narrated by G. Edward Griffin. They have been restored to their original length of one hour each.\n\nRuntime......: 01:55:00\nVideo Codec..: XviD\nVideo Bitrate: 679 kb/s\nAudio Codec..: MP3\nAudio Bitrate: 64 kb/s CBR (Monophonic)\nFrame Size...: 352x256\nEncoder......: Gordian Knot","torrent":{"xt":"urn:btih:1fc646b19a03ce32a61c209471745460025d73cc","amp;dn":"Edward+Griffin+-+The+Subversion+Factor+%28Treason+in+Modern+Americ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc646b19a03ce32a61c209471745460025d73cc","infoHashBuffer":{"type":"Buffer","data":[31,198,70,177,154,3,206,50,166,28,32,148,113,116,84,96,2,93,115,204]},"announce":[],"urlList":[]}}