{"title":"wicca 15 delen (E-Books)NLT-Release","uid":6848257,"size":8930950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:202c9865c2aaaf13d0762f1ef07c7ca3f541fa86&amp;dn=wicca+15+delen+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"linday1","files":-1,"time":1322425470,"description":"\nOmschrijving:\nAlle delen van deze serie in een verzamelspot.\n\nMorgan is gefascineerd door de nieuwe jongen op haar school, Cal. Hij is knap en mysterieus en doet aan wicca. Morgan ontdekt ook bij zichzelf magische gaven. Het eerste deel van vier boeken waarin wicca, een natuurreligie die vroeger hekserij genoemd werd, centraal staat. Door de realistische, hedendaagse omgeving is het voor de lezer niet altijd even gemakkelijk om als vanzelfsprekend in de magie te geloven. Er is veel aandacht voor de ontwikkeling die Morgan doormaakt. Ze leert erkennen wat ze is: een geboren heks. De andere karakters blijven vlakker: Cal wekt bijv. de indruk nogal een saaie piet te zijn. Als hij aan het woord komt, is dit vooral om uitleg te geven over wicca. Door deze passages lijkt het boek bij tijd en wijle meer op een voorlichtings- of promotiecampagne voor wicca dan een roman. Er gebeurt veel dat mysterieus is, maar de lezer zal nog een tijdje moeten wachten voor alles onthuld wordt. Dit boek is vooral een inleiding op de serie. Elk hoofdstuk wordt voorafgegaan door een citaat, waaruit blijkt dat de auteur uitgebreid research gedaan heeft.\n\nHet vijftiende deel in de Wicca-serie. In het verhaal zijn sinds het vorige deel inmiddels vijftien jaren verstreken. Morgan is nu een ingewijde, krachtige heks met een dochter die de talenten van haar moeder heeft geerfd. Morgans grote liefde Hunter is bij een schipbreuk omgekomen. Althans, dat gelooft Morgan. Ze krijgt signalen dat Hunter nog in leven is. De auteur maakt met dit deel een nieuwe start: er worden nieuwe personages geintroduceerd zoals Morgans dochter Moira. Een heleboel vertrouwde zaken komen echter terug, zoals de strijd tegen zwarte magie en de allesvernietigende 'zwarte golf'. Als Moira verliefd wordt op de zoon van een zwarte heks, lijkt de geschiedenis zich zelfs te herhalen. Verrassend is de plot dan ook niet, maar wel spannend met een van magie zinderende finale. Bovendien heeft de auteur de gave de gevoelens van haar personages, te midden van alle onwaarschijnlijke gebeurtenissen, realistisch te houden. In plaats van in de eerste persoon, wordt het verhaal nu in de derde persoon verteld. Het boek is aanzienlijk dikker dan de andere delen. \n\nHashcode:\n202C9865C2AAAF13D0762F1EF07C7CA3F541FA86\n\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:202c9865c2aaaf13d0762f1ef07c7ca3f541fa86","amp;dn":"wicca+15+delen+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"202c9865c2aaaf13d0762f1ef07c7ca3f541fa86","infoHashBuffer":{"type":"Buffer","data":[32,44,152,101,194,170,175,19,208,118,47,30,240,124,124,163,245,65,250,134]},"announce":[],"urlList":[]}}