{"title":"Dario Marianelli - The Boxtrolls OST (2014) FLAC","uid":11392255,"size":317164892,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21b68616783bf6faf4788679eb1de1e508011c96&amp;dn=Dario+Marianelli+-+The+Boxtrolls+OST+%282014%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shambu69","files":-1,"time":1415346358,"description":"Soundtrack / Score\n\nFLAC\n\nTracklist:\n01. The Unspeakable Has Happened\n02. The Scavengers\n03. The Boxtrolls Cavern\n04. Egg's Music Box\n05. Quattro Sabatino\n06. One Busy Night\n07. Rooftop Chase\n08. Broken Eggs\n09. Cheesebridge Funfair\n10. The Boxtrolls Song\n11. Snatcher and His Stooges\n12. Allergic\n13. To The Rescue\n14. I'm Sure I Am Delicious\n15. I Was Given To Them\n16. What's A Father?\n17. Slap Waltz\n18. Snatcher's Dramatical Entrance\n19. Look What You Did\n20. Jelly!\n21. Last Battle\n22. Say Cheese\n23. Little Boxes\n24. Some Kids\n25. Whole World\n\nAbout:\nReleased: Sep 23, 2014\nâ„— 2014 Back Lot Music\nLabel: +180 RECORDS\nASIN: B00MQVS6WK\n\nEditorial Reviews\nFeaturing original music by Academy Award-winning composer Dario Marianelli. With original songs by Dario Marianelli, Loch Lomond and Monty Python alumnus Eric Idle. The Boxtrolls is a family event movie from the makers of Coraline and ParaNorman, both of which were Academy Award nominees for Best Animated Feature Film. It is the third feature production for the Oregon-based animation studio Laika. Shot on-site in 3D, and further advancing the groundbreaking work by hand and in technology at Laika, The Boxtrolls is a stop-motion, hand-drawn, and CG hybrid movie based on Alan Snow's bestselling fantasy adventure book Here Be Monsters.\n\nBiography\nDario Marianelli is an Italian composer of film and concert music. Born in Pisa, he started piano studies and began singing as a chorister at age 6. When his voice broke, he devoted himself to playing piano and composing. He studied privately and took exams as an external student in nearby Florence, Lucca, and Livorno, and also studied counterpoint before moving to England. There, he studied at the Guildhall School of Music and Drama, and spent three additional years studying at the National Film and Television School. His film career extends back to 1994 with his score for Paddy Breathnach's movie, Ailsa. Over the course of two decades, he composed music for such films as The Brothers Grimm; V for Vendetta; Agora; Eat, Pray, Love; Jane Eyre; Salmon Fishing in the Yemen; and Quartet, as well as many others. He has achieved recognition for his work with filmmaker Joe Wright, providing scores to the films Pride and Prejudice, Atonement, The Soloist, and Anna Karenina. Among his honors, Marianelli has won the Academy Award, a Golden Globe Award, the Phoenix Film Critics Society Award, and the World Soundtrack Award","torrent":{"xt":"urn:btih:21b68616783bf6faf4788679eb1de1e508011c96","amp;dn":"Dario+Marianelli+-+The+Boxtrolls+OST+%282014%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b68616783bf6faf4788679eb1de1e508011c96","infoHashBuffer":{"type":"Buffer","data":[33,182,134,22,120,59,246,250,244,120,134,121,235,29,225,229,8,1,28,150]},"announce":[],"urlList":[]}}