{"title":"Abrazando El Olvido - Raquel Sanchez Garcia [Ebook][Spanish]","uid":6700033,"size":2813826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22903d81544af0513280dcc730d7c785dcbaa4b1&amp;dn=Abrazando+El+Olvido+-+Raquel+Sanchez+Garcia+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"virana","files":-1,"time":1316937830,"description":"Abrazando el Olvido - Raquel Sanchez Garcia\n\nSobre la autora:\n\nRaquel SÃƒÂ¡nchez GarcÃƒÂ­a, hija de padre madrileÃƒÂ±o y madre salmantina, naciÃƒÂ³ en 1978 en Madrid. CursÃƒÂ³ sus estudios hasta terminar titulada como TÃƒÂ©cnica en GestiÃƒÂ³n Administrativa, lo cual le abriÃƒÂ³ el mercado laboral, en el que se integrÃƒÂ³ a los 20 aÃƒÂ±os de edad trabajando, durante su trayectorÃƒÂ­a profesional, en diferentes empresas realizando labores de secretariado, manteniendo oculto su verdadero sueÃƒÂ±o: escribir.\n\nDesde niÃƒÂ±a siempre soÃƒÂ±ÃƒÂ³ con escribir grandes historias. No se animÃƒÂ³ a hacerlo hasta hace pocos aÃƒÂ±os. Normalmente escribÃƒÂ­a para sus amigos y familiares, pero un dÃƒÂ­a animada por ellos y por el sentimiento que tenÃƒÂ­a hacÃƒÂ­a lo que su abuelo le sugiriÃƒÂ³ en su infancia al leer sus escritos, decidiÃƒÂ³ compartir con todos nosotros lo que siempre le habÃƒÂ­a gustado: su aficiÃƒÂ³n a la escritura.\nSu primera novela comenzÃƒÂ³ a ser escrita en julio de 2008 y terminada a mediados de noviembre de 2010, dÃƒÂ­as mÃƒÂ¡s tarde, el 30 de noviembre de 2010, \\&quot;Abrazando el Olvido\\&quot; saliÃƒÂ³ a la luz. Ante el tan complicado mundo editorial tradicional, Raquel tuvo que autopublicarse y seguir enviando su manuscrito a los certames y a las editoriales para poder ver cumplido algÃƒÂºn dÃƒÂ­a su gran sueÃƒÂ±o.\n\n Sinopsis\n\n    Por primera vez, Alicia toma consciencia de su vida. Cansada de los celos y las peleas, se propone terminar de una vez con todo, decide entablar una batalla consigo misma: enfrentarse a su destino. Debe huir de Valencia, lugar que la vio crecer, tiene que abandonar a sus seres queridos si quiere acabar con lo que se ha convertido su actual dÃƒÂ­a a dÃƒÂ­a.\n    AcompaÃƒÂ±aremos a Alicia, una chica valenciana que, por azar, acaba viajando a Madrid donde conoce a RaÃƒÂºl y Toni, unos amables madrileÃƒÂ±os que pronto se hacen amigos de la muchacha y viviremos con ellos los distintos sucesos que les ocurrirÃƒÂ¡n.\n    No te pierdas una novela cargada de emociones y sentimientos encontrados, donde el amor y la desesperanza se entremezclan con acontecimientos del pasado. Un pasado que hasta el final de la historia no dejarÃƒÂ¡ de atormentar a nuestra protagonista.\n    Ã‚Â¿A quÃƒÂ© esperas para leerla?.\n\n","torrent":{"xt":"urn:btih:22903d81544af0513280dcc730d7c785dcbaa4b1","amp;dn":"Abrazando+El+Olvido+-+Raquel+Sanchez+Garcia+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22903d81544af0513280dcc730d7c785dcbaa4b1","infoHashBuffer":{"type":"Buffer","data":[34,144,61,129,84,74,240,81,50,128,220,199,48,215,199,133,220,186,164,177]},"announce":[],"urlList":[]}}