{"title":"W. Griffin Tarpley - Barack H. Obama - The Unauthorized Biograph","uid":5564926,"size":3319518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:232e6ea60882c2d43c06d3a4871e2a8dc89931dc&amp;dn=W.+Griffin+Tarpley+-+Barack+H.+Obama+-+The+Unauthorized+Biograph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DoDirty7","files":-1,"time":1273948000,"description":"Written by the author of the legendary 1992 expose of Bush the elder, this book works from a New Deal point of view. Obama is exposed as a foundation operative and agent of Wall Street finance capital, controlled by Zbigniew Brzezinski, George Soros, and Goldman Sachs. Obama's mother was an official of the Ford Foundation, the World Bank, and US AID. By all indications, Obama was identified for future political use by Brzezinski at Columbia in 1981-1983, during Obama's secret lost years. Obama has worked for the Gamaliel Foundation, the Joyce Foundation, the Woods Fund, and the Annenberg Foundation as a community organizer - a poverty pimp, a cynical opportunist who uses suffering people as a political commodity. The foundation strategy is divide and conquer, pitting blacks against whites against Hispanics against Asians, to prevent any challenge to Wall Street. Racist provocateurs like Wright and Pfleger, along with Weatherman terrorist bombers Ayers and Dohrn, Obama's best friends, are cast in this mold. Rezko, Auchi, and Al-Sammarae represent the cesspool of Chicago graft and corruption in which Obama cavorts. Schooled in Nietzsche and Fanon, Obama qualifies as a postmodern fascist. An Obama administration would strive for brutal economic sacrifice and austerity to finance Wall Street bailouts, and for imperialist confrontation with Russia and China. ","torrent":{"xt":"urn:btih:232e6ea60882c2d43c06d3a4871e2a8dc89931dc","amp;dn":"W.+Griffin+Tarpley+-+Barack+H.+Obama+-+The+Unauthorized+Biograph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"232e6ea60882c2d43c06d3a4871e2a8dc89931dc","infoHashBuffer":{"type":"Buffer","data":[35,46,110,166,8,130,194,212,60,6,211,164,135,30,42,141,200,153,49,220]},"announce":[],"urlList":[]}}