{"title":"Islam - What The West Needs To Know -- Re-Encode","uid":3553281,"size":494859708,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2464b1574d3579b524f148ec6d33c47fd73bfef3&amp;dn=Islam+-+What+The+West+Needs+To+Know+--+Re-Encode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vidar808","files":2,"time":1162931917,"description":"Video Re-Encoded with DivX6.x dual pass &amp; MPEG Layer-3 audio\n\nIslam: What the West Needs to Know - An examination of Islam, Violence, and the Fate of the Non-Muslim World.\n\n\nFeaturing:\nAbdullah Al-Araby\nWalid Shoebot\nRobert Spencer\nSerge Trifkovic\nBat Ye\\&amp;#039;or\n\n\nSee Roberts Spencers website Here: &lt;a href=&quot;\nhttp://www.jihadwatch.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jihadwatch.org/&lt;/a&gt;\nAlso includes information about his important books.\n\n\n\nabout DVD &lt;a href=&quot;\nhttp://www.whatthewestneedstoknow.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.whatthewestneedstoknow.com/&lt;/a&gt;\n\nWhere to buy it &lt;a href=&quot;\nhttp://s1.amazon.com/exec/varzea/ts/exchange-glance/Y02Y0274043Y4516368/qid%253D1157697660/102-5966639-9029714&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s1.amazon.com/exec/varzea/ts/exchange-glance/Y02Y0274043Y4516368/qid%253D1157697660/102-5966639-9029714&lt;/a&gt;\n\n\nMain Idea\nVirtually every major Western leader has over the past several years expressed the view that Islam is a peaceful religion and that those who commit violence in its name are fanatics who misinterpret its tenets. This claim, while widely circulated, rarely attracts serious public examination. Relying primarily on Islam?s own sources, this documentary demonstrates that Islam is a violent, expansionary ideology that seeks the destruction or subjugation of other faiths, cultures, and systems of government. \n\nContent\nThe documentary consists of original interviews, citations from Islamic texts, Islamic artwork, computer-animated maps, footage of Western leaders, and Islamic television broadcasts. Its tone is sober, methodical, and compelling. \n\nOutline of the Documentary\nIntroduction\nWe hear from prominent Western leaders that Islam is peaceful and that those who commit violence in its name are heterodox fanatics. \n\nPart 1: ?There is no God but Allah and Muhammad is his Prophet?\nOur interviewees affirm their belief that Islamic violence is entirely orthodox behavior for Muslims and stems directly from the teachings and example of the Prophet Muhammad and the commands of the Koran. We learn that the example of Muhammad is one of a violent warlord who killed numerous people. The Koran ? the verbatim words of Allah ? prescribes violence against non-Muslims and Muhammad is the perfect example of the Koran in action. \n\nPart 2: The Struggle\nWe learn that jihad, while literally meaning \\&amp;#039;struggle\\&amp;#039;, in fact denotes war fought against non-Muslims in order to bring the rule of Islamic law to the world. Violent death in jihad is, according to the Koran, the only assurance of salvation. One of our interviewees tells of his personal involvement in terrorism and his leaving Islam. \n\nPart 3: Expansion\nFollowing the death of Muhammad, his \\&amp;#039;rightly-guided\\&amp;#039; successors carried his wars to three continents, fighting, enslaving, and massacring countless Christians, Jews, Zoroastrians, Hindus, and others. Islam did not spread through evangelism or through its natural appeal, but through aggressive wars of conquest. The Crusades were largely a belated response on the part of Christian Europe to rescue Christians in the Holy Land suffering under Muslim oppression. The Muslim world today, while no longer the unified empire of the Caliphs, is exceptional for being responsible for the vast majority of conflicts around the world and for almost all of international terrorism. \n\nPart 4: ?War is Deceit?\nA great problem with Western efforts to understand Islam is due to the Islamic principle of \\&amp;#039;religious deception\\&amp;#039;, which enjoins Muslims to deceive non-Muslims in order to advance the cause of Islam. Muslim groups today in the West employ deception and omission to give the impression that \\&amp;#039;Islam is a religion of peace\\&amp;#039;, an utter fiction. \n\nPart 5: More than a Religion\nThe most important characteristic of Islam not understood by the West is that it is more a system of government than a personal religion. Throughout its history, Islam has never recognized a distinction between the religious and the secular/political. Islamic law governs every aspect of religious, political, and personal action, which amounts to a form of totalitarianism that is divinely enjoined to dominate the world, analogous in many ways to Communism. \n\nPart 6: The House of War\nIslamic theology divides the world into two spheres locked in perpetual combat, dar al-Islam (House of Islam - where Islamic law predominates), and dar al-harb (House of War - the rest of the world). It is incumbent on dar al-Islam to fight and conquer dar al-harb and permanently assimilate it. Muslims in Western nations are called to subvert the secular regimes in which they now live in accordance with Allah\\&amp;#039;s command. Due to political correctness and general government and media irresponsibility, the danger posed by observant Muslims in the West remains largely unappreciated.\n","torrent":{"xt":"urn:btih:2464b1574d3579b524f148ec6d33c47fd73bfef3","amp;dn":"Islam+-+What+The+West+Needs+To+Know+--+Re-Encode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2464b1574d3579b524f148ec6d33c47fd73bfef3","infoHashBuffer":{"type":"Buffer","data":[36,100,177,87,77,53,121,181,36,241,72,236,109,51,196,127,215,59,254,243]},"announce":[],"urlList":[]}}