{"title":"Autobonus.2001.720p.DVDRip.x264-t0ma5","uid":8595966,"size":471102187,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:247501166a89a7ceca0fc442fd5e7576cd039ee0&amp;dn=Autobonus.2001.720p.DVDRip.x264-t0ma5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"t0ma5","files":-1,"time":1371761416,"description":"Autobonus (2001)\n59 min - Documentary\nDirector: Mika Ronkainen \n\nAn American dream in Finland - a brand new car and a monthly income of 150,000 Euros. The worst recession period of Finnish history is over but unemployment is decreasing slowly. The spectacular financial growth gained by the Finnish Nokia doesn't reach everyone. Viljo and Kaisu Mikkonen together with 30,000 other Finnish small entrepreneurs lost everything they owned during the downswing, and return to working-life is not easy. An American network marketing company enters Finland and starts recruiting members to their lists. The work itself is incredibly easy: use the company's natural products, recommend them to your friends and families, and you can have everything you have ever dreamed about! Viljo and Kaisu join the network and start to work. They use the company's products and travel around to promote them - extra nutrients, soy products, candy with nutritive values of salad, and special tooth-paste for sore throats. They receive a reward for every new member they recruit.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0308090/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0308090/&lt;/a&gt;\n\n======================================================================\nReview:\n\n&quot;The Finnish Dream&quot; | 31 August 2005 | by looneyfarm (Finland)\n\nCar Bonus exists as a proof that the phrase &quot;reality is stranger than fiction&quot; is the understatement of the century. I caught Car Bonus accidentally as it was on the DVD of Screaming Men, another documentary from the director Mika Ronkainen. Car Bonus proved to be superior, which is funny as it appears to be a rather raw and truthful film whereas Screaming Men consists mostly of staged or otherwise stylised scenes.\n\nCar Bonus captures some moments when Viljo and Kaisu Mikkonen, a middle-aged married couple, try to survive in post-recession Finland. During the recession they lost a successful business because of cheap loan from banks abroad, mainly owing to misplaced advice by Finnish banks. Now they are unemployed, heavily in debt, trying to get back on their feet with network marketing. &quot;Car bonus&quot; is a milestone in selling nutrition-based products via network marketing, which would come much in hand as their current vehicle is falling apart.\n\nThe premise may sound boring, but what makes Car Bonus special is the couple whose mishaps we are set to follow. Even though they have lost their business, they seem to be in high spirits, finding a new passion in network marketing with unrealistic beliefs that with much determination they will succeed. However, this is just the surface: every scene reeks of their desperation. And let me tell you, it is painful to watch and realise it: there were several moments when I just succumbed to shame and wanted to turn the movie off. This happened especially when Viljo attempted to lure unsuspecting people to one of their marketing meetings, or when the couple Mikkonen fed vitamin tablets to their turtles.\n\nSo a warning is in place: Car Bonus is a great movie, but not for the usual reasons. It's an incredibly depressing vision of recession-stricken people, but its accuracy in revealing something truly profound in banal-looking people and situations is so unbelievable that it has to be seen. It's out on DVD, folks, with English subtitles, so there's no excuse to not see this masterpiece. (update: it seems to have been uploaded to Google Video by the production company, so there's one reason more to see it now)\n======================================================================\n\nVideo Format                             : MKV\nFile size                                : 449 MiB\nDuration                                 : 58mn 54s\nOverall bit rate                         : 1066 Kbps\nWidth x Height                           : 720x512 pixels                               \n\nAudio Format                             : AAC\nFormat/Info                              : Advanced Audio Codec\nDuration                                 : 58mn 54s\nChannel(s)                               : 2 channels\nChannel positions                        : Front: L R\nLanguage                                 : Finnish\n\nSubtitle                                 : English","torrent":{"xt":"urn:btih:247501166a89a7ceca0fc442fd5e7576cd039ee0","amp;dn":"Autobonus.2001.720p.DVDRip.x264-t0ma5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247501166a89a7ceca0fc442fd5e7576cd039ee0","infoHashBuffer":{"type":"Buffer","data":[36,117,1,22,106,137,167,206,202,15,196,66,253,94,117,118,205,3,158,224]},"announce":[],"urlList":[]}}