{"title":"The Jackson 5 - ABC","uid":4983807,"size":128995332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:255b905d9762c4771ecb51a36581cfa1d90c2642&amp;dn=The+Jackson+5+-+ABC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246502406,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;ABC&quot; was a 1970 number-one hit song by The Jackson 5. &quot;ABC&quot; was written with the same design as &quot;I Want You Back&quot;, and was first heard on American Bandstand in February 1970. The song also knocked The Beatles song &quot;Let It Be&quot; out of the number one spot on the Billboard Hot 100 that same year.\n\nLike most of the other early Jackson 5 hits, &quot;ABC&quot; was written and produced by The Corporation, a team composed of Motown chief Berry Gordy, Freddie Perren, Alphonzo Mizell, and Deke Richards and recorded in Los Angeles, California, away from the old Motown studio at Hitsville USA in Detroit, Michigan.\n\n&quot;ABC&quot; was the first single from the second Jackson 5 album, ABC, issued with a cover of Diana Ross &amp; the Supremes' &quot;The Young Folks&quot; as the B-side. It is today one of the Jackson 5's signature songs.\n\nThe song has also been sampled by Naughty by Nature for their 1991 single &quot;O.P.P.&quot;, also by Girl Talk on his fourth album Feed the Animals.\n\nABC was the second studio album by The Jackson 5, issued in May 1970 on Motown Records. It featured the number-one singles &quot;ABC&quot; and &quot;The Love You Save&quot;. Also present on the LP are several notable album tracks, including a cover of Funkadelic's &quot;I'll Bet You&quot;, &quot;I Found That Girl&quot; (the only lead song from brother Jermaine - Michael takes most of the leads on the album), and &quot;The Young Folks&quot;, originally recorded by the Diana Ross-led version of The Supremes. It peaked at number-four on the Billboard Pop Albums Chart, and at number-one on the Billboard Black Albums chart. It was named number ninety-eight on the VH1 All Time Album Top 100. It remains of one of their most popular efforts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:255b905d9762c4771ecb51a36581cfa1d90c2642","amp;dn":"The+Jackson+5+-+ABC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"255b905d9762c4771ecb51a36581cfa1d90c2642","infoHashBuffer":{"type":"Buffer","data":[37,91,144,93,151,98,196,119,30,203,81,163,101,129,207,161,217,12,38,66]},"announce":[],"urlList":[]}}