{"title":"Pete s Dragon (1977) 2Lions-Team","uid":5206269,"size":3862780333,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:25742178439d6a60b62f54bea16a4c205370738e&amp;dn=Pete+s+Dragon+%281977%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1260386951,"description":"Pete's Dragon (1977)\nAlternatieve titel: Peter en de Draak \n\n\nVerenigde Staten\nFamilie / Avontuur\n128 minuten\n\n\n\ngeregisseerd door Don Chaffey\nmet Sean Marshall, Charlie Callas en Helen Reddy\n\nOmdat een negenjarige wees voortdurend ruzie heeft met het echtpaar dat hem geadopteerd heeft, besluit hij te ontsnappen. Samen met zijn enige vriend, de draak Elliot, vlucht hij naar de vriendelijke vuurtorenbeheerder Nora. Ondertussen probeert een corrupte arts Elliot te vangen om hem te kunnen gebruiken voor medische experimenten. \n\nEnglish\n\nA young troubled boy named Pete and his guardian dragon Elliott elude the abusive Gogan family, who all use Pete as a slave instead of a loved child. When Pete can successfully run away from them with his dragon, he stumbles into the town of Passamaquaddy- an ocean front harbor town filled with superstitious fishermen, drunken hooligans and wary townsfolk. Pete's arrival does not mix well with the citizens, as his dragon Elliott accidentally causes town rioting and gossip among the town drunks about the dragon. Expecting to be an outcast yet again, Pete is taken in by the kind Nora who lives in a lighthouse with her father Lampy. While Pete bonds with Nora and Lampy, the townsfolk have not lowered their guards and suspicions about the dragon. And when Dr. Terminus arrives, a phony con artist posing as a doctor, he sees Elliott the Dragon as the ultimate profit to his fame. With Passamaquaddy filled with superstition, greed and lack of imagination, life will not be easy before the town can ever believe Pete's dragon\n\n\nPostinformatie :\n\n\nCategorie : Beeld\n\nFormaat : DVD5 Pal\n\nBeeldformaat :16:9\n\nBron : RETAIL DVD\n\nGeluid : Dolby Digital 2.0\n\nAudio : English, Dutch\n\nSubs : English, Dutch\n\nCover : Ja (worden meegepost)\n\nWeblink : http://www.moviemeter.nl/film/4901\nWeblink : http://www.imdb.com/title/tt0076538\n\n***************************************** \n\nBrought to you by \n\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\n*****************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n*****************************************\n\n\t\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:25742178439d6a60b62f54bea16a4c205370738e","amp;dn":"Pete+s+Dragon+%281977%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25742178439d6a60b62f54bea16a4c205370738e","infoHashBuffer":{"type":"Buffer","data":[37,116,33,120,67,157,106,96,182,47,84,190,161,106,76,32,83,112,115,142]},"announce":[],"urlList":[]}}