{"title":"BF 1942 + several expansions &amp; mods","uid":6008066,"size":10332637828,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2664007a85157943136150d8022a0538b136f428&amp;dn=BF+1942+%2B+several+expansions+%26+mods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ARGENTVS_1","files":31,"time":1291387741,"description":"Weel, here i put BF1942 complete, with expansions; Vietnam, Secret Weaponds, Road To Rome, Eve Of Destruction, BF 1918, Desert Combat and Forgotten Hope.\n\nMy intention is make a easy way to obtain this files, because is hard to know how you must download and install all for a lot of people.\n\nHablo espaÃƒÂ±ol, pero los que bajan torrents deben saber leer inglÃƒÂ©s, perdÃƒÂ³n pero no tengo ganas de escribir todo de vuelta.\n\nSolo instalen en orden como esta en el txt y listo, tienen todo el BF 1942 y mods instaladas.\n\nSaludos y por favor/please, seed it all/todo.\n\n\n------------------------------------------------------------------------\n\nInstallation guide:\n\n1Ã‚Âº. Mount with Daemons tools or similar the image disks\n2Ã‚Âº Run setup on first disc\n3Ã‚Âº When ask for the other disk, browse folders and select the other image disk\n4Ã‚Âº When ask for a CD key, use de keygens on patch &amp; keygens folder\n5Ã‚Âº Install patch v1.61b cracked located on the same path\n6Ã‚Âº There is a lot of mods, maps for BF 1942, install as you like or not\n7Ã‚Âº Forgotten Hope must be installed 1 exe after other by numeric order, then install fh realism 2.0\n8Ã‚Âº To install Desert Combat do it starting with the number 1 exe and follow to 2 and 3\n9Ã‚Âº BF 1918 mod can be installed runing bf1918_3_0_finalfinal, the others files are not necesarry\n10Ã‚Âº Vietnam folder is not for install, just copy at location you wish and create an acces of the exe to your desktop. Have not registri, so you cant play on line.\n11Ã‚Âº The exe eod_v0.45 is other mod for 1942 aka Eve Of Destruction, and is other vietnam mod\n\nThanks for your time, i shared this because there is to many sources and is hard to know how install all this archives. So, i think with this people can enjoy the game and their mods with a single search and download.\n\nSeed!.\n----------------------------------------------------------------------------\n\nGuÃƒÂ­a de instalaciÃƒÂ³n:\n\n1 Ã‚Âº. Montar con Daemon tools, o similar, las imagenes de disco\n2 Ã‚Âº Ejecutar la instalaciÃƒÂ³n en el primer disco\n3 Ã‚Âº Cuando pregunte por el otro disco, navegar por las carpetas y seleccionar otra imagen\n4 Ã‚Âº Cuando pida una clave del CD, usar los keygen en la carpeta patch &amp; keygen\n5 Ã‚Âº Instalar la v1.61b de instalaciÃƒÂ³n del parche crackeado situado en el mismo camino\n6 Ã‚Âº Hay Varios mods, mapas de BF 1942, instalar a su gusto o no\n7 Ã‚Âº Forgotten Hope se debe instalar un exe despuÃƒÂ©s de otro por orden numÃƒÂ©rico, a continuaciÃƒÂ³n, instalar el realism fh 2.0\n8 Ã‚Âº Para instalar Desert Combat hacerlo a partir del exe nÃƒÂºmero 1 y seguir para 2 y 3\n9 Ã‚Âº BF 1918 mod se puede instalar ejecutando bf1918_3_0_finalfinal, los otros archivos no son necesarry\n10 Ã‚ÂºLa carpeta de Vietnam no es para instalar, sÃƒÂ³lo tenÃƒÂ©s que copiar en la ubicaciÃƒÂ³n que desee y crear un acceso del exe en el escritorio. No tiene registro, por l que no se puede jugar on line.\n11 Ã‚Âº El exe eod_v0.45 es otro mod de 1942 conocido como la Eve of Destruction, y es otro mod Vietnam.\n\nGracias por su tiempo, compartÃƒÂ­ esto porque hay muchas fuentes y es difÃƒÂ­cil saber cÃƒÂ³mo instalar todos los archivos de esta. Por lo tanto, creo que con ÃƒÂ©sto la gente pueda disfrutar del juego y sus mods con una sola bÃƒÂºsqueda y descarga.\n\nSeed!.\n\nSaludos/greetings","torrent":{"xt":"urn:btih:2664007a85157943136150d8022a0538b136f428","amp;dn":"BF+1942+%2B+several+expansions+%26+mods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2664007a85157943136150d8022a0538b136f428","infoHashBuffer":{"type":"Buffer","data":[38,100,0,122,133,21,121,67,19,97,80,216,2,42,5,56,177,54,244,40]},"announce":[],"urlList":[]}}