{"title":"Democracy Now - 04 jan 2012","uid":6932220,"size":454463422,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:27ea24f1b69399a888a98a4d51e206d8cc2f77f3&amp;dn=Democracy+Now+-+04+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1325697032,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 04, 2012\n\n- Romney Edges Santorum By 8 Votes in Iowa Caucus\n- Obama Talks Re-Election in Iowa Address\n- Iran Threatens Response Over U.S. in Gulf\n- Taliban Suggests Potential of U.S. Talks\n- Ecuadorian Court Upholds Chevron Fine for Amazon Pollution\n- Israeli, Palestinian Negotiators Meet in Jordan\n- Washington State Governor to Back Gay Marriage\n- California, NYC Take Up Corporate Personhood Amendment\n- Suspect Confesses to New York City Arsons at Religious Sites\n- Global Revolution, Live Streamers of Occupy Wall Street, Arrested in NYPD Raid\n\n\nSpecial reports\n\n- Romney Edges Out Tea Party-Backed Santorum as Iowa Caucus Kicks Off GOP Primaries\n\nWinning by just eight votes, Mitt Romney narrowly beat Rick Santorum for the GOP presidential nomination in the closest Iowa Republican caucus in history. Both Romney and Santorum received just more than 25 percent of the vote, while Rep. Ron Paul of Texas placed third with 21 percent. Former House Speaker Newt Gingrich placed fourth followed by Texas Gov. Rick Perry, who then announced he is going back to Texas to reassess his campaign. Rep. Michele Bachmann of Minnesota, who won the Iowa straw poll in August, placed sixth with just 5 percent of the vote. After our broadcast, the Associated Press reported a Bachmann advisor says she will end her White House bid.\n\n\n- Iowa Tea Party Chair on Bachmann, Paul, Santorum's Diverging Paths and Obama's Re-Election Challenge\n\nMinnesota Rep. Michele Bachmann won the Iowa straw poll in August, but placed sixth with just 5 percent of the vote in last night's Iowa caucus. We discuss the results with Ryan Rhodes, a Bachmann supporter and chairman of the Iowa Tea Party. Rhodes says Bachmann's poor showing stems from a surge of Tea Party voters swinging their vote over to Rick Santorum, instead of third-place candidate Ron Paul. Regarding the Occupy movement that has protested both Republicans and Democrats in Iowa, Rhodes says, &quot;They understand President Barack Obama has not kept his promises. He is running a campaign that people have not been able to trust.&quot;\n\n\n- Santorum's Emergence Signals Divided GOP Base While Paul Gains From Dems' Disenchantment With Obama\n\nMany Iowans from both sides of the political aisle say they voted largely out of protest to the available field of leading candidates in Tuesday's caucuses, rather than having a candidate they strongly support. Former Pennsylvania senator Rick Santorum secured second place in the state's Republican caucus with a last-minute boost from Christian evangelicals opposed to Mitt Romney. &quot;I think [Santorum] succeeded by being a stealth candidate who was under the radar screen, [with] no attacks [from rivals],&quot; says Will Bunch of the Philadelphia Daily News, who has long followed Santorum. We also speak with Ed Fallon, a former Democratic member of the Iowa General Assembly who urged fellow Dems to attend Republican caucuses and support the least extreme candidates. Fallon says he backed Texas Rep. Ron Paul in the hope that he will push Obama &quot;to do more of what we thought he would do: push him on Afghanistan, on Iraq, on Iran; on things like the PATRIOT Act and the National Defense Authorization Act; on the corporate domination of our economy as we've seen represented by the Occupy Wall Street movement.&quot;\n\n\n- As States Take on Citizens United, Lawrence Lessig Offers Bold Plan to Get Money Out of Politics\n\nCalifornia and New York City lawmakers are introducing measures today calling for a constitutional amendment overturning Citizens United, the controversial 2010 Supreme Court ruling that characterizes political spending as free speech and opened the floodgates for unlimited corporate spending on election campaigns. Similar measures have passed in Los Angeles, Oakland, Albany and Boulder. We speak with Harvard Law School Professor Lawrence Lessig, author of a new book that examines how money buys results in Congress and fuels campaigns that put the powerful in office. Lessig argues that both Democrats and Republicans suffer from the undue influence of corporate lobbying and unlimited campaign financing, and lays out a strategy to fight it, including a call for a constitutional convention that could propose an amendment for publicly funded elections.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:27ea24f1b69399a888a98a4d51e206d8cc2f77f3","amp;dn":"Democracy+Now+-+04+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27ea24f1b69399a888a98a4d51e206d8cc2f77f3","infoHashBuffer":{"type":"Buffer","data":[39,234,36,241,182,147,153,168,136,169,138,77,81,226,6,216,204,47,119,243]},"announce":[],"urlList":[]}}