{"title":"Cloud Computing Strategies by Dimitris N. Chorafas","uid":6140670,"size":2643354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:298e1005b1c175a3f0b6677ce765aa84fdc0e806&amp;dn=Cloud+Computing+Strategies+by+Dimitris+N.+Chorafas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"insane86","files":1,"time":1296491006,"description":"Cloud Computing Strategies\n\nAuthor(s): Dimitris N. Chorafas\n\nPages: 350\n\nPublisher: CRC Press\n\nLanguage: English\n\nISBN-10: 1439834539\n\nISBN-13: 978-1439834534\n\nDescription:\n\nWith an abundance of books available that cover the technical aspects of cloud computing, the time is right for a book that helps managers and CIOs understand exactly how cloud computing affects operations in their companies and departments. A guide to managing a cloud project, Cloud Computing Strategies provides the understanding required to effectively evaluate the technology and determine how it can be best applied to improve business and enhance the overall corporate strategy.\n\nBased on extensive research, the book examines the opportunities and challenges that loom in the cloud. It explains exactly what cloud computing is, what it has to offer, and calls attention to the important issues management needs to consider before passing the point of no return regarding financial commitments. Illustrated with numerous examples and case studies, the text examines security, privacy, data ownership, and data protection in the clouds. It also:\n\n    * Explains how and why your company can benefit from Open Software and onDemand Services\n\n    * Identifies various cloud providers, their services, and their content as a basis for evaluating cost effectiveness\n\n    * Provides authoritative guidance on how to transition from legacy systems to the clouds\n\n    * Includes helpful tips for managing cloud vendor relationships and avoiding vendor lock-in\n\nWhether you are already in the cloud or just considering it, this book provides the unbiased understanding of the strengths and weaknesses of cloud computing needed to make informed decisions regarding its future in your organization. The book s strength is that it supplies authoritative insight on everything needed to decide if you should make a transition to the clouds, and if you decide to do so, how to effectively manage relationships with your cloud providers. \n\nMy other torrents:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/insane86&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/insane86&lt;/a&gt;","torrent":{"xt":"urn:btih:298e1005b1c175a3f0b6677ce765aa84fdc0e806","amp;dn":"Cloud+Computing+Strategies+by+Dimitris+N.+Chorafas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298e1005b1c175a3f0b6677ce765aa84fdc0e806","infoHashBuffer":{"type":"Buffer","data":[41,142,16,5,177,193,117,163,240,182,103,124,231,101,170,132,253,192,232,6]},"announce":[],"urlList":[]}}