{"title":"Coast to Coast AM May 28, 2013 - War Gods &amp; Lost Civilizatio","uid":8545534,"size":56001527,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2ab5b8755354f56d83639f8581d675cbe1e6fbc9&amp;dn=Coast+to+Coast+AM+May+28%2C+2013+-+War+Gods+%26amp%3B+Lost+Civilizatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1370519198,"description":"MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n05-28-13\nHost:\nGeorge Noory\nGuests:\nGraham  Hancock,             Craig  Hulet,                   Jeffrey M.  Smith\nAuthor and investigator Graham Hancock discussed some of the hidden supernatural or demonic forces that were factors in the Aztec empire, and the Spanish conquest of Mexico, as well as the Ark of the Covenant, and his research into an advanced lost civilization. In 1519, a Spanish expedition led by Cortes landed on the Yucatan Peninsula, using trained killer dogs, and a cavalry-- the local Maya thought they were dealing with some type of supernatural beings, he said. Human sacrifice was common in the Aztec civilization during this period, and done in the name of Huitzilopochtli (Hummingbird), the demonic Aztec god of war. Montezuma, the Aztec ruler, believed he was in daily, visionary contact with Huitzilopochtli, Hancock noted. \nThe Spaniards were just as violent as the Aztecs and resorted to terrorism, massacring whole villages.&quot;Both of the key players, Montezuma and Cortes felt themselves to be guided by supernatural entities,&quot; driving them to madness and cruelty, and helping to shape human history, Hancock remarked. On the topic of the Ark of the Covenant, Hancock suggested there is evidence that it was used as a powerful weapon of war, containing some type of radiation source. He related this to Iran's motive in seeking to acquire nuclear weapons to fulfill a Shia prophecy about finding the lost Ark of the Covenant which they can use in battle against Israel. \nHancock announced that he's started work on a sequel to his 1995 bestseller, Fingerprints of the Gods to be called Magicians of the Gods, which will offer updates on the archaeological evidence for a lost civilization such as Atlantis. He believes that a global cataclysm was brought on by fragments from a giant comet hitting the Earth in 10,900 BC. Not only did this cause massive extinctions, and plunge the Earth into a 1,000 year deep freeze, but it wiped out almost all traces of the former civilization, he said. Yet, there were survivors who sought to impart the knowledge of their lost civilization. They settled in various locations around the world,, and one of those places was Giza, where they built the great Sphinx, he said. \nMonsanto/GMO Protest Update\nIn the first hour, analyst Craig B. Hulet commented on issues related to Monsanto and GMOs. He lamented that Obama signed off on the HR 933 bill, which says that federal courts cannot stop biotech companies from planting or selling GMO goods to the public, even if testing shows they are hazardous. He was followed by food expert Jeffrey Smith who talked about the success of the recent worldwide March Against Monsanto, in which more than two-million participated, in some 52 countries. The topic is also starting to receive more mainstream coverage, he noted, with CNN covering the protest (video report). \nNews segment guests: Jerome Corsi, Peter Davenport\nWebsite(s):\n grahamhancock.com\n craigbhulet.com\n seedsofdeception.com\n nongmoshoppingguide.com\nBook(s):\n War God: Nights of the Witch\n Fingerprints of the Gods\n The Hydra of Carnage\n Genetic Roulette: The Documented Health Risks of Genetically Modified Foods\n","torrent":{"xt":"urn:btih:2ab5b8755354f56d83639f8581d675cbe1e6fbc9","amp;dn":"Coast+to+Coast+AM+May+28%2C+2013+-+War+Gods+%26amp%3B+Lost+Civilizatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ab5b8755354f56d83639f8581d675cbe1e6fbc9","infoHashBuffer":{"type":"Buffer","data":[42,181,184,117,83,84,245,109,131,99,159,133,129,214,117,203,225,230,251,201]},"announce":[],"urlList":[]}}