{"title":"Updated Pokemon Music Collection","uid":8116478,"size":1723892941,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b37afe394f99fbee0e2749316d9dbd57700170f&amp;dn=Updated+Pokemon+Music+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DSExp111","files":425,"time":1360313309,"description":"Re-uploading this torrent because my DSExpert account was removed for some random reason. -_-\n\n1st uploaded on 2008-01-27 09:08:04 GMT.\n\nThis torrent is a combination of two different Pokemon music torrent. The first one had pretty much ALL the Pokemon music there is to date that were release on music CD's in the US. \n   So there is still Pokemon music to be downloaded, but mostly music from Pokemon movies 6-10 (Jirachi Wish Maker to Dialga vs. Palkia vs. Darkrai). In addition, Pokemon music from the Handheld games on the Gameboy and DS and console games on the Gamecube and Wii. Anyone wishing to download music to these two categories will have to download from another torrent as this one only relates to what I said in the previous paragraph.\n\nThe other torrent that I've included that the other guy didn't was the Japanese compilations that was available in another torrent. This is what I've added onto for this torrent including 5 &quot;Pokemon X - Ten Years of Pokemon&quot; music sound tracks to the other 13 sound tracks (there was supposed to be 18 in all but the other guy didn't include 5 of them for some reason). The ones with the dash at the end of the name of the song is the track that wasn't available in the previous torrent.\n\nAnyway, up till this point these are the latest Pokemon songs that I've compiled and put together to fulfill the request of a poster by the name of Bahamut who posted on the Torrentz website on the &quot;Pokemon Soundtrack Collection&quot; torrent. \n\nEnjoy the added Japanese music from the Japanese Pokemon series as well as the 5 Pokemon X songs! :)\n\nPlease Seed until you reach at LEAST a ratio of 1.2. Please people, leaching is the death of torrents. I sometimes seed until I reach a ratio of 2.0. Much thanks to those who do seed that amount AT LEAST.\n\nThis MP3 file doesn't work btw:\n01_Gekijouban Poketto Monsutaa Taitoru Teema (Theme title of Pocket Monsters Film).mp3","torrent":{"xt":"urn:btih:2b37afe394f99fbee0e2749316d9dbd57700170f","amp;dn":"Updated+Pokemon+Music+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b37afe394f99fbee0e2749316d9dbd57700170f","infoHashBuffer":{"type":"Buffer","data":[43,55,175,227,148,249,159,190,224,226,116,147,22,217,219,213,119,0,23,15]},"announce":[],"urlList":[]}}