{"title":"Moto.Racer.nds.Eur.by.doberman.{}","uid":4633086,"size":33581688,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:2bd36ce063d8c9567b8ffe3cc57f3640c45d33d4&amp;dn=Moto.Racer.nds.Eur.by.doberman.%7B%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rotwailer","files":3,"time":1231457123,"description":"Descripcion del juego:\n\nMoto Racer DS va a ver nuevas opciones dentro del juego. Hasta ahora hemos visto competiciones de Moto GP, \nde SuperCross y no tambiÃƒÂ©n Trial, aunque sÃƒÂ³lo en la tercera entrega del juego de PC.\n \nMoto Racer DS se olvida del Trial, pero trae dos modos de competiciÃƒÂ³n nuevos para esta franquicia. \nDe esta forma, veremos Moto GP y SuperCross como los grandes clÃƒÂ¡sicos de Moto Racer. \nLas variantes en esta entrega de Nintendo DS se llaman TrÃƒÂ¡fico y FreeStyle.\n \nEn Moto GP vamos a tener la oportunidad de competir en 4 modos de juego diferentes como son campeonato, \ncarrera individual, prueba cronometrada y multijugador. AdemÃƒÂ¡s tendremos 12 motos para escoger y 18 pistas \nen diferentes entornos que tendremos que ir desbloqueando.\n \nSupercross ofrece 4 modos de juego muy parecidos, porque podremos participar en un campeonato, carrera individual, \nprueba cronometrada y multijugador. Si bien tenemos tambiÃƒÂ©n 12 motos diferentes para competir, en este caso el nÃƒÂºmero \nde pistas es sÃƒÂ³lo de 12 y es que aquÃƒÂ­ hace falta tÃƒÂ©cnica y cada uno de estos ofrece un desafÃƒÂ­o mayor para los controles.\n \nPero hay dos nuevos modos de juego mÃƒÂ¡s que se llaman TrÃƒÂ¡fico y Freestyle. TrÃƒÂ¡fico es completamente diferente a Moto GP \ny no hay mÃƒÂ¡s que ver dentro de esta competiciÃƒÂ³n los modos. SÃƒÂ³lo tenemos 3 modos de juego y son duelo, multijugador y misiones. \n\nDuelo serÃƒÂ¡ contra los mejores corredores de la ciudad y claro con trÃƒÂ¡fico, lo que exigirÃƒÂ¡ de nosotros unos reflejos impresionantes. \nSin embargo, mÃƒÂ¡s nos llama la atenciÃƒÂ³n las 10 misiones que tendremos que hacer y que nos llevarÃƒÂ¡n desde repartir pizza hasta \nhacer un slalom pasando por dominar al contrario o, por ejemplo, conseguir el mÃƒÂ¡ximo tiempo haciendo un caballito.\n \nEn cuanto al ÃƒÂºltimo modo, sÃƒÂ³lo tenemos dos modos de juego y 4 pistas, pero lo mÃƒÂ¡s importante es que en este juego podremos hacer \nhasta 16 trucos diferentes que necesitarÃƒÂ¡n de gran precisiÃƒÂ³n para lograr llevar a cabo nuestras hazaÃƒÂ±as.\n ","torrent":{"xt":"urn:btih:2bd36ce063d8c9567b8ffe3cc57f3640c45d33d4","amp;dn":"Moto.Racer.nds.Eur.by.doberman.%7B%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd36ce063d8c9567b8ffe3cc57f3640c45d33d4","infoHashBuffer":{"type":"Buffer","data":[43,211,108,224,99,216,201,86,123,143,254,60,197,127,54,64,196,93,51,212]},"announce":[],"urlList":[]}}