{"title":"Noam Chomsky - Power and Terror [Xvid]","uid":5207298,"size":522048348,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e6c70dcb5feb27ce32797a9850119004c0bdaab&amp;dn=Noam+Chomsky+-+Power+and+Terror+%5BXvid%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Crawling_Chaos007","files":2,"time":1260434801,"description":"\n\n      &quot;Everyone's worried about stopping terrorism. Well, \n       there's a really easy way: stop participating in it.&quot; - Noam Chomsky\n\n\n&quot;Power and Terror - Noam Chomsky in our Times&quot; gives the public a rare \nopportunity to see and listen to one of the most articulate, committed \nand hard-working political dissidents of our time, MIT linguist and \npolitical philosopher Noam Chomsky. \n\nChomsky has been called &quot;the most important intellectual alive&quot; by the \nNew York Times, yet he has generally been ignored by the mainstream in \nAmerica. Recently, in the aftermath of the terrorist attacks of September \n11th, Chomsky found himself called upon to provide much-needed analysis \nand historical perspective regarding this moment in American history.  In \nthe months following 9/11, Chomsky gave dozens of talks on four \ncontinents, conducted scores of media interviews, and published a book \ncalled 9-11 - a surprise bestseller in some of the 22 countries in which \nit was published.\n\nChomsky remains a steadfast critic of United States foreign policy and \npresents his often unpopular, but always incisive arguments based on \ndecades of research and analysis, ultimately contextualizing recent \nevents in light of the history of Imperialism.\n\nChomsky places the terrorist attacks of 9/11 in the context of American \nforeign intervention throughout the postwar decades - in Vietnam, Central \nAmerica, the Middle East, and elsewhere. Beginning with the fundamental \nprinciple that the exercise of violence against civilian populations is \nterror, Chomsky - in stark and uncompromising terms - challenges the \nUnited States to apply to its own actions the moral standards it demands \nof others.\n\nDuration 1:11:30\t\t\n\n","torrent":{"xt":"urn:btih:2e6c70dcb5feb27ce32797a9850119004c0bdaab","amp;dn":"Noam+Chomsky+-+Power+and+Terror+%5BXvid%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e6c70dcb5feb27ce32797a9850119004c0bdaab","infoHashBuffer":{"type":"Buffer","data":[46,108,112,220,181,254,178,124,227,39,151,169,133,1,25,0,76,11,218,171]},"announce":[],"urlList":[]}}