{"title":"Living With The Dead series by Joshua Guess (01-07)","uid":9636350,"size":6316644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e6ff028981523a3a4a6f97ac27dc658f3e281a5&amp;dn=Living+With+The+Dead+series+by+Joshua+Guess+%2801-07%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":21,"time":1392850616,"description":"\nJoshua Guess (who goes by Josh most of the time, but Joshua professionally because his mom insists) is originally from southern Illinois, but moved to central Kentucky at an early age.\n\nAlways a storyteller, his interest in creating began with art. He loved to draw and come up with stories about his pictures.\nThen he discovered comic books and novels, and things...took a turn.\nDevouring everything from superboy to Stephen King, Josh started to gain a greater interest in writing, making it a hobby during high school and achieving distinguished marks in his portfolio.\n\nThen, life got in the way. College and the struggle to start a life of his own away from home took up most of his time. His love of telling stories took a back seat to the needs of daily life for many years, with the occasional foray into working on one project or another.\n\nIn late 2009, Josh buckled down and started work on an idea for a fantasy novel that had been stuck in his head since those halcyon days back in high school. Struggling to find a voice, Josh realized months later after many false starts that he needed to stretch his brain a little, strengthen his writing muscles. So he began another project that had been simmering in the back of his mind, a continuing serialized zombie story, told in the form of a daily blog.\n\nLiving With the Dead has given him a measure of success, but more important has imparted new skills at wordsmithing and the drive to complete. 'Bound to Silence', his debut novel, has been released and is available now, as are many collections and versions of Living With the Dead.\nOnce that tipping point was reached, there was no choice for him but to keep on writing. Much more of Josh's work will be released in the coming months.\n\nGenre: Horror | Zombie\n\n\nWith Spring Comes the Fall #1\nWhen the world falls apart and the true nature of mankind is revealed, a small group of survivors in Kentucky make a go of holding their ground and building again. Through hordes of undead and bands of ruthless marauders, they come together with a common purpose. Over the days and months, they begin to learn that when the world is filled with the dead, the only choice is to learn how to truly live.\n\nThe Bitter Seasons #2\nAs the group of survivors in Kentucky grows and the compound evolves into a true community, new hope rises. The struggle to live has become a cooperative effort by many to build something new. Though the threat of the zombie hoards and violent marauders is ever-present, the citizens of the compound discover new allies and friends, and new hope. The effort of merely existing fades as the growing community discovers that it is possible to truly live in a world of the dead.\n\nThe Hungry Land #3\nOne year after the zombie plague ravaged humanity in what would become known as The Fall, the survivors in Kentucky struggle on. They have faced swarms of undead and war with living men, but in the third collection of the story they face their most powerful enemy yet. Each other.\n\nThe Wild #4\nCountry In the latter half of the second year after The Fall, mankind is beginning to grow once again. The survivors in Frankfort, Kentucky have battled the undead, thrown off attacks from human oppressors, and finally managed to achieve something like peace.\n\nKeeping the tenuous alliances and friendships with other distant settlements strong has become vitally important. Though many colonies of living people have been created from the ashes of civilization, the land between is deadly.\n\nIn this volume, travel along dangerous roads to new locations, meet others who have made their stand against the end of the world. See an America destroyed by chaos, but populated with a people defiant in the face of the end of all they knew.\n\nThis New Disease #5\nIn this pivotal volume of Living With the Dead, survivors all across the country struggle against a new breed of zombie, living enemies bent on murder and destruction, and even larger threats almost impossible to fight.\n\nTwo years after The Fall, the cataclysm brought on by the zombie plague, survivors everywhere are building a new world. The cost has been high, both physically and mentally. How will the tenuous civilization emerging from the wreckage of what was manage under an onslaught from forces beyond their control?\n\nRead on and discover that beyond the need to truly live comes the hard choice on how to move forward. In the face of dire adversity, can the survivors in Kentucky stay on the right path?\n\nAmerican Recovery #6\nTwo and a half years have passed since The Fall. The survivors in Kentucky have faced death and war, famine and disease. Threats both obvious and subtle. In this, the sixth volume of Living With the Dead, new alliances are born between communities as those left behind at the end of the world begin to take sides.\n\nEver After #7\nIn the final volume of Living With the Dead, a new world is born. Survivors begin to resettle areas long abandoned by humanity, and as always war follows closely in their footsteps.\n","torrent":{"xt":"urn:btih:2e6ff028981523a3a4a6f97ac27dc658f3e281a5","amp;dn":"Living+With+The+Dead+series+by+Joshua+Guess+%2801-07%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e6ff028981523a3a4a6f97ac27dc658f3e281a5","infoHashBuffer":{"type":"Buffer","data":[46,111,240,40,152,21,35,163,164,166,249,122,194,125,198,88,243,226,129,165]},"announce":[],"urlList":[]}}