{"title":"VA House of Blues: Essential Blues V1 Dsk 2 of 2 (1995) [Blues][","uid":5009917,"size":143377389,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2f15f98fcc821b87288736506936f818181bd339&amp;dn=VA+House+of+Blues%3A+Essential+Blues+V1+Dsk+2+of+2+%281995%29+%5BBlues%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":21,"time":1247936151,"description":"VA House of Blues: Essential Blues V1 Dsk 2 of 2\nAudio CD: July 25, 1995 \nOriginal Release Date: 1995 \nNumber of Discs: 2 \nLabel: House of Blues \nBitrate: 320 kbps\n\nEssential Blues is an attempt to trace the evolution of the music from the Mississippi Delta to Chicago and other modern, urban cities.  It does a fairly good job in providing a brief history, but the main strength of the collection simply comes from the music.  Featuring cuts from Lightnin' Hopkins, Howlin' Wolf, B. B.  King, Slim Harpo, Junior Parker, Elmore James, Albert Collins, and many, many others, it's a quick and effective way to sample a variety of different blues styles.  For neophytes, Essential Blues does offer a splendid introduction to the genre. \n\nI bought the Shoebox Full of Blues which contains this disc, and the selection and quality is first rate.  There isn't a bad track on the disc, and the mastering is superb.  These may be the highest quality versions of these classics you'll hear.  Blues purists may argue that vinyl is the only &quot;true&quot; way to listen to these, but who among us has pristine vinyl and the equipment to do it justice? \n\nI wish I had known about the commentary/intros mentioned in another review of this title (There's no mention of the commentary on the reviews or details of the box set).  I too find them extremely annoying, and really detest the fact that the produces grafted them onto the end of tracks instead of making them standalone cuts.  For all of us that rip our CD's to MP3 there is a cure.  It takes a few minutes, but it's worth it.  Grab MP3Trim, a free MP3 editor from http://www. mptrim. com/ Then trim from the end of these cuts as indicated.  \n\nKilling Floor - 28 Seconds \nBetter Off With The Blues - 19 Seconds \nMojo Hand - 43 Seconds \nWalking The Backstreets And Crying - 35 Seconds \nLet's Straighten It Out - 27 Seconds \nRainin' In My Heart - 31 Seconds \n\nI'd also suggest you adjust the volume by -3 db when you trim or you'll induce some clipping on the edited tracks.  \n\nOnce you do that, and assuming you don't rip the intro that starts each disc, you're left with 30 tracks of nothin' but Blues, guaranteed to make you want more.  ~ Southern Feat Fan\n\nI have had this C. D.  for at least 6 years and it is still one of my favorites.  I also happen to like the introductions that the other reviewer found annoying. . . it makes me feel like I am at the show.  I bought my CD at the House of Blues in New Orleans and it brings back great memories of my trip.  Several of my friends have heard the CD and wanted to buy it.  ~ A Customer, Amazon\n\nVA House of Blues: Essential Blues V1 Dsk 2 of 2\n01  Intro - Stanley Bennet Clay\n02  Master Charge - Albert Collins\n03  Mother Nature - Koko Taylor\n04  Walking The Backstreets And Crying - Little Milton\n05  Give Me Back My Wig - Hound Dog Taylor\n06  Prisoner Of Love - James Brown\n07  You Upset Me Baby - B. B.  King\n08  Let's Straighten It Out - Latimore\n09  I'll Play The Blues For You (Parts 1&amp;2) - Albert King\n10  Must Have Been The Devil - Otis Spann\n11  Dimples - John Lee Hooker\n12  Rainin' In My Heart - Slim Harpo\n13  The Getaway - Fenton Robinson\n14  Too Much Sugar For A Dime - Katie Webster\n15  Bright Lights, Big City - Jimmy Reed\n16  Drivin' Wheel - Junior Parker","torrent":{"xt":"urn:btih:2f15f98fcc821b87288736506936f818181bd339","amp;dn":"VA+House+of+Blues%3A+Essential+Blues+V1+Dsk+2+of+2+%281995%29+%5BBlues%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f15f98fcc821b87288736506936f818181bd339","infoHashBuffer":{"type":"Buffer","data":[47,21,249,143,204,130,27,135,40,135,54,80,105,54,248,24,24,27,211,57]},"announce":[],"urlList":[]}}