{"title":"Battle of Austerlitz (1993 BBC Docu Brian Blessed narrates)","uid":5272572,"size":366657400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f1f6d2db84bcb7934bd30ebd3426227bc638190&amp;dn=Battle+of+Austerlitz+%281993+BBC+Docu+Brian+Blessed+narrates%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1263286040,"description":"Battle of Austerlitz - Narrated by Brian Blessed\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 753kbps \nDuration.............: 55:15.278\nResolution...........: 464*352 \nFramerate............: 29.970 \nAudio Codec..........: 0x0055 MPEG-1 Layer 3 \nAudio Bitrate........: 117 kbps VBR \nAudio Channels.......: 2 \nFilename.............: Battle of Austerlitz.avi \nFilesize.............: 366,358,528 \nNo Subtitles\nNot listed at IMDB\n\nPart of the Cromwell Films LTD. Napoleon series from 1993 - Fine introduction to the battle. For serious history buffs, DAVID CHANDLER served as advisor to the series! The film uses early computer graphics and stock footage from an old Soviet film.\n\n\nDVD cover reads: Stand on the battlefield of Austerlitz on Dec. 2, 1805, and witness the keen strategy and tactical genius that led to Napoleon's decisive victory against the Austrian and Russian armies. Narrated by Brian Blessed, this fascinating historical program uses dramatic re-enactments, 3D graphic mapping techniques, &quot;eyewitness&quot; accounts and Russian archive film footage to restage the pivotal Battle of the Three Emperors.\n\n &lt;a href=&quot;\nhttp://bayimg.com/EajGGaACk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EajGGaACk&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Battle_of_Austerlitz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Battle_of_Austerlitz&lt;/a&gt;\n\n\nThe Battle of Austerlitz (Czech: Bitva u Slavkova) also known as the Battle of the Three Emperors, was one of Napoleon Bonaparte's greatest victories, effectively destroying the Third Coalition against the French Empire. On 2 December 1805 (20 November Old Style, 11 Frimaire, XIV, in the French Republican Calendar), a French army, commanded by Emperor Napoleon I, decisively defeated a Russo-Austrian army, commanded by Tsar Alexander I, after nearly nine hours of difficult fighting. The battle took place near Austerlitz (Slavkov u Brna) about 10 km (6 miles) south-east of Brno in Moravia (present day Czech Republic). The battle is often regarded as a tactical masterpiece.\n\nThe French victory at Austerlitz effectively brought the Third Coalition to an end. On 26 December 1805, Austria and France signed the Treaty of Pressburg, which took Austria out of the war, reinforced the earlier treaties of Campo Formio and LunÃƒÂ©ville, made Austria cede land to Napoleon's German allies, and imposed an indemnity of 40 million francs on the defeated Habsburgs. Russian troops were allowed to head back to home soil. Victory at Austerlitz also permitted the creation of the Confederation of the Rhine, a collection of German states intended as a buffer zone between France and central Europe. In 1806, the Holy Roman Empire ceased to exist when Holy Roman Emperor Francis II kept Francis I of Austria as his only official title. These achievements, however, did not establish a lasting peace on the continent. Prussian worries about growing French influence in Central Europe sparked the War of the Fourth Coalition in 1806.","torrent":{"xt":"urn:btih:2f1f6d2db84bcb7934bd30ebd3426227bc638190","amp;dn":"Battle+of+Austerlitz+%281993+BBC+Docu+Brian+Blessed+narrates%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1f6d2db84bcb7934bd30ebd3426227bc638190","infoHashBuffer":{"type":"Buffer","data":[47,31,109,45,184,75,203,121,52,189,48,235,211,66,98,39,188,99,129,144]},"announce":[],"urlList":[]}}