{"title":"Mysore Cooking","uid":8014589,"size":128576008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f4f1e8a6cfb5f06952610fa629bcf1879c09f02&amp;dn=Mysore+Cooking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cyberkeg","files":2,"time":1358037355,"description":"2 copies of the same book:\nHigh res PDF\nLow res OCRed PDF\n\nMysore Style Cooking [Paperback]\nV. Sandhya (Author), Sandra Ramacher (Editor)\n\nMysore Style Cooking is a unique Indian cookbook straight from one of the humblest culinary experts of Mysore, India Ms. V. Sandhya. This is Indian food as you will never find it in the umpteen commercial Indian restaurants present in our cities. Sandhya draws from the generations of knowledge, passed down to her by her family, to bring to the world recipes that are Ayurvedically balanced and delightful in flavor. We expect these secret recipes to be complicated and mysterious, only to discover that they are simple to prepare - they just needed to be written down and passed on. Mysore Style Cooking includes over 60 of these much treasured recipes as well as over 70 full page color images, interspersed with personal stories and images of life in Mysore. To bring you these wonderful recipes Ms V. Sandhya has delved deeply into her treasure trove of family recipes, some of which span generations. The food is simple, delicious and Ayurvedically designed to be balanced. This is traditional Mysore style cooking enhanced by Sandhya's extensive knowledge of the yogic diet. This is vegetarian food at its best, ranging from uppittu and dosa, eaten mostly for breakfast through to palyas, curries, sambal, chutneys and raitas as well as sweet dishes such as pongals and rasayanas. If you ever wanted to know what Indian people eat at home, rather than the fare served at commercial restaurants, than Mysore Style Cooking will provide you with the secrets to those recipes.\n\nPaperback: 160 pages\nPublisher: Elephant Publishing; First edition (September 20, 2010)\nLanguage: English\nISBN-10: 0980382815\nISBN-13: 978-0980382815","torrent":{"xt":"urn:btih:2f4f1e8a6cfb5f06952610fa629bcf1879c09f02","amp;dn":"Mysore+Cooking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f4f1e8a6cfb5f06952610fa629bcf1879c09f02","infoHashBuffer":{"type":"Buffer","data":[47,79,30,138,108,251,95,6,149,38,16,250,98,155,207,24,121,192,159,2]},"announce":[],"urlList":[]}}