{"title":"Middle Of The Road - Kailakee Kailako (Disco 1973)","uid":4690176,"size":26087652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2fe57dbc1ca29a9561ab8f195ce84ebbeed47742&amp;dn=Middle+Of+The+Road+-+Kailakee+Kailako+%28Disco+1973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Iron_Horse","files":2,"time":1233364554,"description":"Middle Of The Road - Kailakee Kailako (Disco '73)\nFirst Aired: 22th September 1973 / Type: AVI File / Quality: VG\nLenght: 02:40 min / Video Size: 640 x 480 (4:3)\n\nMiddle Of The Road was a Scottish pop group who enjoyed great success across Europe in the early 1970s. Lead singer Sally Carr (born 28 March 1945), drummer Ken Andrew (b. 28 August 1947), guitarist Ian McCredie (b. 15 July 1948), and on the bass his brother Eric McCredie (17 July 1945 - 6 October 2007) from Glasgow founded the band on 1 April 1970.Three of their singles sold over one million copies each, and received a gold disc. The tracks were &quot;Chirpy Chirpy Cheep Cheep&quot; (which went on to sell over 10 million), &quot;Tweedle Dee Tweedle Dum&quot; and &quot;Soley Soley&quot;. By early 1972 alone the group had sold over five million records.\n\nDisco was a pop music program that aired in Germany on the ZDF network from 1971 to 1982. It generally aired each Saturday night at 7:30PM, running 45 minutes each week. 133 shows were produced. The show was hosted by German actor and comedian Ilja Richter. Its lesser known predecessor on ZDF, 4-3-2-1 Hot &amp; Sweet was aired between 1966 and 1970, presenters included Richter and Suzanne Doucet. Disco generally served a younger pop-oriented audience compared to ZDF's Hitparade, and until 1972, its main competitor was Beat-Club (originally patterned after the pure live-act show Ready Steady Go! in the UK, from the late-1960s turning more and more into psychedelic music videos made especially for the invited acts), followed by Musikladen, both on ARD.\n\nRepeats of Disco have been aired since 1984 on ZDF Musikkanal, after its closedown in 1989 on 3sat. Since 2004, the digital ZDF Theaterkanal aired repeats of the entire series. In 2007, ZDF Dokukanal began to air reruns, starting with episodes from 1975.\n\nThe show focussed on chart hits current at the time of airing, giving about equal airtime to international pop music and German Schlager. Despite its name, it did not particularly focus on disco music although it featured many disco hits as long as they were chart relevant. (The name of the show was devised before disco as a musical style existed).  From Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:2fe57dbc1ca29a9561ab8f195ce84ebbeed47742","amp;dn":"Middle+Of+The+Road+-+Kailakee+Kailako+%28Disco+1973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe57dbc1ca29a9561ab8f195ce84ebbeed47742","infoHashBuffer":{"type":"Buffer","data":[47,229,125,188,28,162,154,149,97,171,143,25,92,232,78,187,238,212,119,66]},"announce":[],"urlList":[]}}