{"title":"Adventist Media, The Young Age Of The Earth","uid":4864002,"size":305234900,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3018f2ce3b9999d634f6a251d15b3e2f32526dd6&amp;dn=Adventist+Media%2C+The+Young+Age+Of+The+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Porkster","files":1,"time":1240387289,"description":"The Young Age of the Earth is a 76 minute VHS/DVD video which explains how a created, young Earth, is compatible with a myriad of field evidences and the Genesis record of creation in six literal days.\n\nDr. Robert V. Gentry and his son, David present young earth evidences supporting rapid coal formation such as polonium halos in coalified wood and the astonishingly pure giant coal beds of the Powder River Basin. These coal beds, sometimes hundreds of feet thick, are better explained by a rapid deposition and burial of billions of tons of vegetation by a massive flood mechanism. Present day oil formation in the Guaymas Basin is seen using deep sea footage from DSV Alvin. Aerial and ground based footage of the Grand Canyon illustrate features which question whether the Colorado River carved the canyon over millions of years.\n\nDr. Walt Brown discusses his hydroplate theory which is consistent with the biblical flood model. Scenes from the visitor center at Dinosaur National Monument are explained in a startling new way. An explanation of cavitation includes footage from the Glen Canyon Dam where the power of catastrophically driven water is demonstrated in the spillway tunnels at the dam.\n\nFossil Butte National Monument is also visited where inconsistencies between accepted theory and fossil evidence abound. The mass burial and deposition of millions of fish demands a theory of catastrophism similar to that required in the Grand Canyon. Dinosaur tracks in the coal mines of Eastern Utah near Price are documented and related to the age of the coal which they are found in. The published evidence from the deep drill holes in New Mexico show helium retention which is impossible to explain except by a young Earth paradigm. A synopsis of the polonium halos evidence for a rapid crystallization of granite is given explaining the difficulties they pose to the view of an anciently evolving planet from a hot melt.\n &lt;a href=&quot;\nhttp://www.halos.com/videos.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.halos.com/videos.htm&lt;/a&gt;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED.  PLEASE VISIT OUR SITE AND SHARE THE WORD!","torrent":{"xt":"urn:btih:3018f2ce3b9999d634f6a251d15b3e2f32526dd6","amp;dn":"Adventist+Media%2C+The+Young+Age+Of+The+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3018f2ce3b9999d634f6a251d15b3e2f32526dd6","infoHashBuffer":{"type":"Buffer","data":[48,24,242,206,59,153,153,214,52,246,162,81,209,91,62,47,50,82,109,214]},"announce":[],"urlList":[]}}