{"title":"BBC-HD Great Barrier Reef 2 - Reef to Rainforest x264 AC3 720p.m","uid":6942459,"size":2025891205,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:30983dc995dd9977d943ddce1c64fdd44bb6e17f&amp;dn=BBC-HD+Great+Barrier+Reef+2+-+Reef+to+Rainforest+x264+AC3+720p.m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos01","files":1,"time":1326098614,"description":"58:51\n\n\nReef to Rainforest\n\nEpisode 2 of 3\n\n\nThree-part series exploring Australia's Great Barrier Reef, one of the natural wonders of the world and the largest living structure on our planet.\n\nMonty Halls explores its full 2000-kilometre length, from the wild outer reefs of the Coral Sea to the tangled mangrove and steaming rainforest on the shoreline; from large mountainous islands to tiny coral cays barely above sea level; from the dark depths of the abyss beyond the reef to colourful coral gardens of the shallows.\n\nAlong the way, he experiences the reef at its most dangerous and its most intriguing, and visits areas that have rarely been filmed, from the greatest wildlife shipwreck on earth to the mysterious seafloor of the lagoon, where freakish animals lurk under every rock.\n\nThe Great Barrier Reef as a whole covers an area larger than Great Britain but amazingly only seven percent of it is coral reef. The rest is a variety of interconnected habitats including the world's oldest jungle, hundreds of islands, mangrove swamps, mysterious deep water gardens, vast sand flats and meadows of sea grass - all full of amazing wildlife. A giant deep-water lagoon connects all of these, and many of the creatures that live in it are almost impossibly weird - from giant hammerhead sharks to the bizarre 'pearl fish' that lives its life up a sea cucumber's bottom.\n\nMarine life here also exists in spectacular profusion, as on the 100-year-old shipwreck of the SS Yongala, considered to be the greatest wildlife wreck on earth. The connections between all these environments mean that, not only do they depend on each other, but without them the coral reef itself would not survive.\n\n\nSource: BBC-HD\n\n\nA/R (WxH): 1:1.78 (1280*720)\nVCodec: x264 from AVC in TS\nAudio: AC3 2ch 192Kbps in TS\n\nHD downsized/resized: 1920*1080i to 1280*720p\n\nFlawless encoding\n\nPls help seed to keep torrent alive!\t\t\n","torrent":{"xt":"urn:btih:30983dc995dd9977d943ddce1c64fdd44bb6e17f","amp;dn":"BBC-HD+Great+Barrier+Reef+2+-+Reef+to+Rainforest+x264+AC3+720p.m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30983dc995dd9977d943ddce1c64fdd44bb6e17f","infoHashBuffer":{"type":"Buffer","data":[48,152,61,201,149,221,153,119,217,67,221,206,28,100,253,212,75,182,225,127]},"announce":[],"urlList":[]}}