{"title":"Wolverine v3 01-74 + Ex (2003-2009|Digital|Minutemen+Empire)","uid":9694206,"size":2730771268,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:34ff544a56af5874966270657cd91a1f02e49a14&amp;dn=Wolverine+v3+01-74+%2B+Ex+%282003-2009%7CDigital%7CMinutemen%2BEmpire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1393912011,"description":"This is first 74 issues of Wolverine v4 + the conclusion of Old Man Logan and some extras and annuals. This does not contain 75-90 of Dark Wolverine, as I will post that in a separate torrent along with Daken (so all the &quot;Dark&quot; stuff is in one place). I'm also grabbing higher-resolution scans of that run than what has been available. This volume of Wolverine is notable for the quality of writing, featuring the legendary Jeph Loeb and Mark Millar along with excellent talent such as Daniel Way, Greg Rucka and Jason Aaron (who would go on to write Wolverine and the X-Men). There is also some great art by Steve McNiven, Derick Robertson and many others. Throughout this run, Marvel and therefore Wolverine is besieged by catastrophic storylines, including - Avengers Disassembled, House of M, Civil War, Dark Reign, Secret Invasion, Onslaught, Decimation, Messiah CompleX, and more. Many of these affected Logan and his teammates from both teams quite significantly, and we see the results play out in this title as well. \n\nGesserit has previously collected this volume into 5 parts; I have merely added it all together and excised some stuff for other releases (such as Weapon X) and deleted some of the extras I already included in the v4 torrent recently posted (the ones that overlap). So in other words, if you grab this torrent, v4 and the upcoming &quot;Dark&quot; torrent, you will still have all the extras as well as some bonuses and I will likely post Weapon X by itself as well. However, since he so kindly split the volume into storylines, I have left those intact. The extras that remain are the five 2009 one shots - Chop Shop, Flies To A Spider, Switchback, Revolver, and The Anniversary. Also included are the 2007 and 2008 Annuals, with a Minutemen scan of &quot;Roar&quot; replacing the previous version. These manual scans are by various Minutemen groups as well as one each by Zone and DarthScanner-DCP. The main issues are all in Digital thanks to Minutemen-InnerDemons, TheHand-E and Empire proper. Thanks to all of those scanners for their hard work, and please seed - enjoy! :-) ","torrent":{"xt":"urn:btih:34ff544a56af5874966270657cd91a1f02e49a14","amp;dn":"Wolverine+v3+01-74+%2B+Ex+%282003-2009%7CDigital%7CMinutemen%2BEmpire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34ff544a56af5874966270657cd91a1f02e49a14","infoHashBuffer":{"type":"Buffer","data":[52,255,84,74,86,175,88,116,150,98,112,101,124,217,26,31,2,228,154,20]},"announce":[],"urlList":[]}}