{"title":"El Hospital de los muertos.(Capitulos 13.Ultimo Capitulo).(DVDRi","uid":4786689,"size":690188288,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3521f1e7f5b4387802cb0b8eb1ff811d3a83c776&amp;dn=El+Hospital+de+los+muertos.%28Capitulos+13.Ultimo+Capitulo%29.%28DVDRi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":2,"time":1237575325,"description":"13. Apoteosis\nEn poco menos de tres horas, a las once y cuarenta y siete minutos de la noche, serÃƒÂ¡ la hora clave para el Kingdom. LlegarÃƒÂ¡ el final para el hospital Kingdom.\nCon terremotos cada vez mÃƒÂ¡s frecuentes que seÃƒÂ±alan la llegada del hospital Kingdom a sus momentos finales, el doctor Richard Shwartz (Gerard Plunkett) trata de advertir a Stegman del peligro inminente. Todos juntos desde el laboratorio de SueÃƒÂ±o, Sally recluta a Peter para viajar por la entrada sobrenatural del pasado del hospital y revelar la verdad sobre su preocupante historia. Pero, rechazando apreciar la gravedad de las advertencias de Schwarzton, Stegman estÃƒÂ¡ empecinado en vengarse de Christa y Abel y de todo aquel que ÃƒÂ©l considera culpable de la destrucciÃƒÂ³n de su apreciado coche, sobre todo Hook que es a quien mÃƒÂ¡s culpa.\nAntes de nada Sally le explica lo que sabe a los demÃƒÂ¡s. Comienza explicÃƒÂ¡ndoles como consiguiÃƒÂ³ la informaciÃƒÂ³n gracias al bibliotecario, a los recortes de periÃƒÂ³dico guardados dentro e la muÃƒÂ±eca de Mary y sobre todo gracias a su amigo Lenny Stillmach que tras morir la puso en contacto con Mary quien mÃƒÂ¡s le ayudo. AdemÃƒÂ¡s que desde que contaba con la ayuda de Hook y Christine y pudo quedarse Mary ha acudido a ella muchas veces. Les explica como Mary estÃƒÂ¡ allÃƒÂ­ con ellos pero alguno no se lo cree por ello Peter despierta y de repente Mary y Antubis se hacen visibles para todos. Sally explica que Antubis es el guardiÃƒÂ¡n de la puerta que hay entre la vida y la muerte, personaje al que los egipcios llamaban Anubis y que ellos ven como oso hormiguero por el malentendido de una niÃƒÂ±a. Durante 135 aÃƒÂ±os Mary ha sido obligada a revivir el incendio y su propia muerte una y otra vez, junto a ella muchas almas que llevan cientos de aÃƒÂ±os atrapadas , muchas de ellas locas, y sin Antubis Mary habrÃƒÂ­a sido una de esas pobres almas ya que ambos son guardianes del tiempo. El hospital es un buen lugar para ello ya que la balanza oscila entre la vida y la muerte, lo malo es que en el Kingdom la balanza se ha destruido y ellos han de hacer algo para nivelarla.\nSegÃƒÂºn les cuenta Sally fue la pequeÃƒÂ±a Mona quien le ayudo a entenderlo todo. En 1869 Mary Jensen, una huÃƒÂ©rfana, era la niÃƒÂ±a del tiempo en el molino Gates, que se encontraba en el mismo lugar donde ahora se levanta el hospital, y era quien tocaba las horas, los cambios de turno, almuerzos, cenas, y era la favorita de todo el mundo, el ÃƒÂ¡ngel del molino. Durante la guerra de secesiÃƒÂ³n trabajaban en turnos de 16 horas confeccionando uniformes pero una vez acabada el molino redujo su trabajo y los niÃƒÂ±os sÃƒÂ³lo hacÃƒÂ­an turnos de 12 horas pero Ebenezer Gottreich, el propietario, no era un hombre de negocios y un dÃƒÂ­a en el otoÃƒÂ±o de 1869 tuvo una idea fruto de su avaricia y desesperaciÃƒÂ³n porque en noviembre de 1869 sus empresas se tambaleaban en la bancarrota por la mala administraciÃƒÂ³n. La enfermerÃƒÂ­a estaba situada justo donde hoy estÃƒÂ¡ el hospital y el lunÃƒÂ¡tico que lo dirigÃƒÂ­a era el doctor Klaus Gottriech que habÃƒÂ­a convertido el lugar en una cÃƒÂ¡mara de tortura por sus ideas sobre el dolor y gracias al molino tenia conejillos de indias humanos. Ebenezer Gottreich y su capataz, a Hagarty, conspirÃƒÂ³ para incendiar el molino por el dinero del seguro por la propiedad y por cada muerto. Mary fue testigo de todo pero logro salvarse gracias a Antubis y a consecuencia de devolverle un sombrero de Hagarty descubrieron que lo habÃƒÂ­a visto todo y por ello el doctor Klaus Gottriech le prÃƒÂ¡ctica una operaciÃƒÂ³n para borrarle la mente. Tras diez dÃƒÂ­as clavÃƒÂ¡ndole punzones Mary muriÃƒÂ³.\nEl doctor Louis Traff le administra una dosis a cada uno de los presentes para que puedan hacer un viaje al antiguo Kingdom. Y aquÃƒÂ­ es cuando descubren la verdadera historia del hospital Kingdom.\n","torrent":{"xt":"urn:btih:3521f1e7f5b4387802cb0b8eb1ff811d3a83c776","amp;dn":"El+Hospital+de+los+muertos.%28Capitulos+13.Ultimo+Capitulo%29.%28DVDRi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3521f1e7f5b4387802cb0b8eb1ff811d3a83c776","infoHashBuffer":{"type":"Buffer","data":[53,33,241,231,245,180,56,120,2,203,11,142,177,255,129,29,58,131,199,118]},"announce":[],"urlList":[]}}