{"title":"Brownsville Worship - Send The Fire","uid":4521474,"size":103252516,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3565b48beabe6bab48c9ac5c0ef6727c1ef5ccc0&amp;dn=Brownsville+Worship+-+Send+The+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1227181969,"description":"Hi there..\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nWell, anyway.. I once heard of something going on down in Brownsville, Florida. They said it was a revival, an awakening of the Christians, the best to ever happen on a big scale since the Jesus-People movement in the 70's and partially 80's..\n\nFrom what I heard in the music, I found it to be true. It awakened me..\n\nWhat since happened down there, I'm not really sure, but I heard something about a division among them because of something that was thought in their Bible study/school or something?\n\nI remember hearing the name Rodney Howard Browne in that context. You know this guy who hangs out with this.. what's his name again..Kenneth Copeland!\nYou know those guys who fall around laughing, and talks about BMWs and Rolex' as &quot;fruits of the Spirit&quot;? Certainly not the Holy Spirit of God? \n\nThe guys who are teaching Christians the really, really &quot;true gospel&quot;, the ones that, if you slow down their &quot;speaking in tongues&quot; say things like: &quot;Give a demon in him, Satan&quot; and &quot;Bind their money to us, Satan&quot; and things like that.. \n\nThose guys who preach like Benny Hinn and obviously mean they know how things are and what the truth really is, and actually know a little better than Jesus how things are gonna be with His Church? Well, if you're supposed to believe their words over Jesus' Words, I guess it's true.. Or not..?\n\nAll that talk about money and stuff, doesn't it remind you of something going on in the middle ages under the reign of the so called &quot;Mother Church&quot; and the Jesuit/occultists? Hmmm..\n\nWell. anyway. This wasn't meant to be a lecture on &quot;how to reveal and dismiss false teachers and prophets&quot;. This recording is still, in my opinion, great! And there is still power in the blood of the Lamb. Abundantly..!\n\nSo can it be that I should gain an interest in my Saviour's Blood.. And that if I stay close to Him and His Words, He'll stay close to me? Well, He said so..\nI'll believe Him.. :-)\n\nEnjoy the music!\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1d6b786f747b746f78707c74715d7a707c7471337e7270&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:3565b48beabe6bab48c9ac5c0ef6727c1ef5ccc0","amp;dn":"Brownsville+Worship+-+Send+The+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3565b48beabe6bab48c9ac5c0ef6727c1ef5ccc0","infoHashBuffer":{"type":"Buffer","data":[53,101,180,139,234,190,107,171,72,201,172,92,14,246,114,124,30,245,204,192]},"announce":[],"urlList":[]}}