{"title":"Stranded Deep v0.05.E4 (64 Bit)","uid":12760575,"size":587988977,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:365b6cac202954636fc32dd5d7756f057b91087e&amp;dn=Stranded+Deep+v0.05.E4+%2864+Bit%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1447527487,"description":"About This Game\r\nTake the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Experience terrifying encounters both above and below an endless environment. Come face to face with some of the most life threatening scenarios that will result in a different experience each time you play.\r\n\r\nScavenge. Discover. Survive.\r\n---\r\n\r\n    Infinite Procedurally-generated World - Explore Pacific islands, reefs, and bottomless ocean trenches filled with detailed biomes.\r\n    No two worlds are the same, even share your world seed!\r\n    Dynamic Weather and Day-Night Cycle - Struggle to navigate stormy seas or enjoy basking with a coconut on a sunny afternoon.\r\n    Unique Physically-based Crafting System - Harvest resources to create equipment by combining them together in the physical world - no crafting slots!\r\n    Unique Physically-based Building System - Settle on an island and construct a shelter or venture the seas with your own built raft.\r\n    Detailed Survival Aspects and Interaction - Manage your vitals of hunger, thirst, blood, and health against the harshness of mother nature.\r\n    Random Loot and Collectables - Search sunken shipwrecks and islands for interesting and rare equipment.\r\n    Hunting and fishing - Spear small animals in the shallows or risk the depths with a spear gun in search of larger meals. Starve an island of resources or maintain and manage its growth","torrent":{"xt":"urn:btih:365b6cac202954636fc32dd5d7756f057b91087e","amp;dn":"Stranded+Deep+v0.05.E4+%2864+Bit%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"365b6cac202954636fc32dd5d7756f057b91087e","infoHashBuffer":{"type":"Buffer","data":[54,91,108,172,32,41,84,99,111,195,45,213,215,117,111,5,123,145,8,126]},"announce":[],"urlList":[]}}