{"title":"International Night: A Father and Daughter Cook Their Way Around","uid":10875133,"size":30409073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36cc147d104de128b8deeaaea8bd6d16e7485250&amp;dn=International+Night%3A+A+Father+and+Daughter+Cook+Their+Way+Around&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jallentino","files":2,"time":1408987365,"description":"\n\nMark Kurlansky, &quot;International Night: A Father and Daughter Cook Their Way Around the World&quot;\nISBN: 1620400278 | 2014 | EPUB | 384 pages | 29 MB\n\n\nOnce a week in the Kurlansky home, Mark spins a globe and wherever his daughter's finger lands becomes the theme of that Friday night's dinner. Their tradition of International Night has afforded Mark an opportunity to share with his daughter, Talia--and now the readers of International Night--the recipes, stories, and insights he's collected over more than thirty years of traveling the world writing about food, culture, and history, and his charming pen-and-ink drawings, which appear throughout the book.\n\nInternational Night is brimming with recipes for fifty-two special meals--appetizers, a main course, side dishes, and dessert for each--one for every week of the year. Some are old favorites from Mark's repertoire, and others gleaned from research. Always, they are his own version, drawn from techniques he learned as a professional chef and from many years of talking to chefs, producers, and household cooks around the world. Despite these insights, every recipe is designed to be carried out--easily--by any amateur chef, and they are designed to be completed with the assistance of children.\n\nMark and Talia invite you and your family into their kitchen, outfitted with overflowing packets of exotic spices and aromas of delicacies from Tanzania and Kazakhstan to Cuba and Norway. From there, recipes and toothsome morsels of cultural and historical information will fill your bellies and your minds, and transport you to countries all around the world.","torrent":{"xt":"urn:btih:36cc147d104de128b8deeaaea8bd6d16e7485250","amp;dn":"International+Night%3A+A+Father+and+Daughter+Cook+Their+Way+Around","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36cc147d104de128b8deeaaea8bd6d16e7485250","infoHashBuffer":{"type":"Buffer","data":[54,204,20,125,16,77,225,40,184,222,234,174,168,189,109,22,231,72,82,80]},"announce":[],"urlList":[]}}