{"title":"Acronis True Image Home 2011-14.0.0 Build 6868 eng_TcT","uid":6625277,"size":165971019,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:377b8ffc75bd5a4e2c3c0bc301f9b4935514f36a&amp;dn=Acronis+True+Image+Home+2011-14.0.0+Build+6868+eng_TcT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigwimpie","files":-1,"time":1314138513,"description":"Acronis True Image Home 2011 14.0.0.6868\n\n\nINFORMATION:\nYour computer can store photos and videos of several generations of your family, important personal documents such as tax returns and a summary of the many applications for individual parameters, the setting where each member of your family spent a few hours. Acronis True Image Home ensures data protection with full recovery of your valuable files in case of computer failure or damage of computer viruses.\nThis is the English version.\n\n- Full copies of data\nIn the Acronis True Image includes patented technology by creating backup images of hard drives. It is possible to backup all data on your computer, including operating system, applications, user settings, and files. This feature allows you within minutes to restore the entire disk contents in case of total or partial loss of data due to virus attack, exit the system or disk failure or other reasons. You do not need to reinstall applications!\n\n- Backing Up\nDocuments, music, videos, photos and e-mail Unlike traditional printed pictures or music CDs, digital media on your computer may be lost when the computer failure. Acronis True Image allows you to avoid their loss.\n\n- Securing Applications\nWith the help of Acronis True Image can restore all settings Microsoft Office, iTunes, Media Player and dozens of other popular applications!\n\n- Sample Try &amp; Decide mode\nInstalling new software and browse the Internet you can now, without worrying for the safety of your computer. At the end of a trial mode, you can either accept all the changes, or return the system to its original state.\n\n- Acronis Drive Cleanser, File Shredder and System Cleanup\nHelp protect confidential information through secure data deletion, purification systems or even complete destruction of all data on your hard drive.\n\nAcronis True Image allows you to perform more complex tasks associated with backing up:\nSupport for 64-bit processors\n- Fast backup of a specific set of files\n- Backing up data by categories\nViewing the contents of the backup\n- Creating rules backup\n- Sending e-mail notifications\n- Backing up to FTP-server\n\nSupported devices:\n- Internal and external hard drives.\n- Networked storage devices.\n- CD-R (W), DVD + R, DVD + RW, DVD-RAM, BD-R (Blu-ray, NEW!).\n- ZIP Jazz and other removable media.\n- P-ATA (IDE), S-ATA, SCSI, IEEE1394 (Firewire), Storage USB 1.0/2.0/3.0 and storage PC card.\n\nSupported file system:\n- FAT16/32, NTFS, Linux Ext2, Ext3, ReiserFS and Linux SWAP.\n- Support for a special regime of sector-by-sector for unknown and corrupted file systems.\n\n[Install notes]\n\nRun installer\nfollow install instruction\ninsert serial when asked\nDone","torrent":{"xt":"urn:btih:377b8ffc75bd5a4e2c3c0bc301f9b4935514f36a","amp;dn":"Acronis+True+Image+Home+2011-14.0.0+Build+6868+eng_TcT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"377b8ffc75bd5a4e2c3c0bc301f9b4935514f36a","infoHashBuffer":{"type":"Buffer","data":[55,123,143,252,117,189,90,78,44,60,11,195,1,249,180,147,85,20,243,106]},"announce":[],"urlList":[]}}