{"title":"The Heat [2013] DVD9 PAL ENG GER FRA TUR Multisubs","uid":9925371,"size":7530414080,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3877e72646daff1af70461d0d62eac82a19ee7d8&amp;dn=The+Heat+%5B2013%5D+DVD9+PAL+ENG+GER+FRA+TUR+Multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1397061884,"description":"audio: english,german,french,turkish\n\n\nsubs: english,german,french,turkish,dutch,arabic,\n\n\n\nThe Heat is a 2013 American buddy cop comedy film written by Katie Dippold and directed by Paul Feig. The plot centers on Sandra Bullock and Melissa McCarthy as FBI Special Agent Sarah Ashburn and Boston Detective Shannon Mullins, who must take down a mobster. The film was released in the United States and Canada on June 28, 2013 to both critical and commercial success.\n\n\nFBI Special Agent Sarah Ashburn is a very skilled and effective investigator, but is despised by her fellow agents for her arrogance and condescending attitude. In Boston, she meets Shannon Mullins, a skilled but foulmouthed and rebellious police officer with the Boston Police Department. Ashburn's by-the-book philosophy clashes with Mullins' rugged and violent style of police work . Ashburn, under pressure from Hale, reluctantly agrees to team up with Mullins.\n\nAshburn and Mullins tail a local nightclub owner and successfully place a bug on his cell phone. As they leave the club, Ashburn and Mullins are confronted by DEA agents Craig and Adam, who have been working the Larkin case for several months and are worried that their case will be compromised. Ashburn and Mullins discover a surveillance video in the DEA agents' van showing Mullins' brother, Jason, apparently connected to Larkin's organisation. Jason was recently released from prison, having been put there by Mullins to keep him off the streets and out of trouble.","torrent":{"xt":"urn:btih:3877e72646daff1af70461d0d62eac82a19ee7d8","amp;dn":"The+Heat+%5B2013%5D+DVD9+PAL+ENG+GER+FRA+TUR+Multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3877e72646daff1af70461d0d62eac82a19ee7d8","infoHashBuffer":{"type":"Buffer","data":[56,119,231,38,70,218,255,26,247,4,97,208,214,46,172,130,161,158,231,216]},"announce":[],"urlList":[]}}