{"title":"The Modern Scholar - Judaism, Christianity and Islam, the Monoth","uid":3376126,"size":302536003,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39370322f333b5923f7627aa3569ade2cefe5d5d&amp;dn=The+Modern+Scholar+-+Judaism%2C+Christianity+and+Islam%2C+the+Monoth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neofop","files":99,"time":1125295851,"description":"Judaism, Christianity, and Islam\nProfessor Frank E. Peters\n(New York University)\n\n\nCourse Syllabus\n\nLecture 1 ?In the Beginning ??\nLecture 2 The Israelite Experience\nLecture 3 From Israelite to Jew\nLecture 4 Jesus of Nazareth: Teacher, Messiah, Redeemer\nLecture 5 The Spread of Christianity\nLecture 6 Muhammad, Prophet of Mecca\nLecture 7 Muhammad, Lord of Medina\nLecture 8 The?People of the Book?: Monotheists and Their Revelations\nLecture 9 Tradition and Law\nLecture 10 Defining the Community\nLecture 11 Governing the Community\nLecture 12 Defending the Community\nLecture 13 Worshiping God\nLecture 14 Reaching for God\n\n\nIn everything that follows, ?Bible? always means the Hebrew or Jewish Bible. The Christian Scriptures will always be called ?New Testament? or ?Gospels.?\n\nJudaism, Christianity and Islam should be thought of as three faith communities rather than as three ?religions.? They are communities of believers, each with its own ideology, history (its ideology is often embedded in its history), its traditions, and, of course, its members, the great number of Jews, Christians and Muslims past and present. We cannot take much account of the members here, but they are the ones who are responsible for a good part of the ideology, history, and traditions.\n\nA distinction is sometimes made between history and sacred history. For all three groups, God is always somehow in charge of what happens to humans, but when God is thought to be more or less directly in charge, that is sacred history. The Bible, for example, is sacred history; what happened to the Jews afterwards is just plain history, where God appears to be (closely) observing events rather than directing them. But not in everyone?s eyes: there are still any number of Jews, Christians and Muslims who regard whatever happens, or will happen, as God?s doing, not man?s.\n\nIf the Arabic term is a little unfamiliar, ?Islam? means ?submission? (to God, of course), and a ?Muslim? is ?one who has submitted.? The words are Arabic but not all Muslims are Arabs by a long shot, and great many Turks and Iranians and millions and millions of Indians and Indonesians will be upset if you insist that they are. Nor are all Arabs Muslims. Many Palestinian Arabs are Christians, for example. Christians too can be anything ethnic under the sun, and what the Jews are will emerge throughout this course.\n\nFinally, it?s easier to study these communities if the student attempts to maintain objectivity about each of the ?others.?\n\n\nBiography:\n\nF. E. Peters is Professor of History, Religion and Middle Eastern Studies at New York University. A native of NYC, he was trained at St. Louis University in Classical Languages (A.B., M.A.) and in Philosophy (Ph.L.), and received his Ph.D. from Princeton in Islamic Studies. His professional interests have since broadened into the comparative study of Judaism, Christianity, Islam, and of Muslim Spain. In addition to his regular teaching duties at NYU (where he has won a number of teaching awards), Peters has been featured on CBS? Sunrise Semester. He has published an autobiography (Ours) and a novel, but his energies have been mostly devoted to academics, with works on Greek philosophy, on the history of Late Antiquity and of Islam, on both Jerusalem and Mecca, on the Muslim pilgrimage, and particularly on the three monotheistic religious communities, Judaism, Christianity and Islam. His most recent book is Islam: A Guide for Jews and Christians (Princeton University Press), and soon to appear is a major two volume work, The Monotheists: Jews, Christians and Muslims in Conflict and Competition, also from Princeton University Press.","torrent":{"xt":"urn:btih:39370322f333b5923f7627aa3569ade2cefe5d5d","amp;dn":"The+Modern+Scholar+-+Judaism%2C+Christianity+and+Islam%2C+the+Monoth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39370322f333b5923f7627aa3569ade2cefe5d5d","infoHashBuffer":{"type":"Buffer","data":[57,55,3,34,243,51,181,146,63,118,39,170,53,105,173,226,206,254,93,93]},"announce":[],"urlList":[]}}