{"title":"Sony PSP 3.03 to 1.50 to Dark Alex Custom FW3.03OE-C","uid":3617794,"size":216488734,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3a1576e88f3d6585849f3f2aa9cdb5685b31e057&amp;dn=Sony+PSP+3.03+to+1.50+to+Dark+Alex+Custom+FW3.03OE-C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dj_chewmacca","files":1,"time":1171410865,"description":"Google Video: http://video.google.co.uk/videoplay?docid=4823000450314464453&amp;hl=en-GB\n\nDescription:\nDark_AleX&amp;#039;s latest 3.03 Open Edition custom firmware. Revision C (3.03 OE-C) packs a lot of changes: \nAVC videos bitrate limit patched. The firmware limited the bitrate of avc videos to only 768 Kbps. OE now forces the limit to be 16384 Kbps. (Note: this doesn&amp;#039;t mean than the psp can handle such a high bitrate; this means than they won&amp;#039;t show error. I don&amp;#039;t know which is the real maximum bitrate than the psp can handle at full speed). \nSpeed of OE boot is now ~3 seconds faster than previous versions. (without plugins). \nCpu speed of XMB can now be changed. \nWifi can now work at 333 Mhz. \nAdded access to flashes 0 and 1 via usb in the recovery menu, based on the great idea of USBSSS by Booster. Note that writing is enabled, so this is intended only for advanced users that know what they are doing in each moment. (It is not a great idea to change anything from the kd folder). Because of this addition, the rest of flashing options were removed. \nPSP isos can now be deleted as any normal memstick games. (also the size of the iso now shows fine when you press triangle-&gt;information). \nWhen formatting memory stick, GAME150, GAME303 and ISO directories will be automatically created. \nChanges in internal HEN core:\nIf a EBOOT.PBP with a plain DATA.PSP had a data.psar, modulemgr took as size of the executable the size of data.psp+data.psar. Fixed. (this fix enables psx games to have plain data.psp without causing a memory error).\nAdded a couple of patches found by Tyranid. One allows syscalls instructions to be used in kernel mode without causing a crash. The other allows sceKernelQueryModuleInfo to work with sceInit and previous modules.\nPOPs: The writing is now a bit different. This avoid &quot;Memory stick blinking too much&quot; bug when using the plugin to load the 3.02 pops. \nPOPs: popstation now lets the use of non-encrypted DATA.PSP. If data.psp is in the same directory as the app, popstation will use that as the DATA.PSP of the eboot.pbp. Otherwise, it will use the one from BASE.PBP. A DATA.PSP that imitates the original sony one is included.\n\nEBOOT.PBP generated with a non encrypted data.psp won&amp;#039;t need the file KEYS.BIN at all.\nUSE AT YOUR OWN RISK!\n","torrent":{"xt":"urn:btih:3a1576e88f3d6585849f3f2aa9cdb5685b31e057","amp;dn":"Sony+PSP+3.03+to+1.50+to+Dark+Alex+Custom+FW3.03OE-C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a1576e88f3d6585849f3f2aa9cdb5685b31e057","infoHashBuffer":{"type":"Buffer","data":[58,21,118,232,143,61,101,133,132,159,63,42,169,205,181,104,91,49,224,87]},"announce":[],"urlList":[]}}