{"title":"Baby Bash - Super Saucy","uid":4630267,"size":38740263,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a7104586aafc739a6479b92ac7c9e3afc8851f9&amp;dn=Baby+Bash+-+Super+Saucy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whawhing","files":16,"time":1231361628,"description":"Encoded with MP3Pro. Small sized, great sound quality.\n\nAcknowledging crunk and guest spots more than last time out, Baby Bash offers a lighter follow-up to the excellent Tha Smokin' Nephew, one that's more fun but less filling. That's cool, because Super Saucy isn't so much a letdown as a party alternative to Nephew with the swaggering Bash sounding perfectly at home with this radio-friendlier material. Before he was basking in the Houston ghetto sun. Now he's basking in the fame and fortune Nephew brought, and you can't blame the guy for sounding &quot;bubbalated.&quot; Slinging the slang is one of the things Bash does best on the album, along with adding some much needed freshness to the tired crooner/rapper combo, otherwise known as the &quot;this one's for the ladies&quot; numbers. Two of them start the album -- &quot;Baby I'm Back&quot; with Akon and the title track with Avant -- but guest shots from Nate Dogg, Paul Wall, and Pitbull bring the album back to the hood, a place where Bash excels and calls on his boy, producer Happy Perez. Perez works his busy, hooked-filled, Texas magic on numerous tracks as he borrows the beats of everyone from Petey Pablo to Pink Floyd to support Bash's winning raps. The album never runs out of ideas, and the energy is high all the way to the final track, a sparkling number that includes Bash but is really just a preview of Houston's next big thing, the Boyz II Men-sounding 3rd Wish. It's the track that really points out the album's thrown-together feel, but with so much well-done good-time music, the crowd-pleasing Super Saucy is worth considering and generally &quot;bubbalicious.&quot;","torrent":{"xt":"urn:btih:3a7104586aafc739a6479b92ac7c9e3afc8851f9","amp;dn":"Baby+Bash+-+Super+Saucy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7104586aafc739a6479b92ac7c9e3afc8851f9","infoHashBuffer":{"type":"Buffer","data":[58,113,4,88,106,175,199,57,166,71,155,146,172,124,158,58,252,136,81,249]},"announce":[],"urlList":[]}}