{"title":"Bad Kids Go To Hell #1-3 [graphic novel] (complete) (CDR)","uid":7858173,"size":61745309,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3ad3182456fe3517a801a0bf8ad5dd0d49f663b6&amp;dn=Bad+Kids+Go+To+Hell+%231-3+%5Bgraphic+novel%5D+%28complete%29+%28CDR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"attilad","files":-1,"time":1353842990,"description":"A construction crew unearths a primal, supernatural force when they break ground for a new, commemorative library for Crestview Academy, a prestigious Midwestern prep-school and home to the spoiled offspring of the city's social elite. Three years later, six of Crestview's richest (and hottest) students are brought together early one Saturday for detention inside the newly completed library. Bored, the kids talk about their school's infamous &quot;dark presence,&quot; and goad one another into a half-hearted seance. However, the joke turns deadly when they rouse an angry spirit, and start to die, one-by-one, in horrible accidents! Yet, as the kids drop like flies, are the murders really the work of an evil phantom, or has one of these six spoiled brats secretly conspired to bring them all together for detention in order to &quot;level&quot; the social playing field and do away with the competition? The Breakfast Club meets The Grudge in this sexy, dark, comedy-thriller mini-series from scribe Matt Spradlin, co-creator of True Believer for the Sci-Fi Channel and visual effects coordinator for X-Men 2 and Beowulf, and hot new comic artist Anthony Vargas!\n\n(from amazon.com)","torrent":{"xt":"urn:btih:3ad3182456fe3517a801a0bf8ad5dd0d49f663b6","amp;dn":"Bad+Kids+Go+To+Hell+%231-3+%5Bgraphic+novel%5D+%28complete%29+%28CDR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad3182456fe3517a801a0bf8ad5dd0d49f663b6","infoHashBuffer":{"type":"Buffer","data":[58,211,24,36,86,254,53,23,168,1,160,191,138,213,221,13,73,246,99,182]},"announce":[],"urlList":[]}}