{"title":"Levon - Old World Secrets - Omega Projecdes (2008)","uid":7967998,"size":1952332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c84db19c70cbc93413ab058a05b52a32c380815&amp;dn=Levon+-+Old+World+Secrets+-+Omega+Projecdes+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1356735414,"description":"This is Brandon Levon's amazing book Old World Secrets - The Omega Project Codes (2008) which sets out to uncover the true history of mankind, where we come from, how we came to be, and where we are going. On his personal quest the author discovered hidden information, information that is so scary, so controversial, you are advised to read with caution. The worldview as you know it is coming to an end and almost everything you know could be a lie, intentionally handed out to be unintentionally handed down from generation to generation as truth, in order to maintain the control of life and death, just as has been done since the dawn of time. Levon reveals many things alot of us interested in this stuff might not have come across before, and shows just how deep the rabbit hole goes.The reality of the world we live in and the truth about those who seek to control this reality is laid bare in this inspired and passionate work. Only those brave enough to put their conditioning aside and dare to think for themselves should read this book - are you brave enough to swallow the red pill? 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:3c84db19c70cbc93413ab058a05b52a32c380815","amp;dn":"Levon+-+Old+World+Secrets+-+Omega+Projecdes+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c84db19c70cbc93413ab058a05b52a32c380815","infoHashBuffer":{"type":"Buffer","data":[60,132,219,25,199,12,188,147,65,58,176,88,160,91,82,163,44,56,8,21]},"announce":[],"urlList":[]}}