{"title":"Why People Cooperate _F1_","uid":6494976,"size":2728603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d06e2f5f9a7b3c736f73ad4c909ec06f8557000&amp;dn=Why+People+Cooperate+_F1_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1309027142,"description":"Tom R. Tyler, &quot;Why People Cooperate: The Role of Social Motivations&quot;\nPr,,eton U..ity Press | 2010 | ISBN: 069114690X | 232 pages | PDF | 2,8 MB\n\nAny organization's success depends upon the voluntary cooperation of its members. But what motivates people to cooperate? In Why People Cooperate, Tom Tyler challenges the decades-old notion that individuals within groups are primarily motivated by their self-interest. Instead, he demonstrates that human behaviors are influenced by shared attitudes, values, and identities that reflect social connections rather than material interests.\n\nTyler examines employee cooperation in work organizations, resident cooperation with legal authorities responsible for social order in neighborhoods, and citizen cooperation with governmental authorities in political communities. He demonstrates that the main factors for achieving cooperation are socially driven, rather than instrumentally based on incentives or sanctions. Because of this, social motivations are critical when authorities attempt to secure voluntary cooperation from group members. Tyler also explains that two related aspects of group practices--the use of fair procedures when exercising authority and the belief by group members that authorities are benevolent and sincere--are crucial to the development of the attitudes, values, and identities that underlie cooperation.\n\nWith widespread implications for the management of organizations, community regulation, and governance, Why People Cooperate illustrates the vital role that voluntary cooperation plays in the long-standing viability of groups.","torrent":{"xt":"urn:btih:3d06e2f5f9a7b3c736f73ad4c909ec06f8557000","amp;dn":"Why+People+Cooperate+_F1_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d06e2f5f9a7b3c736f73ad4c909ec06f8557000","infoHashBuffer":{"type":"Buffer","data":[61,6,226,245,249,167,179,199,54,247,58,212,201,9,236,6,248,85,112,0]},"announce":[],"urlList":[]}}