{"title":"Reality Kings - Money Talks - Volleyball Babes.mp4","uid":8419072,"size":428378445,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3d7c86dffbe6f4f8b933cbd8e5c976957288ecec&amp;dn=Reality+Kings+-+Money+Talks+-+Volleyball+Babes.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Q88.","files":1,"time":1367126357,"description":"Release date: 23/06/2009\n\nRating: 9.1\n\n&quot;Money Talks is back yet again with another action packed episode. Weve always thought chicks with tails are super hot so for our first one we got a doozy. We convinced a girl to put in some anal beads, cut a hole in her jeans, and walk around with the beads hanging out of her butt. The shit is hilarious. Then we asked different people on the street if they would pull them out for a couple of bucks. Of course people said no, one girl gave us a hot titty flash instead, and of course one guy agreed. After that we get you in the mood for some roast beef. We hit the beach looking for a girl willing to walk around with roast beef hanging out her bikini bottom, aka the meat curtains. Then we actually got two other girls to eat it right up. Amazing. For our main event we stay at the beach and find our selves face to face with one of the hottest little volleyball squads youve ever seen. Luck for you they all werent camera shy. The power of the dollar always seems to amaze, because we actually got two of these chicks to come back with us for a little post game workout. Damn these chicks are hot, you dont want to miss this.&quot;","torrent":{"xt":"urn:btih:3d7c86dffbe6f4f8b933cbd8e5c976957288ecec","amp;dn":"Reality+Kings+-+Money+Talks+-+Volleyball+Babes.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d7c86dffbe6f4f8b933cbd8e5c976957288ecec","infoHashBuffer":{"type":"Buffer","data":[61,124,134,223,251,230,244,248,185,51,203,216,229,201,118,149,114,136,236,236]},"announce":[],"urlList":[]}}