{"title":"probelamtik der emotionalen bindung an worte bei georges bataill","uid":6223359,"size":470707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3dc08a81672f1db59eb581ba39a1b6da1310b32a&amp;dn=probelamtik+der+emotionalen+bindung+an+worte+bei+georges+bataill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elizalitty","files":1,"time":1299422321,"description":"Georges Batailles Werk zum ersten Mal zu begegnen ist eine Explosion, die alles zerstÃƒÂ¶rt, was jemals an konstituiertem von der Wissenschaft geprÃƒÂ¤gtem Wissen von dem Geist des Lesers einvernommen wurde. Eine ZerstÃƒÂ¶rung, die alles devastiert, und eine Leere, ein Nichts, ein Unbekanntes gepaart mit einer durchdringenden verzehrenden Wut aus Machtlosigkeit zurÃƒÂ¼cklÃƒÂ¤sst.\n\nIndem Georges Bataille in seinem Werk pionierhafte PrÃƒÂ¤zisionsarbeit bezÃƒÂ¼glich theoretischem, literarischem wie auch poetischem Schaffen geleistet hat, ist es von Vorteil das von ihm gelieferte Werkzeug, - das als Gegenposition zum traditionellem Wissenschaftsbegriff, als Perspektivenwechsel zur SubjektivitÃƒÂ¤t wage umschrieben werden kann-, anzueignen und zu verwenden um im intellektuellen Diskurs scheinbar innovative bisher unausgesprochene Perspektiven aufzuzeigen. \n\nDie somit erworbene Arroganz ist die Basis um jeglichen intellektuellen Diskurs erfolgreich zu enttarnen und zu fÃƒÂ¼hren. Was aber, wenn es einen traditionellen wissenschaftlichen Diskurs ÃƒÂ¼ber Batailles Werk selber zu verfassen gilt? Die Abwechslung von Arroganz und Machtlosigkeit in stetig hÃƒÂ¶heren Frequenzen ebnen die Basis des fast luziden Zustandes, schreiben zu mÃƒÂ¼ssen, trotz der absoluten Gewissheit, wie paradox dies sei, da die Methodik dafÃƒÂ¼r fehlt oder nicht ausreicht. \n\nAber dieser Zwang zu schreiben, charakterisiert wohl das schwindelerregende verwirrungsstiftende zerstÃƒÂ¶rerische Grundelement von Batailles Werk: das Verlangen an die RÃƒÂ¤nder seines MÃƒÂ¶glichen und darÃƒÂ¼ber hinaus zu gehen.","torrent":{"xt":"urn:btih:3dc08a81672f1db59eb581ba39a1b6da1310b32a","amp;dn":"probelamtik+der+emotionalen+bindung+an+worte+bei+georges+bataill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dc08a81672f1db59eb581ba39a1b6da1310b32a","infoHashBuffer":{"type":"Buffer","data":[61,192,138,129,103,47,29,181,158,181,129,186,57,161,182,218,19,16,179,42]},"announce":[],"urlList":[]}}