{"title":"The Future of Ideas: The Fate of the Commons in a Connected Worl","uid":5055487,"size":1306926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3dfcdfc123e2459d09f349d89e73907ca9d1bd2c&amp;dn=The+Future+of+Ideas%3A+The+Fate+of+the+Commons+in+a+Connected+Worl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BookTurd","files":-1,"time":1250387592,"description":"Author: Lawrence Lessig\nPublisher: Vintage\nNumber of Pages: 384\nPublished: 2002-10-22\nISBN-10: 0375726446\nISBN-13: 9780375726446\n &lt;a href=&quot;\nhttp://www.amazon.com/Future-Ideas-Commons-Connected-World/dp/0375726446/ref=sr_1_1?ie=UTF8&amp;qid=1250379725&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Future-Ideas-Commons-Connected-World/dp/0375726446/ref=sr_1_1?ie=UTF8&amp;qid=1250379725&amp;sr=8-1&lt;/a&gt;\n\nBook Description:\n\n\nIf The Future of Ideas is bleak, we have nobody to blame but ourselves. Author Lawrence Lessig, a Stanford law professor and keen observer of emerging technologies, makes a strong case that large corporations are staging an innovation-stifling power grab while we watch idly.\n\n The changes in copyright and other forms of intellectual property protection demanded by the media and software industries have the potential to choke off publicly held material, which Lessig sees as a kind of intellectual commons.\n\n He eloquently and persuasively decries this lopsided control of ideas and suggests practical solutions that consider the rights of both creators and consumers, while acknowledging the serious impact of new technologies on old ways of doing business. His proposals would let existing companies make money without using the tremendous advantages of incumbency to eliminate new killer apps before they can threaten the status quo. Readers who want a fair intellectual marketplace would do well to absorb the lessons in The Future of Ideas.\n\nThe Internet revolution has come. Some say it has gone. In The Future of Ideas, Lawrence Lessig explains how the revolution has produced a counterrevolution of potentially devastating power and effect. Creativity once flourished because the Net protected a commons on which widest range of innovators could experiment. But now, manipulating the law for their own purposes, corporations have established themselves as virtual gatekeepers of the Net while Congress, in the pockets of media magnates, has rewritten copyright and patent laws to stifle creativity and progress.\n\nLessig weaves the history of technology and its relevant laws to make a lucid and accessible case to protect the sanctity of intellectual freedom. He shows how the door to a future of ideas is being shut just as technology is creating extraordinary possibilities that have implications for all of us. Vital, eloquent, judicious and forthright, The Future of Ideas is a call to arms that we can ill afford to ignore.","torrent":{"xt":"urn:btih:3dfcdfc123e2459d09f349d89e73907ca9d1bd2c","amp;dn":"The+Future+of+Ideas%3A+The+Fate+of+the+Commons+in+a+Connected+Worl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfcdfc123e2459d09f349d89e73907ca9d1bd2c","infoHashBuffer":{"type":"Buffer","data":[61,252,223,193,35,226,69,157,9,243,73,216,158,115,144,124,169,209,189,44]},"announce":[],"urlList":[]}}