{"title":"Amory Lovins: We must win the oil endgame","uid":4682752,"size":70700310,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3ec48cfede4c4f1216198c5d8df85547eebf735c&amp;dn=Amory+Lovins%3A+We+must+win+the+oil+endgame&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1233132313,"description":"In this energizing talk, Amory Lovins lays out his simple plan for weaning the US off oil and revitalizing the economy.\n\nAmory Lovins was worried (and writing) about energy long before global warming was making the front -- or even back -- page of newspapers. Since studying at Harvard and Oxford in the 1960s, he's written dozens of books, and initiated ambitious projects -- cofounding the influential, environment-focused Rocky Mountain Institute; prototyping the ultra-efficient Hypercar -- to focus the world's attention on alternative approaches to energy and transportation.\n\nHis critical thinking has driven people around the globe -- from world leaders to the average Joe -- to think differently about energy and its role in some of our biggest problems: climate change, oil dependency, national security, economic health, and depletion of natural resources.\n\nLovins offers solutions as well. His book and site Winning the Oil Endgame shows how all US oil use can be eliminated by 2040. Lovins has always focused on solutions that conserve natural resources while also promoting economic growth; Texas Instruments and Wal-Mart are just two of the mega-corporations he has advised on improving energy efficiency.\n\n    &quot;It was visionary. Every now and then someone wanders into a field and starts talking and has a dramatic impact.&quot;\n\nCary Bullock, chief executive of GreenFuel Technologies Corp. in The Washington Post\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:3ec48cfede4c4f1216198c5d8df85547eebf735c","amp;dn":"Amory+Lovins%3A+We+must+win+the+oil+endgame","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec48cfede4c4f1216198c5d8df85547eebf735c","infoHashBuffer":{"type":"Buffer","data":[62,196,140,254,222,76,79,18,22,25,140,93,141,248,85,71,238,191,115,92]},"announce":[],"urlList":[]}}