{"title":"The Shadow (1994)","uid":3715071,"size":4693940318,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3ed290c49cf8a6e15032dccb10a5d0a9d8162fc9&amp;dn=The+Shadow+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Space48","files":13,"time":1181945543,"description":"Genre: Adventure / Mistery\n\nDirector: Russell Mulcahy\n\nCast: Alec Baldwin, John Lone, Penelope Ann Miller, Peter Boyle, Ian McKellen, Tim Curry, Jonathan Winters, Sab Shimono, Andre Gregory, Brady Tsurutani, James Hong, Arsenio Trinidad, Joseph Maher, John Kapelos, Max Wright.\n\nSynopsis: Alec Baldwin brings the legendary crime-fighting superhero vividly to life in this lavish action-adventure. Pitted against him is Shiwan Khan, last descendent of the great Genghis Khan who conquered half the world. Now, Shiwan Kahn plans to finish the job with a new and better weapon: the atomic bomb. The Shadow, mysterious alter-ego of wealthy New York playboy Lamont Cranston, dons his sweeping black cape and disguise whenever crime surfaces. Besides his ability to &quot;cloud mens minds&quot;, he has his own network of helpful people whose lives hes saved, a romantic involvement with telepathic socialite Margo Lane, and a secret, dark side. However, hes never tangled with anyone like Khan, an enemy whose strength and occult powers match his own. When these two square off, theyre destined for a special battle -with the fate of humanity riding on the result. Combining 30s ambiance and mind blowing 90s special effects, humor, and a dazzling dose of the macabre, The Shadow captures the spirit of the original -and goes light years beyond!\n\nRunTime: 103 min.\n\n\nRippeo: DVD Decrypter, DVD Remake y DVD Rebuilder + CCE (6 pass)\n\n- Reduction Level for DVD-5: 62,4%\n- Overall Bitrate : 5.137Kbs\n- Space for Video : 3.868.378KB\n- HIGH/LOW/TYPICAL Bitrates: 5.207/1.229/5.137 Kbs\n","torrent":{"xt":"urn:btih:3ed290c49cf8a6e15032dccb10a5d0a9d8162fc9","amp;dn":"The+Shadow+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed290c49cf8a6e15032dccb10a5d0a9d8162fc9","infoHashBuffer":{"type":"Buffer","data":[62,210,144,196,156,248,166,225,80,50,220,203,16,165,208,169,216,22,47,201]},"announce":[],"urlList":[]}}