{"title":"Prison Break Seizoen 1 dvd 2van6(nlsubs)2Lions-Team","uid":5272321,"size":4512488051,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f2dbffea6d163c088c169c379bb8acc8ac1557f&amp;dn=Prison+Break+Seizoen+1+dvd+2van6%28nlsubs%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nobby010","files":-1,"time":1263280513,"description":"Prison Break Seizoen 1 dvd 2van6\n\nDutch:\nLincoln Burrows is ter dood veroordeeld na schuldig te zijn bevonden voor de moord op de broer van de vice-president. \nHij blijft volhouden onschuldig te zijn, maar alleen zijn broer Michael gelooft hem. \nMichael onderneemt drastische maatregelen om zijn broer te helpen, \ndaarbij gebruikmakend van het feit dat hij in het verleden als ingenieur betrokken is geweest bij de nieuwbouw \nen verbetering van de gevangenis waar zijn broer zit te wachten op zijn executie: de elektrische stoel. \nZijn kennis laat hij doormiddel van 'inkt' op zijn lichaam verstoppen en nadat hij zichzelf heeft laten arresteren \nkomt hij in dezelfde gevangenis terecht. Terwijl de twee aan hun ontsnapping werken, \nblijkt dat er achter Lincolns' veroordeling een grote samenzwering schuilt. \nTerwijl hun jeugdvriendin en advocate buiten de gevangenis de samenzwering probeert te ontraffelen, \nwerken de twee broers stug door aan hun plan. Ontsnappen zal bijna onmogelijk worden, maar ze doen wat ze kunnen...\n\nEnglish:\nLincoln Burrows is on death row for the murder of the vice president's brother. \nHe insists he's innocent and only his brother Michael Scofield believes him. \nAs an engineer who helped design the prison where Lincoln is being held, \nMichael takes drastic measures to help his brother. \nHe gets himself arrested and sent to the same prison so that with his knowledge of the building \nthe two of them can escape together. However, while inside, \nMichael discovers a massive conspiracy that is determined to see Lincoln's sentence carried out. \nBreaking out will be more difficult than he thought, but he's still going to try\n\nCast : Dominic Purcell, Wentworth Miller, Robert Knepper, Robin Tunney, Amaury Nolasco, Sarah Wayne Callies, \nWade Williams, William Fichtner, Paul Adelstein, Marshall Allman \nRegisseur(s) : Bobby Roth, Fred Gerber \nSchrijver(s) : Paul Scheuring, Seth Hoffman, Zack Estrin \n\n=========================================\n\nSOURCE = Retail dvd9\nVideo = PAL 16/9\nAudio = English 5.1 DD\nSubs = Dutch Vlaams English\nMenu = Yes\nNIETS GERIPT UIT DE DVD?s \nRetail Pal DVD 9 Rebuild Tot DVD 5 in CCE 9 Pass\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0455275/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0455275/&lt;/a&gt;\n\n*****************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n*****************************************\n\nBrought to you by \n\nNobby\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.\n","torrent":{"xt":"urn:btih:3f2dbffea6d163c088c169c379bb8acc8ac1557f","amp;dn":"Prison+Break+Seizoen+1+dvd+2van6%28nlsubs%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f2dbffea6d163c088c169c379bb8acc8ac1557f","infoHashBuffer":{"type":"Buffer","data":[63,45,191,254,166,209,99,192,136,193,105,195,121,187,138,204,138,193,85,127]},"announce":[],"urlList":[]}}