{"title":"TomTom Map of Western and Central Europe 815.2003","uid":4661500,"size":1886920491,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f5ce034e18d5c2523a10075d12984d2ad4cc960&amp;dn=TomTom+Map+of+Western+and+Central+Europe+815.2003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nofences","files":3,"time":1232408992,"description":"This is the latest TomTom maps of Western and Central Europe. Before you ask if it will work with your device, PDA, etc... See the chart below. If you cannot figure out the chart. DO NOT DOWNLOAD as you likely wont figure out the patch tool either. I have included the latest crack to make these maps work on your device. I take no credit for any of the work done on this, I found the maps and info atIf you have questions or difficulties do some research there. I will warn you though, this is an Italian site, and even though it translates to english the syntax is sometimes difficult to understand. \n\n\nI am uploading this here for a more reliable means of download, if you search the site you can find numerous links to other countries maps, including links to the files I am uploading, however they are often hosted byor Megaupload and get removed frequently. The links sometimes only last for a day or two. \n\nDo not ask me for other Maps. Go to the iPmart forum I linked above and search for yourself. \n\nI am on a DSL Line that can only send out at 96k, during the day (PST) I throttle the speed so I can use Vonage reliably, please be patient, the file is very large and will likely take days to finish if people dont stay on to seed once they finish downloading. If you have simple questions, post them and I will answer to the best of my ability, if you need more in depth answers I suggest you register at the link above and ask your questions there. \n\nREMEMBER TO SEED WHEN YOU ARE DONE DOWNLOADING! I can't seed these forever. I f you expect me to upload more stuff, you have to seed what you download so I can stop seeding it and upload something new\n\nChart - http://img511.imageshack.us/img511/3717/mapcompatabilitylistbb2.jpg","torrent":{"xt":"urn:btih:3f5ce034e18d5c2523a10075d12984d2ad4cc960","amp;dn":"TomTom+Map+of+Western+and+Central+Europe+815.2003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5ce034e18d5c2523a10075d12984d2ad4cc960","infoHashBuffer":{"type":"Buffer","data":[63,92,224,52,225,141,92,37,35,161,0,117,209,41,132,210,173,76,201,96]},"announce":[],"urlList":[]}}