{"title":"FS2004 - FSX AI Traffic World of AI pack COMPLETE","uid":5105406,"size":1607294559,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f9c383d60444c734628d150e21347dd4c4ad80e&amp;dn=FS2004+-+FSX+AI+Traffic+World+of+AI+pack+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jay15","files":-1,"time":1254329800,"description":"AI Traffic World of AI pack COMPLETE packages including installer (Complete as of October 1st 2009).\n\nHere are all the freeware WOAI (World of AI) packages (around 500 packages) in one zip. I got tired of downloading a lot of files and put them all together.\n\nI have omitted the few military packages. Please download them yourself.\n\n\nThis is ment to save you time on downloading the bulk of the package.\n\nAlso all the airlines who have EMB-145/135 &amp; ATR42/72 isn't there due to copyright claims. You'll have to install those manually, meaning that some airlines is missing notably FedEx, BMI, Scandinavian, Be and a few others. you can search on WOAI's website to see which are missing.\n\nI have includes the AIM CRJ200 and OSP ATR 72 models in the package for manual install.\n\nPlease understand that these files are freeware and cannot be sold or charged for in any way or form. Additional files and models can be found on Avsim.com or Flightsim.com.\n\nUnzip content of installer package in same folder and run all the zipped airline packs through it. You can select more packs at one time, but if your PC is slow take 10-20 at the time and it will install the models and flightplans on itself.\n\nDo not unzip the WOAI packages prior to install!\n\nIf you want to remove some packages youll find them at:\nC:Program Files|Microsoft Games|Microsoft Flight Simulator X|Scenery|World|Scenery\n\nNOTE: to use these models and repaints with FSX SP1 you must de-activate the 'Aircafts cast shadows' function within FSX. You don't have to do this if you have FSX Acceleration or SP2.\n\nRead more at: world-of-ai.com\n\nWOAI uses the best models avaiable and those are the exact same as Ultimate Traffic 2, except for the shawdows issue in FSX.\n\nMake sure to download the updates from the WOAI website.\n\nPLEASE SEED.\n\n//airdoc October 2009","torrent":{"xt":"urn:btih:3f9c383d60444c734628d150e21347dd4c4ad80e","amp;dn":"FS2004+-+FSX+AI+Traffic+World+of+AI+pack+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f9c383d60444c734628d150e21347dd4c4ad80e","infoHashBuffer":{"type":"Buffer","data":[63,156,56,61,96,68,76,115,70,40,209,80,226,19,71,221,76,74,216,14]},"announce":[],"urlList":[]}}