{"title":"Who's Afraid of Virginia Woolf (1966) Mike Nichols","uid":3456255,"size":734659192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:425557aaef810146d4e13d8dcc0cacb48bd02a3d&amp;dn=Who%5C%27s+Afraid+of+Virginia+Woolf+%281966%29+Mike+Nichols&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jilaiaa","files":5,"time":1142117671,"description":"One literate and profane night in the pathological marriage of two tortured souls, a middle-aged New England professor and his carping wife. Turning the underbelly of bourgeois academia into a microcosm of human relationships in all their arduous complexities, Mike Nichols&amp;#039; auspicious debut feature is a harrowing descent into the private lives and painful secrets of two couples thrown together for an evening. Based on the controversial play by Edward Albee, this noir-ish 1966 drama stars former real-life couple Richard Burton and Elizabeth Taylor (Best Actress Oscar), in what many critics consider to be their best performances. George (Burton) is an associate professor of history who has turned to alcohol to deal with his vituperative, vicious wife Martha (Taylor), whose appetite for administering abuse knows no bounds. Invited to the couple&amp;#039;s home for late-night drinks are new professor Nick (George Segal), and his naive wife Honey (Sandy Dennis-Supporting Actress Oscar), where over the course of the evening, the polished veneer of the hosts tarnishes grotesquely. The witty repartee of consummate sophisticate Martha degenerates into increasingly violent verbal abuse of both her husband and guests, while George&amp;#039;s stoic facade crumbles both physically and emotionally. The horrified Nick and Honey initially come off as happier foils to the misery of the older married couple, but the guests are soon mirroring George and Martha in their mutual antagonism, giving voice to buried resentments and alcohol-fueled revelations of repressed injuries.\n\n","torrent":{"xt":"urn:btih:425557aaef810146d4e13d8dcc0cacb48bd02a3d","amp;dn":"Who%5C%27s+Afraid+of+Virginia+Woolf+%281966%29+Mike+Nichols","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"425557aaef810146d4e13d8dcc0cacb48bd02a3d","infoHashBuffer":{"type":"Buffer","data":[66,85,87,170,239,129,1,70,212,225,61,141,204,12,172,180,139,208,42,61]},"announce":[],"urlList":[]}}