{"title":"Poke That Tranny In The Fanny Vol. 6 XXX 2015 WEB-DL","uid":12237819,"size":6224675435,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:43ed8a947fd5398ba9fbd20d11e948f0aa2ae72e&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+6+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Ctrlme","files":4,"time":1439698085,"description":"Poke That Tranny In The Fanny Vol. 6 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N2V&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2V&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2b&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2b&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2l&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2l&lt;/a&gt;\n\nDescription: Brightly dressed cheerleader Dahlia Diamond opens the next scene practicing her cheers. Christian is watching with a disappointed look, calls up his associate and tells him how lame her act is. Christian tells her they've got to find something she's good at and takes her inside. After making out and some heavy petting, Dahlia blows him and then takes him in doggy style, from behind while laying side by side, on her back, reverse cowgirl, and cowgirl. Christian finishes by dropping a thick load in her mouth. Danika Dreamz Is dressed in pink and jean capris walking up to a home. She rings the doorbell and Christian answers. She is asking him for a few weeks off as babysitter so she can go back home to tend to her dying grandmother. Christian isn't having it and tells her to buck up, tough it out and prove she's worth it. She slowly starts blowing him. Then he goes down on her. Christian fucks her doggy style, from behind while laying side by side, cowgirl, reverse cowgirl and on her back. They 69 a bit and then Danika fucks him while he's on his back. He strokes himself until he comes and then Danika adds to the load. The next scene opens with Spencer Fox hungover laying on the couch half naked with a pom pom stuck up his ass. He tosses it out and then cheerleader Stephanie Tricks walks in to explain that he got a train ran on him by all the girls in the transsexual sorority. After he gathers himself. He starts blowing Stephanie. Then she blows him some and they continue to trade blowjobs for a bit. Spencer titty fucks her some and then fucks her on her back, from behind while side by side, reverse cowgirl, cowgirl, doggy style, and prone. Then he hops on her chest and throat fucks her while she strokes herself until she comes. Spencer follows suit with a cumshot on her belly and tits. Following that is babysitter Foxxy chatting on the phone with a friend. Spencer walks in the bedroom and scares Foxxy because she wasn't expecting anyone in his father's house. After getting warm to each other, Foxxy starts blowing him. He blows her some and eats her out too. They trade blowjobs and then Foxxy hops on him cowgirl. Then Spencer fucks her on her back. She gets up and throat fucks him some more and then he fucks her doggy style. He fucks her from behind while laying side by side a bit and then she hops on him reverse cowgirl. Then she gets off and takes his load on her mouth. Gianna Rivera and Jay Huntington open up the next scene. They're sitting in the car outside of his apartment. Jay takes her inside for some fun. They start making out and strip down. Gianna blows him and then takes him in while she's on her back. Then he fucks her from above while she has her ass propped up on the couch seat. Next she rides him reverse cowgirl, doggy and on her back. He then pulls out and comes on her face and chest. Next scene we see Honey Foxxx in fishnet stockings and heels sitting on the couch. Christian is in a tanning bed chatting on the phone where we learn he's a pimp. He gets out of the bed and chats with Honey a bit and then they start massaging each other. She goes down on him and then he eats her ass and fucks her doggy style. Then they fuck laying side by side. Christian stops to blow her some and then she hops on him reverse cowgirl and cowgirl. Christian goes down on her some more and then Honey fucks him in the ass on his back while he strokes himself. He comes and then Honey follows his lead. An jovial Celeste opens the next scene practicing her cheerleading. A stern Wolf Hudson is coaching her. She injures herself but Wolf helps her inside where we see him massaging her thigh. He rubs a little too far to the right and learns she's trans. Not deterred at all, he goes down on her. Then she blows him some. Wolf eats her out and then she blows him some more. Then Wolf fucks her doggy style, cowgirl, reverse cowgirl, on her side, and on her back. Then he pulls out and sprays all on her mouth and tits. In the last scene we see Angelina Torres taking a drag from a smoke outside. The scene cuts to Smith cruising through and pulling up to her. He picks her up and takes her to his warehouse where he has a bed set up. She blows him in the car and then they get out and Smith eats her ass on the bed. He blows her some and then she goes down on him. Then she pops a condom on him and they fuck doggy, reverse cowgirl, side by side, and on her back. She stops to blow him some more and then hops on him cowgirl. She blows smith again and then he strokes himself while she licks his balls until he comes on her face.\n\nLength: 4:04:59\n\nScene 1: Dahlia Diamond\nScene 2: Danika Dreamz\nScene 3: Stephanie Tricks\nScene 4: Foxxy \nScene 5: Gianna Rivera\nScene 6: Honey Foxxx\nScene 7: Celeste\nScene 8: Angelina Torres\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:43ed8a947fd5398ba9fbd20d11e948f0aa2ae72e","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+6+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ed8a947fd5398ba9fbd20d11e948f0aa2ae72e","infoHashBuffer":{"type":"Buffer","data":[67,237,138,148,127,213,57,139,169,251,210,13,17,233,72,240,170,42,231,46]},"announce":[],"urlList":[]}}