{"title":"Democracy Now - 04 nov 2011","uid":6795261,"size":460288976,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:44af779f49fe928be3fe61a59b3acfe2fac5daaf&amp;dn=Democracy+Now+-+04+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320424730,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 04, 2011\n\n-  Greece Drops Plan For Referendum on Bailout; No Confidence Held Today\n-  IMF, EU to Monitor Italian Economy\n-  16 Arrested at Occupy Wall Street Protest Outside Goldman Sachs\n-  30 D.C. Protesters Occupy Sen. McConnell Office\n-  &quot;Monster&quot; Increase in Carbon Dioxide Level in 2010\n-  Syria Continues Deadly Attack on Homs Despite Peace Deal\n-  Israel to Freeze Funding For UNESCO\n-  Nicaragua and Guatemala to Hold Presidential Elections\n-  Report: 46,000 Parents of U.S.-Born Children Deported in Early 2011\n-  House Democrats Challenge New Voter ID Laws\n-  At Wisconsin Assembly Gallery Concealed Guns OK, But No Cameras, Signs\n\n\nSpecial reports\n\n- Exclusive: Video from Gaza Flotilla as Israeli Navy Prepares to Intercept Boats\n\nTwo Gaza-bound boats carrying pro-Palestinian activists are within 50 nautical miles of their destination, but reports are emerging that Israeli Navy ships have intercepted the &quot;Freedom Waves to Gaza&quot; flotilla. Communication with the boats has largely been cut off. Prior to losing contact, we received two exclusive video reports from aboard the &quot;Tahrir,&quot; the Canadian ship. Speaking to Democracy Now! correspondent Jihan Hafiz last night, passenger Ehab Lotayef said, &quot;We are approaching the 100-nautical-mile point away from Gaza, which is usually the point where Israel declares-starts the blockade ... Will they try to come and board us? All these questions are now at the moment of truth. The major preparation we did is to prepare that we don't want anybody to act in any violent way or in any way that can even induce violence by the Israelis.&quot;\n\n\n- Drones on Trial: 38 Protesters Face Charges For Disrupting Syracuse Base Used in Overseas Attacks\n\nThe Wall Street Journal is reporting the CIA has made a series of secret concessions in its drone campaign after military and diplomatic officials complained large strikes were damaging the fragile U.S. relationship with Pakistan. Meanwhile, a trial is underway in Syracuse, New York, of 38 protesters arrested in April at the New York Air National Guard base at Hancock Field. The defendants were protesting the MQ-9 Reaper drones, which the 174th Fighter Wing of the guard has remotely flown over Afghanistan from Syracuse since late 2009. &quot;Citizens have a responsibility to take action when they see crimes being committed,&quot; said retired Col. Ann Wright, one of the 38 on trial. &quot;And this goes back to WWII, when German government officials knew what other parts of the German government were doing in executing 6 million Jews in Germany and other places. That they took no action, and yet they were held responsible later through the Nuremberg trials. And that is the theory on which we are acting: That we see that our government is committing crimes by the use of these drones and that we, as citizens, have the responsibility to act.&quot;\n\n\n- Debate on Fracking: Was Syracuse Right to Ban the Controversial Natural Gas Drilling Process?\n\nWe're broadcasting live from Syracuse - which recently became the third city in New York state to ban the natural gas drilling process known as hydraulic fracturing or fracking. The Syracuse Common Council voted unanimously last week to ban fracking within city limits. They also voted to limit where wastewater from the fracking process can be stored. Fracking is controversial because it injects millions of gallons of water, sand and chemicals deep into the earth in order to break up shale rock and release natural gas. Many feel this extraction process raises a myriad of human health and environmental issues. Supporters of fracking say it has led to an exponential increase in gas production and has not been harmful to either the environment or human health. To find out more about the issue of fracking, we host a discussion with three guests: Kathleen Joy, Syracuse Common Council Majority Leader, led the city's efforts to ban hydrofracking; Don Siegel, professor of earth sciences at Syracuse University; and Oren Lyons, Faithkeeper with the Council of Chiefs of the Onondaga Nation.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:44af779f49fe928be3fe61a59b3acfe2fac5daaf","amp;dn":"Democracy+Now+-+04+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44af779f49fe928be3fe61a59b3acfe2fac5daaf","infoHashBuffer":{"type":"Buffer","data":[68,175,119,159,73,254,146,139,227,254,97,165,155,58,207,226,250,197,218,175]},"announce":[],"urlList":[]}}