{"title":"Hit and Runway (1999)","uid":7381243,"size":769429258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:45eb55a6e50545fb28201d94c399e4d699841a22&amp;dn=Hit+and+Runway+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1340508278,"description":"Alex Andero feels stuck washing dishes in his family's trattoria in New York City. He wants to write screenplays, and he has a great idea. Trouble is, he's not much with a typewriter; so, when his cousin calls and says a producer likes the idea and wants a script, Alex swallows his homophobia and asks for help from Elliot Springer, a talented writer who's an insecure, gay, Jewish nebbish. Elliot doesn't want the job, but Alex sets him up with Joey, a good-looking actor who works in the cafe. Elliot and Joey are soon getting it on, the script is slowly emerging, and Alex is discovering the beauty of Gwen, a woman in his writing class. Then, ego and greed threaten the partnership.\n\nThis movie has been compared to `Kiss Me Guido' but folks that feel that way are missing the point. This story is about the development of an accepting friendship between a gay man and a straight man without the issue of sexuality. Yes, the straight man starts with the stereotypical panic that the gay man will somehow take advantage of him carnally. But he needs the gay man to help him write a screenplay and as they work together they form a bond as friends. As they collaborate on the screenplay they talk and learn important life lessons from each other. The gay man helps the straight man becomes a more insightful person and with the straight man's encouragement the gay man begins to develop some self-assurance. \n\n\nCAST\n\nMichael Parducci  ...   Alex Andero\n\nPeter Jacobson\t  ... \tElliot Springer\n\nJudy Prescott\t  ... \tGwen Colton\n\nKerr Smith\t  ... \tJoey Worciuekowski\n\nHoyt Richards\t  ... \tJagger Stevens\n\nJohn Fiore\t  ... \tFrank Anderro\n\n\nDirector:  Christopher Livingston\n\nWriters:   Jaffe Cohen, Christopher Livingston","torrent":{"xt":"urn:btih:45eb55a6e50545fb28201d94c399e4d699841a22","amp;dn":"Hit+and+Runway+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45eb55a6e50545fb28201d94c399e4d699841a22","infoHashBuffer":{"type":"Buffer","data":[69,235,85,166,229,5,69,251,40,32,29,148,195,153,228,214,153,132,26,34]},"announce":[],"urlList":[]}}