{"title":"Interceptor (2009)","uid":6720256,"size":734771254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:478f6d9f408aaa349d41991fe4068b9411b9e56d&amp;dn=Interceptor+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"russiacat","files":-1,"time":1317762646,"description":"Interceptor or in its original title Zapreshchennaya realnost was based on the book titled Smersh XXI that was written by Vasiliy Golovachev who also wrote the screenplay for Interceptor. \n\nMoscow 2013, the world is controlled by two forces, the Inner Circle and the darkness. A tough young man named Matvey (Igor Petrenko of Wolfhound (2007)) is betrayed by his former partner, Kurylo (Aleksandr Baluev) in order for Kurylo to take control of the ultimate weapon. Luckily Matvey survives the deadly betrayal and now lives peacefully in the countryside near Lake Baltik. However Kurylo's act of evil is getting out of hand by testing the weapon on civilians, thus forcing the government to persuade Matvey to finish Kurylo. Matvey is so skilled that he's even trusted by the elder of the Inner Circle, Infarkh (Valeriy Gur'ev) as their warrior because the elder also knows that Kurylo is the puppet of Konkere the master of darkness. In the same time a reporter, Kristina (Anna Khodyush) is noticing something bizarre about Kurylo and is being hunted by Kurylo's goons. Furthermore Matvey is not the only one who wants to take Kurylo down, a vigilante squad known as 'Stop Crime' led by Gorshin (Vladimir Vdovichenkov) is intensively fighting Kurylo's secret organization. Could Matvey accomplish his mission? How are these crime fighters fate will intertwine? \n &lt;a href=&quot;\nhttp://www.movielogy.com/reviews/semua/interceptor-zapreshchennaya-realnost.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movielogy.com/reviews/semua/interceptor-zapreshchennaya-realnost.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:478f6d9f408aaa349d41991fe4068b9411b9e56d","amp;dn":"Interceptor+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"478f6d9f408aaa349d41991fe4068b9411b9e56d","infoHashBuffer":{"type":"Buffer","data":[71,143,109,159,64,138,170,52,157,65,153,31,228,6,139,148,17,185,229,109]},"announce":[],"urlList":[]}}