{"title":"Kung Fu Mahjong (Jeuk Sing) : 2 VCD Hard Subbed","uid":4430332,"size":1085545902,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4810e4cb9c7fa3cae4ae5b377a460848c5f7aa14&amp;dn=Kung+Fu+Mahjong+%28Jeuk+Sing%29+%3A+2+VCD+Hard+Subbed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merman5683","files":2,"time":1223251499,"description":"While this film is NOT really all that novel (being inspired by films such as Stephen Chow&amp;#039;s SHAOLIN SOCCER and KUNG FU HUSTLE), it still is a lot of very silly fun. Now I am not talking about sophisticated fun, but a silly and over the top fun--the sort that teenagers and immature adults like me can enjoy. Sure, some of the jokes fall flat or are a bit too stupid, but most work well and you can&amp;#039;t help but laugh throughout the film--it&amp;#039;s just too bad that the film is so similar in spirit to these other film listed above--so it isn&amp;#039;t exactly ground-breaking.\n\nThe film stars several of the same Chinese actors that starred in KUNG FU HUSTLE and this wasn&amp;#039;t a bad thing as they were very funny in both films. I particularly enjoyed the cigarette chomping lady (Auntie Fei)--she was just as endearingly nasty and dangerous in this film as she was in the other. However, viewers who have seen both films might also feel that it&amp;#039;s really just a rehash--as the two films are so, so similar. BUT, if you want lots of this sort of thing, be happy as there are two sequels to KUNG FU MAHJONGG that have so far been released!! I really liked the film but don&amp;#039;t especially feel compelled to see the other two films--a little Mahjongg goes a long way!\n\nBy the way, if you, like most Westerners, know nothing about how to play Mahjongg, it really doesn&amp;#039;t matter. I had no idea what was going on but enjoyed it just the same.\n\nAuthor: planktonrules from Bradenton, Florida \n","torrent":{"xt":"urn:btih:4810e4cb9c7fa3cae4ae5b377a460848c5f7aa14","amp;dn":"Kung+Fu+Mahjong+%28Jeuk+Sing%29+%3A+2+VCD+Hard+Subbed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4810e4cb9c7fa3cae4ae5b377a460848c5f7aa14","infoHashBuffer":{"type":"Buffer","data":[72,16,228,203,156,127,163,202,228,174,91,55,122,70,8,72,197,247,170,20]},"announce":[],"urlList":[]}}