{"title":"Warcraft.2-TDUJAM","uid":4847104,"size":32453508,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4821c4da59d169ef5d294b9985780adebae6e7b8&amp;dn=Warcraft.2-TDUJAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1239727857,"description":"Warcraft II: Tides of Darkness is the sequel to the popular real-time strategy game Warcraft: Orcs &amp; Humans, developed by Blizzard Entertainment and released in December of 1995. Users play as either orcs or humans in a fantasy medieval world full of swords and sorcery.\n\nThe game was originally written for MS-DOS; there was also a Mac OS version of the game. Blizzard also released an expansion pack, developed by Cyberlore Studios, known as Warcraft II: Beyond the Dark Portal on April 30, 1996. Blizzard released Warcraft II: Tides of Darkness for Microsoft Windows, combined with its expansion, in 1999, under the name Warcraft II: Battle.net Edition. Changes made for this release included multiplayer support via Blizzard's online gaming service, Battle.net. There is also a sequel to this, Warcraft III: Reign of Chaos, released in July 2002. The game has a linear single-player campaign for each side, and a multiplayer option via a LAN or the Internet, using existing or user-created maps. According to the README.TXT file included alongside the Warcraft II demo version, the graphics are pre-rendered 3D models.","torrent":{"xt":"urn:btih:4821c4da59d169ef5d294b9985780adebae6e7b8","amp;dn":"Warcraft.2-TDUJAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4821c4da59d169ef5d294b9985780adebae6e7b8","infoHashBuffer":{"type":"Buffer","data":[72,33,196,218,89,209,105,239,93,41,75,153,133,120,10,222,186,230,231,184]},"announce":[],"urlList":[]}}