{"title":"Sexually Broken--Cock suck legend in the making Veruca James  Ma","uid":8866811,"size":1317077442,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:483455aee5a727bd77458d502cf6ec3507afe7b1&amp;dn=Sexually+Broken--Cock+suck+legend+in+the+making+Veruca+James++Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1377939520,"description":"Cock sucking legend in the making Veruca James drilled down and throat pounded by 2 big dicks! | Veruca James | Matt Williams\n\nAugust 30, 2013 \n \n\nMP4 only.\n \n \nFresh faced Veruca James has a secret: She is a cock sucking legend in the making and can suck a dick better then 95% of the porn stars out there today. You just can't challenge this girl with cock. She takes everything you throw and her and asks for more. She CRAVES having the back of her throat turned into a pussy.\n\nYou can't spend years practicing and refining the art of an utterly committed, no holds barred blow job and not be properly rewarded when you finally quit your day job for porn and end up gracing the Sexuallybroken stage. We bring 2 dicks to the table today, and they are going to do their best to turn our sexy ex-accountant into a Chinese finger trap. For as long as we have her, Veruca will have something drilling her from both ends. We start off with our lean, pale throat hole tied down on her knees in front our our well used bed. The plan is simplicity itself: Mouth, meet dick. Now get properly acquainted you two.\n\nOne after another, both dicks own Veruca's face pussy. It is a furious onslaught of dick that would have most girls begging for mercy and air. Not Veruca. She is on top of it the whole time, using that thick back of the throat spit as lube to further the face fucking. Not even Jack Hammer's mighty dick gets her to pause for long. This is someone born to suck dick. It is time to up our game. \n\nVeruca is tossed onto our bed and promptly finger trapped. Both ends of her are stuffed to the brim with dick. Bound and helpless, all she can do is lie there and endure as the cocks attempt to shake hands inside of her. While rag doll fucking her is fun enough, we really want to drive home the point that she is nothing but a bag of holes for our use, and we shove her head between the iron bar railings of the bed and tie her into place. There is no way for her to escape, each pound of the dick sends her slamming into the railings and every millimeter of her holes are throughly owned. Her eyes roll back into her head when we add the vibrator to the mix and she grasps the true meaning of &quot;forced orgasm&quot;. It looks like the vibrator is able to do what throat boarding could not, and we leave our spent fuckdoll tied to the bed, head hanging down limply with a vacant look across her face... \n \nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_30vjames2/SexuallyBroken-Veruca-James-Matt-Williams-Cock-sucking-legend-in-the-making-Veruca-James-drilled-down-and-throat-pounded-by-2-big-dicks.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_30vjames2/SexuallyBroken-Veruca-James-Matt-Williams-Cock-sucking-legend-in-the-making-Veruca-James-drilled-down-and-throat-pounded-by-2-big-dicks.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:483455aee5a727bd77458d502cf6ec3507afe7b1","amp;dn":"Sexually+Broken--Cock+suck+legend+in+the+making+Veruca+James++Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"483455aee5a727bd77458d502cf6ec3507afe7b1","infoHashBuffer":{"type":"Buffer","data":[72,52,85,174,229,167,39,189,119,69,141,80,44,246,236,53,7,175,231,177]},"announce":[],"urlList":[]}}