{"title":"Pulp Fiction Art (2001) documentary","uid":7803133,"size":498903763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4aca6662b7bff6993e4b763ea2adf2b4d033fa4a&amp;dn=Pulp+Fiction+Art+%282001%29+documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":2,"time":1352330935,"description":"Pulp Fiction Art :  Cheap Thrills and Painted Nightmares (2001)\nDocumentary\n\nruntime 57 minutes\n\nFrom IMDb.\n\nAn intimate look at the extraordinary, often ostracized, and now largely forgotten artwork of Pulp Fiction Magazines. For the first time in a documentary film, we take a look at the world of pulp fiction with exclusive images, and interviews with some of the very artists who created these amazing popular culture masterpieces. Written by JEM \n\n--\n\nMy notes\n\n  The release date of the documentary is 2001.  The release date at IMDb is shown as 2005 and my library acquired it in 2010.\n\n   The images here are thrilling-- really so.  The pulp art form is not that of the cartoon and they make special attention that pulp art illustration was not the same as that found in the dime novel either.\n\n   There is much to enjoy in this film.  Much of this style was destroyed as trash and that is fully explored in the film.  But here are the remaining images.  One collector in the film states that so much of the pulp art was lost that it's akin to the burning of the Library at Alexandria.  Only one tenth of this 20th century art survives.\n\n  Featured in the film is Robert Lesser.  His book Pulp Fiction Art should be in libraries along with the dvd.  I could make this torrent available because the dvd was in the local public library.\n\n Elsewhere on the net and in documentaries can be found other films on the great illustrators.  Seek out &quot;Painting With Fire&quot;  on the life of Frank Frazetta.  Finding that film in torrents was my first exposure to it.  And for this reason, when I found this piece on pulp fiction art, I put it up for others to enjoy.\n\nNotes written  October 8, 2012\n\nNew torrent November 7, 2012","torrent":{"xt":"urn:btih:4aca6662b7bff6993e4b763ea2adf2b4d033fa4a","amp;dn":"Pulp+Fiction+Art+%282001%29+documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aca6662b7bff6993e4b763ea2adf2b4d033fa4a","infoHashBuffer":{"type":"Buffer","data":[74,202,102,98,183,191,246,153,62,75,118,62,162,173,242,180,208,51,250,74]},"announce":[],"urlList":[]}}