{"title":"The Ancient X Files - The Blood of Christ  and The Phaistos","uid":6061057,"size":734244864,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4b355e921ff63e3bd515560a205ab96e7fcd7faa&amp;dn=The+Ancient+X+Files+-+The+Blood+of+Christ++and+The+Phaistos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucy1948","files":1,"time":1293126548,"description":"Ancient X Files travels around the world to solve some intriguing riddles. Each story is a piece of detective work by an expert trying to make sense of some puzzling ancient artefact, to find the truth behind some extraordinary legend, to discover the origins of a bizarre myth or to establish the authenticity of a venerated religious relic. This series explores the bits of archaeology and history which seem to defy explanation.\n\nOur experts are following chains of clues and putting theories to the test, in an effort to explain the unexplained. Ancient X Files investigates claims about the whereabouts of the lost Ark of the Covenant; attempts to establish the authenticity of a cup some believe to be the Holy Grail; tries to de-code the mysterious Phaistos disk; investigates a cloth which is believed to carry traces of the DNA of Jesus Christ; and deciphers an encrypted book of alchemy written by the great Sir Isaac Newton.\n\n\n2) The Blood of Christ the Phaistos\nLess famous then the Shroud of Turin could the Shroud of Oviedo actually be Christ's burial cloth? NGC traces the blood-stained relic to Israel in a quest to determine whether it holds Christ's DNA, and in a most chilling discovery finds that it contains no evidence of a father's DNA. Later, a linguistic code cracker attempts to solve the riddle of one of the most mysterious ancient objects - the Phaistos Disk. The Phaistos Disk is a curious archaeological find, most likely dating from about 1700 BC. Its purpose and meaning, and even its original geographical place of manufacture, remain disputed, making it one of the most famous mysteries of archaeology. The Phaistos Disk was discovered in the basement of room XL-101 of the Minoan site of Phaistos. The site is near Hagia Triada on the south coast of Crete. Italian archaeologist Luigi Pernier recovered this remarkably intact dish about 15 cm. in diameter and uniformly just over 1 cm. thick, on July 3, 1908.\n\n\nEnjoy and Seed!!\t","torrent":{"xt":"urn:btih:4b355e921ff63e3bd515560a205ab96e7fcd7faa","amp;dn":"The+Ancient+X+Files+-+The+Blood+of+Christ++and+The+Phaistos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b355e921ff63e3bd515560a205ab96e7fcd7faa","infoHashBuffer":{"type":"Buffer","data":[75,53,94,146,31,246,62,59,213,21,86,10,32,90,185,110,127,205,127,170]},"announce":[],"urlList":[]}}