{"title":"PC Ã‚Â» SUPERSTARS V8 RACING Full Game directplay by globe@","uid":5390850,"size":569398691,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4d67b07675476b85b4305dfcd5c20d07c646607f&amp;dn=PC+%C3%82%C2%BB+SUPERSTARS+V8+RACING+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1267055262,"description":"* Hello PC games fans ...\n\n\n* Play this nice car racing game ...\n\n\n* MULTI 5\n\n\n* Great work with fantastic compression , after the extraction of the arc the game have more than 1.5 gb\n\n\n* This file need the freeware FREEARC installed to help with the extraction of the arc file\n\n\n\nEnter the SuperStars European Championship and drive the top-class series cars V8 engine around Europe's challenging tracks in your quest for the title.\n\nSuperStar V8 Racing puts you in a realistic recreation of championship V8 racing and unleashes all the excitement and speed of the competition. You're in the paddock . . . you're in the pit lane and you're in the race. With SuperStar V8 Racing, you're one of the team!\nDrive top-class V8 racing cars from 8 of the greatest manufacturers\nExperience an interactive 3D environment which accurately recreate real-life environments\n\nRace with and against the official teams and riders on competition tracks, Choose from 22 of the world top drivers, Extend your gameplay with realistic customisable settings levels and different game modes\nLearn how a racing car works as you fine-tune your car setting parameters \n\n\nTracks\nThis is the first game to feature racing at Varano and the first to feature car racing at Portimao and Magione. Adria International Raceway is featured for the first time since 2002's TOCA Race Driver 2. The majority of the circuits are Italian (the others are Vallelunga, Mugello, Monza, and Misano) and the championship also features Circuit de Valencia and Kyalami.\n\nMinimum Requirements:\n\nOperating System: Windows XP SP2 or Windows Vista with DirectX 9.0c\nProcessor: Intel 2.4Ghz or similar\nHard disk space: 7 GB\nRAM: 1GB\nVideo Card: NVIDIA Geforce 6600 or ATI X1600 or higher (it must be able to manage Pixel Shader 3.0)\n\n\n\n\n                            ***** enjoy ... *****","torrent":{"xt":"urn:btih:4d67b07675476b85b4305dfcd5c20d07c646607f","amp;dn":"PC+%C3%82%C2%BB+SUPERSTARS+V8+RACING+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d67b07675476b85b4305dfcd5c20d07c646607f","infoHashBuffer":{"type":"Buffer","data":[77,103,176,118,117,71,107,133,180,48,93,252,213,194,13,7,198,70,96,127]},"announce":[],"urlList":[]}}