{"title":"Shock Wave_CBC Doc Zone_HDTV_XviD~Ekolb","uid":4754946,"size":734483737,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4e7ba4e5403d6844f8aa0ac6020f97a455bd8cdb&amp;dn=Shock+Wave_CBC+Doc+Zone_HDTV_XviD%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ekolb","files":3,"time":1236402867,"description":"Shock Wave\nAired:Thursday March 5, 2009 at 8 pm on CBC-TV\n\nEarthquakes, like the one that caused the Indian Ocean disaster of December 26, 2004, tend to repeat themselves. The waves they generate can circle the globe with devastating consequences. Recently, scientists discovered that the Cascadia Subduction Zone off the west coast of North America has ruptured at least 37 times in the past 10,000 years and it will rupture again...but when?\n\nThe crack in the ocean floor from Cape Mendocino, California to central Vancouver Island is nearly identical to the subduction zone that ruptured off Sumatra, which led to the tsunami that killed approximately 230,000 people. The Pacific Northwest can expect a nearly identical earthquake. Five major cities (Vancouver, Victoria, Seattle, Portland and Sacramento) plus hundreds of small towns along a thousand kilometres of coastline will be heavily damaged. The first tsunami waves will hit the beach twenty minutes later.\n\nBut Shock Wave is not just another &quot;doomsday flick.&quot; It's the story of people on the front lines of science, engineering and emergency planning who, along with thousands of volunteers, are finding ways to help our communities survive the next rupture.\n\nInundation zones and tsunami evacuation routes have been posted in Seaside, Oregon for several years, but they were based on an earlier generation of computer modelling. Given what scientists learned from Sumatra, are the numerical codes still valid? The people of Ucluelet, British Columbia are coming to grips with news that their town will be one of the first points of contact when Cascadia's wave hits Canada. \n\nThe good news is that because of Sumatra, oceanographers, geologists and computer modellers have gained an enormous amount of new information about how tsunamis work. They're crunching data at a feverish pace trying to re-calibrate the math so that computers can issue real-time forecasts of when and where a tsunami will hit - and how high the water will reach.\n\nJoin emergency planners from Seaside and Ucluelet at public &quot;outreach&quot; meetings as they try to spread the word - without causing panic. What is the best way to warn people of a tsunami? How do people process and respond to &quot;natural&quot; and &quot;official&quot; warnings? How do thousands of tourists who don't know the lay of the local landscape figure out where to go and what to do? How do you notify people in the middle of the night when television sets and radios are turned off and beach sirens are too far away to hear? \n\nYes, the earthquake is inevitable. Yes, it will be horrible. But most of us will survive. When will Cascadia's fault rupture again? Gamblers can only speculate as scientists prepare us for the inevitable. Shock Wave takes you behind the scenes as scientists apply what they've learned from Sumatra to create new disaster survival plans for western North America.\n\nDirected by Jerry Thompson for Omni Films in association with CBC-TV.\n\nFormat            : AVI\nLength            : 700 MiB for 1h 29mn 4s 680ms\nCodec             : XviD\nSource            : HDTV\n\nVideo #0          : MPEG-4 Visual at 977 Kbps\nAspect            : 608 x 352 (1.727) at 23.976 fps\n\nAudio #0          : MPEG Audio at 110 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:4e7ba4e5403d6844f8aa0ac6020f97a455bd8cdb","amp;dn":"Shock+Wave_CBC+Doc+Zone_HDTV_XviD%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7ba4e5403d6844f8aa0ac6020f97a455bd8cdb","infoHashBuffer":{"type":"Buffer","data":[78,123,164,229,64,61,104,68,248,170,10,198,2,15,151,164,85,189,140,219]},"announce":[],"urlList":[]}}