{"title":"The Best Bits Of The Late Show","uid":11703036,"size":9242250564,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4eb84afa505f2007a678a45f7658d292d5a5b91b&amp;dn=The+Best+Bits+Of+The+Late+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"MoofieMan","files":4,"time":1423997160,"description":"The Late Show was a popular Australian comedy show, which ran for two seasons on ABC-TV from 18 July 1992 to 30 October 1993.\n\nThe Late Show has its roots in the 1980s comedy group, The D-Generation. Consisting mostly of Melbourne University students, The D-Generation managed to gain a cult following with their radio and TV appearances.\n\nAfter the breakup of the original 'D-Generation', some of the members went on to perform on the commercial TV programme Fast Forward. The remaining members filmed several pilots for what was to be called The Late Late Show at Channel Nine. These were rejected, and so the group accepted the ABC's offer of a one-hour timeslot on Saturday night. The cast members were: Santo Cilauro, Tom Gleisner, Jane Kennedy, Judith Lucy (second season only), Tony Martin, Mick Molloy, Rob Sitch and Jason Stephens.\n\nHighlights of the show (and regular popular sketches) were The Late Show Headlines, Street Talk, Shitscared, Bargearse, Pissweak World, Charlie The Wonderdog (and The Pissweak Kids), Graham And The Colonel, The Oz Brothers, The Olden Days and Shirty The Slightly Aggressive Bear, most of which feature in this corker of a compilation. In addition, there are numerous hilarious sketches and ad-libs performed by these very talented, funny and creative comedians.\n\nThe video is x264 @ 3000 kbps with a resolution of 720x576 (as it was recorded for 4:3 televisions before 16:9 became dominant). So, the vision looks as good as the original DVD's. I remastered the audio to level it up, then amplified it to -2dB to ensure good solid sound playback on all devices. Audio is captured @ 448 kbps (AC3). The container is MP4.\n\nThese are very high quality, all digital reproductions of The Best Bits Of The Late Show. Whether you're an Aussie or not, I reckon you'll love this stuff, get a laugh and remember how politically incorrect the world used to be. Enjoy!\n\nCheers,\nMoofieMan.\n\nP.S. Thanks to Wikipedia for the historical information","torrent":{"xt":"urn:btih:4eb84afa505f2007a678a45f7658d292d5a5b91b","amp;dn":"The+Best+Bits+Of+The+Late+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eb84afa505f2007a678a45f7658d292d5a5b91b","infoHashBuffer":{"type":"Buffer","data":[78,184,74,250,80,95,32,7,166,120,164,95,118,88,210,146,213,165,185,27]},"announce":[],"urlList":[]}}