{"title":"Android.NDK.Beginners.Guide.pdf","uid":8857087,"size":9027042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fb1017c7858aca3872757526f300eb51ba84cf6&amp;dn=Android.NDK.Beginners.Guide.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"poohtbear","files":1,"time":1377687750,"description":"\n\nndroid NDK is all about injecting high performance into your apps. Exploit the maximum power of these mobile devices using high-performance and portable code.\n\nThis book will show you how to create C/C++ enabled applications and integrate them with Java. You will learn how to access native API and port libraries used in some of the most successful Android applications.\n\nUsing this practical step-by-step tutorial, highlighted with comments and tricks, discover how to run C/C++ code embedded in a Java application or in a standalone application. You will create a real native application starting from project creation through to full implementation of native API and the porting of existing third-party libraries. You will discover OpenGL ES and OpenSL ES, which are becoming the new standard in mobility. You will also understand how to access keyboard and input peripherals and how to read accelerometer or orientation sensors. Finally, you will dive into more advanced topics such as debugging and troubleshooting applications. By the end of the book, you should know the key elements to enable you to start exploiting the power and portability of native code.\n","torrent":{"xt":"urn:btih:4fb1017c7858aca3872757526f300eb51ba84cf6","amp;dn":"Android.NDK.Beginners.Guide.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fb1017c7858aca3872757526f300eb51ba84cf6","infoHashBuffer":{"type":"Buffer","data":[79,177,1,124,120,88,172,163,135,39,87,82,111,48,14,181,27,168,76,246]},"announce":[],"urlList":[]}}