{"title":"[NubileFilms] Iwia, Lorena (Two Queens / 05.15.2014)","uid":10159101,"size":1142684975,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4fe3421da1c0fd9b4f573b2c6d3bc29edb73f605&amp;dn=%5BNubileFilms%5D+Iwia%2C+Lorena+%28Two+Queens+%2F+05.15.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":1,"time":1400221826,"description":"[NubileFilms] Iwia, Lorena (Two Queens / 05.15.2014)\nres:1080p\n\nThe lovely sensual Lorena happens upon her girlfriend Iwia engrossed in a book, and instead of leaving her woman in peace Lorena decides to see if Iwia might be interested in something a little more sensual than reading.\n\nAfter a few sweet soft kisses, Lorena works her way down Iwia's body with soft touches of her lips as she slowly peels off her lover's panties. Now that she has uncovered the soft wet object of her interest, Lorena doesn't waste any time burying her face in Iwia's landing strip pussy and using quick skillful flicks of her tongue to get Iwia's heart racing.\n\nAfter a few luscious moments, Lorena climbs up her woman's body to resume making out as they each reach down to rub each other's needy wet twats. Even through her thong, Lorena loves the feel of Iwia's fingers running up and down her slit.\n\nWanting to give her lover more, Iwia helps Lorena down onto her hands and knees so that she can pull down her lady's thong and go to town burying her tongue in Lorena's exposed fuck hole. Unable to contain her moans of delight or her undulating hips, Lorena closes her eyes in pleasure and enjoys the ride until her gasps of completion fill the room.\n\nThe girls change places so that Iwia can enjoy the full feature pussy licking that Lorena hinted at previously. Feeling nice and relaxed from her recent orgasm, Lorena is all about her lover's pleasure as she works her clever tongue up and down Iwia's slick slit and concentrates on her tight clit.\n\nAs Iwia's pussy juices start to flow, Lorena takes advantage by pushing a finger deep into the tight softness of her sheath. Soon she slides a second finger in and then commences a hard pussy pounding where she thrusts with one hand and rubs her lover's clit with the other. Such intense attention quickly brings Iwia to a body-shaking climax.\n\nLorena, sex-hungry coed that she is, isn't satisfied with a single orgasm! Retaking her place on the chair, Lorena spreads her legs so that Iwia can go back to work with her magical tongue and drive her woman back over the edge of ecstasy. Using her soft wet mouth and then her stiff fingers, Iwia finally achieves her sensual goal, much to Lorena's delight.\n\nAs the two girls come down from their orgasmic highs, they enjoy cuddling together while exchanging sweet kisses that gradually bring their lovemaking to an end.\n\nScreens; &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=pa2yjdv2gcorh9gz8lvh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=pa2yjdv2gcorh9gz8lvh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=kz0fn3679dw5p6nye8ag.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=kz0fn3679dw5p6nye8ag.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:4fe3421da1c0fd9b4f573b2c6d3bc29edb73f605","amp;dn":"%5BNubileFilms%5D+Iwia%2C+Lorena+%28Two+Queens+%2F+05.15.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe3421da1c0fd9b4f573b2c6d3bc29edb73f605","infoHashBuffer":{"type":"Buffer","data":[79,227,66,29,161,192,253,155,79,87,59,44,109,59,194,158,219,115,246,5]},"announce":[],"urlList":[]}}