{"title":"Avira Internet Security 2012 Incl. License","uid":6721278,"size":82743362,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4fee22b52b0fd7ef02311394fc267f526737bea1&amp;dn=Avira+Internet+Security+2012+Incl.+License&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djjlicious","files":-1,"time":1317802235,"description":"Avira Internet Security 2012   \n\nGet Avira Internet Security 2012, then relax. Your computer and your privacy are in the best of hands. Choose Avira Internet Security 2012 if you: -Regularly look up information on the web; -Access your bank accounts or investments online; -Shop in online stores or place bids at auction sites; -Make online phone calls, instant message or social network; -Use public wifi networks; -Share your computer with your partner or family members; -Store your irreplaceable photos, music and videos on your PC; -Are concerned about what your children might see and do online.;\n\nAdvantages: Detection: -System Scanner detects the latest known viruses, worms and Trojans fast. -AntiSpam filters out unwanted and phishing emails. -AntiBot blocks hackers' attempts to take over your computer. -AntiPhishing protects you against identity theft attacks. -AntiAd/Spyware shuts out online spies and annoying pop-ups. -Rootkit Protection keeps you safe from hidden malware that conventional antivirus can't find. Prevention: -Real-Time Protection prevents infection from viruses, worms and Trojans. -FireWall adds an extra layer of defense against intrusions. -ProActive halts undiscovered threats by tracking their behavior. -AHeAD Technology inspects unfamiliar code for suspicious signs. -Web Protection stops you from landing on malicious websites. -AntiDrive-by blocks unwanted software downloads while you surf. -Mail Protection keeps infected emails at a safe distance from your inbox. Repair: -Quick Removal eliminates viruses in one click. -Generic Repair removes all traces of infection automatically. -Backup System lets you recover your data in case of an accident, infection or theft. -Rescue System jumpstarts your PC in an emergency. Extra benefits: -Express Installation configures perfectly tuned security in a few clicks. -Netbook Support works fast on low resolution, low memory laptops -Live Support provides interactive help from an Avira expert. -Game Mode suspends unnecessary alerts during games and movies. -Child Protection makes it easy to monitor your children's internet use\n\nRead the ReadMe file and enjoy!\n\n","torrent":{"xt":"urn:btih:4fee22b52b0fd7ef02311394fc267f526737bea1","amp;dn":"Avira+Internet+Security+2012+Incl.+License","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fee22b52b0fd7ef02311394fc267f526737bea1","infoHashBuffer":{"type":"Buffer","data":[79,238,34,181,43,15,215,239,2,49,19,148,252,38,127,82,103,55,190,161]},"announce":[],"urlList":[]}}