{"title":"History Of The Waldenses - J.A. Wylie","uid":11773435,"size":7055473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:503f9e38a48e43c090bf404b530fad44d4ea92ea&amp;dn=History+Of+The+Waldenses+-+J.A.+Wylie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168022,"description":"\nThis work?which is a reprint of the Sixteenth Book of the HISTORY OF PROTESTANTISM?is exclusively occupied with the subject of the Waldenses. It describes succinctly the conflicts they waged and the martyrdoms they endured in defence of their faith and their liberty, and is published in the present form to meet the requirements of those who take a special interest in this remarkable people.\n\nRecent events in Europe have brought the Waldenses into prominence, and thrown a new light upon the grandeur of their struggle and the important and enduring issues which have flowed from it. To them, in a very particular manner, are we to trace the constitutional liberties which Italy at this hour enjoys. In the eventful year of 1848, when a new constitution was being framed for Piedmont, the Waldenses made it plain to the Government that there would not be standing-room for them within the lines of that constitution, unless it embraced the great principle of freedom of conscience. For that principle they had contended during five hundred years, and nothing short of it could they accept as a basis of national settlement, persuaded that any other guarantee of their liberties would be illusory. Their demand was conceded: the principle of freedom of conscience?the root of all liberty?was embodied in the new constitution, and thus the whole inhabitants of Piedmont shared equally with the Waldenses in a boon which the struggles of the latter had been mainly instrumental in securing.\n\nNot only so: in process of time the constitution of Piedmont was extended to the rest of Italy, and the whole Italian nation is at this hour sharing in the fruits which have sprung from the toil and the blood, the unswerving faith, and the heroic devotion of the Waldenses. Nor is their work finished even yet. They have understood the end for which they have been preserved through so many ages of darkness and conflict, and have energetically thrown themselves into the evangelisation of modern Italy, and doubtless these ancient confessors are destined to win, in the land where they endured so many dark sorrows, not a few brilliant triumphs, and by the labours of the present to add to the obligations which Christendom owes them for the services of the past.\n-J. A. Wylie.\n\n\nAbout the author:\nJames Aitken Wylie (1808-1890) was a Scottish historian of religion and Presbyterian minister. He was a prolific writer and is most famous for writing The History of Protestantism.\n\nWylie was educated at Marischal College, University of Aberdeen where he stayed for three years before studying at St. Andrews under Thomas Chalmers. He followed his father's example, entering the Original Secession Divinity Hall, Edinburgh in 1827, and was ordained in 1831.\n\nHe became sub-editor of the Edinburgh Witness in 1846. In 1852, after joining the Free Church of Scotland, Wylie edited their Free Church Record until 1860.\n\nHe published his book The Papacy: its History, Dogmas, Genius, and Prospects in 1851, winning a prize of a hundred guineas from the Evangelical Alliance. The Protestant Institute appointed him Lecturer on Popery in 1860. He continued in this role until his death in 1890, publishing in 1888 his work The Papacy is the Antichrist. He died with his History of the Scottish Nation taken forward to 1286.\n\nAberdeen University awarded him an honorary doctorate (LL.D.) in 1856.\n\nHe died on 1 May 1890 and is buried with his wife, Euphemia Gray (1808-1845) and their children, in East Preston Street Burial Ground, Edinburgh in the eastern part of the south-east section","torrent":{"xt":"urn:btih:503f9e38a48e43c090bf404b530fad44d4ea92ea","amp;dn":"History+Of+The+Waldenses+-+J.A.+Wylie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"503f9e38a48e43c090bf404b530fad44d4ea92ea","infoHashBuffer":{"type":"Buffer","data":[80,63,158,56,164,142,67,192,144,191,64,75,83,15,173,68,212,234,146,234]},"announce":[],"urlList":[]}}