{"title":"Community College Hero: Trial by Fire","uid":12922108,"size":34850874,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5294241c06059a38607987612f353fb3c10c3881&amp;dn=Community+College+Hero%3A+Trial+by+Fire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1449427179,"description":"Outwit your professors at superpower school! Ace your exams, date your classmates, and bring down the nation’s most wanted villains to earn your degree.\r\n\r\n&quot;Community College Hero: Trial by Fire&quot; is a thrilling 168,000-word interactive novel by Eric Moser, where your choices control the story. It's entirely text-based--without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.\r\n\r\nYou’ve won a scholarship to the nation’s newest college course for heroes! But can you discover your classmates’ secret identities before they learn yours? Choose your costume and your mask (and maybe your date for this weekend) and get ready to fight crime and dazzle the citizenry! Be an acrobat, sharpshooter, detective, or soldier, with all the abilities that come with each. Wield brass knuckles, a slingshot, or even retractable roller skates in your shoes. Will you investigate the big bad, or wait until you’ve had more training? Escape liability for damaging other people’s property as you learn to control your new powers, or pay up what you owe?\r\n\r\nWill you be a brooder, charmer, traditionalist, or trickster? Step into your new super identity, and claim your place as a Community College Hero!","torrent":{"xt":"urn:btih:5294241c06059a38607987612f353fb3c10c3881","amp;dn":"Community+College+Hero%3A+Trial+by+Fire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5294241c06059a38607987612f353fb3c10c3881","infoHashBuffer":{"type":"Buffer","data":[82,148,36,28,6,5,154,56,96,121,135,97,47,53,63,179,193,12,56,129]},"announce":[],"urlList":[]}}