{"title":"Risen [MULTI5][XBOX360][Region Free][gamerguuy]","uid":5103869,"size":7157146030,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:53189c1393cddc96bb5bb342c2b5d8c64aad969f&amp;dn=Risen+%5BMULTI5%5D%5BXBOX360%5D%5BRegion+Free%5D%5Bgamerguuy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gamerguuy","files":-1,"time":1254219739,"description":"Category: XBOX360\nLanguage: EspaÃƒÂ±ol,English,French,Italian,German\nType:RPG\nFormat: ISO\nSize: 6.67 GB\nDate: 29-09-2009\n\nPiranha Bytes introduce en Risen una nueva y refrescante ambientaciÃƒÂ³n: el barco del protagonista del juego se ha hundido tras una tormenta y ÃƒÂ©ste termina en una misteriosa isla. Un volcÃƒÂ¡n en erupciÃƒÂ³n preside la escena, las ruinas de un templo milenario acaban de surgir del suelo y la isla estÃƒÂ¡ infestada de extraÃƒÂ±as criaturas.\nEn Risen, el equipo nos presenta un nuevo escenario con una gran variedad de aventuras que mantendrÃƒÂ¡n como siempre al jugador pegado a la pantalla.\n\nRisen es un ÃƒÂ©pico juego de rol, con una interfaz de juego intuitiva y controlada por el jugador que facilitarÃƒÂ¡ el manejo tanto para neÃƒÂ³fitos como jugadores expertos. En un mundo dinÃƒÂ¡mico y vivo el jugador experimentarÃƒÂ¡ jugar en un entorno de juego completamente simulado con personajes autÃƒÂ©nticos y sin tediosos tiempos de carga.\n\n\nRisen Piranha Bytes introduces a refreshing new setting: the game's protagonist boat has sunk after a storm and it ends on a mysterious island. An erupting volcano presides over the scene, the ruins of an ancient temple newly emerged land and the island is infested with odd creatures. \nIn Risen, the team presents a new stage with a wide variety of adventures that will keep the player as always glued to the screen. \n\nRisen is an epic role-playing game with an intuitive game interface and controlled by the player who will provide management for both beginners and experienced players. In a world player dynamic living experience playing in a completely simulated game environment with authentic characters and without tedious loading times.\n\nRisen Piranha Bytes introduit un nouveau paramÃƒÂ¨tre rafraÃƒÂ®chissante: bateau protagoniste du jeu a coulÃƒÂ© aprÃƒÂ¨s une tempÃƒÂªte et il se termine sur une ÃƒÂ®le mystÃƒÂ©rieuse. Un volcan en ÃƒÂ©ruption prÃƒÂ©side ÃƒÂ  la scÃƒÂ¨ne, les ruines d'un ancien temple des terres rÃƒÂ©cemment ÃƒÂ©mergÃƒÂ©es et l'ÃƒÂ®le est infestÃƒÂ©e de crÃƒÂ©atures bizarres. \nEn ressuscitÃƒÂ©, l'ÃƒÂ©quipe prÃƒÂ©sente une nouvelle ÃƒÂ©tape avec une grande variÃƒÂ©tÃƒÂ© d'aventures qui gardera le joueur comme toujours collÃƒÂ© ÃƒÂ  l'ÃƒÂ©cran. \n\nRessuscitÃƒÂ© est un rÃƒÂ´le ÃƒÂ©pique jeu de jeu avec une interface de jeu intuitive et contrÃƒÂ´lÃƒÂ© par le joueur qui assurera la gestion pour les joueurs dÃƒÂ©butants et expÃƒÂ©rimentÃƒÂ©s. Dans un acteur mondial de l'expÃƒÂ©rience de vie dynamique ÃƒÂ  jouer dans un environnement complÃƒÂ¨tement jeu de simulations avec des personnages authentiques et sans temps de chargement fastidieux.\n\nRisorto Piranha Bytes introduce uno scenario nuovo rinfrescante: barca del gioco protagonista ÃƒÂ¨ affondata dopo una tempesta e si finisce su un'isola misteriosa. Un vulcano in eruzione presiede la scena, le rovine di un antico tempio di recente ÃƒÂ¨ emerso terra e l'isola ÃƒÂ¨ infestata da strane creature. \nNel Risorto, la squadra presenta una nuova fase, con una grande varietÃƒÂ  di avventure che non mancherÃƒÂ  di tenere il giocatore, come sempre incollati allo schermo. \n\nRisorto ÃƒÂ¨ un ruolo epico-playing game, con un'interfaccia intuitiva gioco e controllata dal giocatore che fornirÃƒÂ  la gestione sia per i principianti e giocatori esperti. In un mondo giocatore un'esperienza di vita dinamico giocare in un ambiente di gioco completamente simulato con personaggi autentici e senza noiosi tempi di caricamento.\n\nAuferstandenen Piranha Bytes stellt eine erfrischende neue Einstellung: das Spiel Protagonist Boot hat nach einem Sturm gesunken, und es endet auf einer geheimnisvollen Insel. Ein Vulkanausbruch den Vorsitz ÃƒÂ¼ber die Szene, die Ruinen eines antiken Tempels neu entstandenen FlÃƒÂ¤chen und der Insel ist mit seltsamen Kreaturen ÃƒÂ¼berlaufen. \nIn Auferstandenen, prÃƒÂ¤sentiert das Team eine neue Phase mit einer Vielzahl von Abenteuern, die die Spieler zu halten, wie immer auf die Leinwand geklebt. \n\nAuferstandene ist ein episches Rollenspiel-Spiel mit einer intuitiven Schnittstelle Spiel und der Spieler, der Verwaltung sowohl fÃƒÂ¼r AnfÃƒÂ¤nger als auch erfahrene Spieler bieten wird kontrolliert. In einer Welt, dynamische Spieler lebendige Erfahrung spielt in einer komplett simulierten Spielumgebung mit authentischen Zeichen und ohne lÃƒÂ¤stige Ladezeiten.\n\nOriginal credit goes to the original uploader and remember to seed....","torrent":{"xt":"urn:btih:53189c1393cddc96bb5bb342c2b5d8c64aad969f","amp;dn":"Risen+%5BMULTI5%5D%5BXBOX360%5D%5BRegion+Free%5D%5Bgamerguuy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53189c1393cddc96bb5bb342c2b5d8c64aad969f","infoHashBuffer":{"type":"Buffer","data":[83,24,156,19,147,205,220,150,187,91,179,66,194,181,216,198,74,173,150,159]},"announce":[],"urlList":[]}}