{"title":"The True Ultimate D&amp;D 3.5 Collection","uid":4760063,"size":3934986018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:536f1a0593fe022129911e913ef8f4101ee7a205&amp;dn=The+True+Ultimate+D%26D+3.5+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XeroShift","files":1,"time":1236658063,"description":"Alright this is my first torrent, so you might actually end up downloading just the torrent file through your torrent program instead of the actual file itself, which would suck for you. Oh well though, its just an extra unwanted step to actually get the files, but if i did it right it should work out without the extra step anyway, on to the file descriptors.\n\nThis torrent contains every dnd 3.5 supplement ever made by wizards of the coast as well as some that where not made by wizards but where meant for use with their products. This torrent also includes a couple campaign books (such as from the forgotten realms world)\nI have personally gone through all of these and can assure you there are no duplicates, and all files are highest quality i could find.\n\nSince this is my first torrent I will be uploading this when ever my computer is on (pretty much 24/7) and i will never stop seeding.\n\nI have taken the files and run them through winrar to make them smaller (the original files where around 3.89gigs)\n\nAll of the files are sorted into a couple different types, and have a tag that comes before their names so that you know what it is the types are:\n\n-Supplement - For players and DM's equally\n-DMCGuide - Dungeon Master campaign guide (mostly for dm eyes only, but may contain some player relavent data)\n-Suppliment - Mispelled version of Supplement\n-DataSheet - Usefull chart for the dms or players, such as a dm screen, spell sheets, and dm sheet.\n-Campaign Setting - Data on someone else's world\n-Forgotten Realms - There are enough of these that they get their own tag\n-Quintessential - A series of books that tell you everything about what ever the class being discussed is.\n-Character Sheet - There are many different versions of these for different campaign types or class specific ones.\n-SAS/SWS - Swords and Sorcery books, very similar to dnd (only like 2 of these) still uses the d20 system so technically are usable for dnd.\n\nPlease Excuse my spelling, thank you and have a nice day.","torrent":{"xt":"urn:btih:536f1a0593fe022129911e913ef8f4101ee7a205","amp;dn":"The+True+Ultimate+D%26D+3.5+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536f1a0593fe022129911e913ef8f4101ee7a205","infoHashBuffer":{"type":"Buffer","data":[83,111,26,5,147,254,2,33,41,145,30,145,62,248,244,16,30,231,162,5]},"announce":[],"urlList":[]}}