{"title":"Cannabis_Cup_(2003)_(Xvid-MP3)-WaRlOrD","uid":4896513,"size":733909872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:53b8b69dcb0a2ad7f8acfb0fbf3a1b5bd4392be3&amp;dn=Cannabis_Cup_%282003%29_%28Xvid-MP3%29-WaRlOrD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bitpirate","files":-1,"time":1242363206,"description":"WaRlOrD presents: Cannabis cup 2003\n(no subs)\n\n\n\nThe Cannabis Cup is a festival that was started in 1987 by High Times editor Steven Hager, who came to The Ntherlands for an interview with the founder of the first Dutch cannabis-seed company. The Australian owner, Nevil, lived in a mansion filled with growrooms that Hager dubbed &quot;The Cannabis Castle&quot;. The festival, held annually in Amsterdam, The Netherlands is one of the most famous cannabis events among cannabis smokers and cannabis-oriented businesses. The public is exposed to a large variety of marijuana strains which they then help to judge. A team of VIP judges decide which seed company brought the best marijuana, while the judges-at-large decide the Cannabis Cup, best new product, best booth, best glass, best hash and best Nederhash.\n\nHighest recorded participation was in 2008 with 2,300 judges. In 2008, the 21st Cannabis Cup featured the induction of Peter Tosh into the Counterculture Hall of Fame, with performances by Andrew Tosh, Ky-mani Marley, CenC Love, Bushman, Rocker T, and Leon, as well as lectures by Roger Steffens. In 2007, the 20th Cannabis Cup featured Tommy Chong and Redman. A film of the anniversary event was released in the summer of 2008.\n\nMarijuana use is decriminalized in most parts of The Netherlands. Much of the marijuana present is from the different coffee shops around Amsterdam. Usually the Cannabis Cup has a surprise weed, a strain of marijuana that is new to the culture and will be tested by the judges. Many tourists go to Amsterdam to attend the festival. Due to the decriminalization of marijuana, the Tetrahydrocannabinol (THC) contents can be quite high. Therefore, it is recommended for judges to have a high tolerance to THC. Some of the stronger marijuana which comes in 'hash' form can have strengths of up to 75% THC.\n\nvideo-codec: Xvid\nAudio-codec: MP3\n\n\nHave fun, smoke some, be high","torrent":{"xt":"urn:btih:53b8b69dcb0a2ad7f8acfb0fbf3a1b5bd4392be3","amp;dn":"Cannabis_Cup_%282003%29_%28Xvid-MP3%29-WaRlOrD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b8b69dcb0a2ad7f8acfb0fbf3a1b5bd4392be3","infoHashBuffer":{"type":"Buffer","data":[83,184,182,157,203,10,42,215,248,172,251,15,191,58,27,91,212,57,43,227]},"announce":[],"urlList":[]}}