{"title":"Power Game Factory v1.0.5","uid":4434428,"size":154114719,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5405e7e7abd8e378ad5df2096570acfef48e213e&amp;dn=Power+Game+Factory+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nadav_Peretz","files":1,"time":1223472433,"description":"Game design just got easier with Power Game Factory, software for creating side scrolling action games for the Macintosh. Featuring a polished graphical user interface, Power Game Factory is capable of producing games similar to many of the most highly regarded 8-bit and 16-bit console video games, but with far superior graphics and sounds. Best of all, no programming is required.\n\nCombine Cutting Edge Technology With Time Tested Gameplay\nPower Game Factory applies the latest technologies to the proven 2D platformer game genre. Games made with Power Game Factory can combine high resolution sprite graphics and realistic physics with authentic old school gameplay, making this the ideal system for constructing compelling, truly playable Macintosh games.\n\nBuild Stand Alone Games\nCompleted game projects may be compiled into self-contained, fully functional game applications. Sawblade Software does not place restrictions on your right to sell finished games, and you may charge any price you wish. You will never have to pay any royalties, no matter how many games you sell.\n\nEndless Creative Possibilities\nPower Game Factory is a robust game development environment; game projects may feature hundreds of huge levels and hours of gameplay. Or you can make a single-level action game that could be downloaded in a few minutes. There are no restraints placed on the number of levels, characters, projectiles, and scenery objects in a game.\n\nmore info: &lt;a href=&quot;\nhttp://www.sawbladesoftware.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sawbladesoftware.com/&lt;/a&gt; ","torrent":{"xt":"urn:btih:5405e7e7abd8e378ad5df2096570acfef48e213e","amp;dn":"Power+Game+Factory+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5405e7e7abd8e378ad5df2096570acfef48e213e","infoHashBuffer":{"type":"Buffer","data":[84,5,231,231,171,216,227,120,173,93,242,9,101,112,172,254,244,142,33,62]},"announce":[],"urlList":[]}}