{"title":"Osho_come, come yet again come #08_communion.avi","uid":15346430,"size":733919232,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:54077ee24385bddacb11748b980486e448d16d72&amp;dn=Osho_come%2C+come+yet+again+come+%2308_communion.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1468883439,"description":"\nOld video but rare..40 min (only 2 questions on video)\r\n\r\nCome Come yet again Come_ch.08, 1980.\r\n\r\nQuestion 2\r\n\r\nBhagwan,\r\nCHOGYAM TRUNGPA WRITES IN ONE OF HIS BOOKS:\r\n&quot;NOR IS IT HELPFUL TO CHOOSE SOMEONE FOR YOUR MASTER SIMPLY BECAUSE HE IS FAMOUS -- SOMEONE WHO IS RENOWNED FOR HAVING PUBLISHED STACKS OF BOOKS AND CONVERTED THOUSANDS OR MILLIONS OF PEOPLE. INSTEAD, THE GUIDELINE IS WHETHER OR NOT YOU ARE ABLE TO ACTUALLY COMMUNICATE WITH THE PERSON DIRECTLY AND THOROUGHLY.&quot;\r\nTHE KEY WORDS ARE &quot;DIRECTLY&quot; AND &quot;THOROUGHLY.&quot; HOW DOES THIS WORK FROM THE SANNYASIN'S END, IN VIEW OF YOUR VIRTUALLY COMPLETE PHYSICAL INACCESSIBILITY?\r\n\r\nJames, it is true that one should not choose someone as a master JUST because he is famous. Jesus was not famous when he was alive nor was Lao Tzu famous when he was alive. To be famous is one thing; to know the truth is totally another. In fact, there is a greater possibility that the master, the real master, will be notorious rather than famous.......\r\n\r\nThe last question:\r\nQuestion 3\r\nBhagwan,\r\nDO YOU WANT TO ATTRACT OR PREVENT POLACKS WITH YOUR JOKES?\r\n\r\nDeva Yachana, I never thought that you were also a Polack! There are many Polacks here -- through my jokes I have discovered them; otherwise they hide themselves so perfectly! It is my way of discovering who are the Polacks among my sannyasins.\r\nIn Poland all are not Polacks, and outside Poland all are not non-Polacks either. So don't be worried -- I am not saying anything against Polacks as such. They are beautiful people, innocent people; they are simple people. And sometimes simple people are also simpletons, but I love them. Those who can understand me will be attracted, and those who cannot understand me, whether I tell the jokes or not will not make any difference to them..............\r\nFree download books and videos from oshoworld.com","torrent":{"xt":"urn:btih:54077ee24385bddacb11748b980486e448d16d72","amp;dn":"Osho_come%2C+come+yet+again+come+%2308_communion.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54077ee24385bddacb11748b980486e448d16d72","infoHashBuffer":{"type":"Buffer","data":[84,7,126,226,67,133,189,218,203,17,116,139,152,4,134,228,72,209,109,114]},"announce":[],"urlList":[]}}