{"title":"The Upperfloor--tUF-39366 Piper Perri, Casey Calvert, Marco Band","uid":13283323,"size":1460188820,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:54080773066eb7d538789efdcd604790e337b539&amp;dn=The+Upperfloor--tUF-39366+Piper+Perri%2C+Casey+Calvert%2C+Marco+Band&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":171,"time":1453511820,"description":"Piper Perri's Sex Slave Initiation\r\n\r\nJan 22, 2016 - Performers: Marco Banderas ,  Casey Calvert   and  Piper Perri \r\n\r\n\r\nMed and Hi MP4 + Pics.\r\n\r\n\r\nPiper Perri is a captivating beauty, and luckily for Casey Calvert, rather submissive. Casey starts the brunch out already in a punishment position, her wet pussy clamped shut and a giant dildo shoved in her ass. Piper must fetch 3 orgasms from female guests before Casey may have the clamps removed and enjoy a painful orgasm. Piper is resourceful, and quickly finds the sluts in the crowd with cunts aching for vibrators. Getting railed from behind and attending to multiple horny women, Piper gets those orgasms quickly and releases her senior slave for a painful finish. \r\n\r\nSecond trial of the day finds Piper trussed up in tight rope bondage trying to keep silver trays piled high with clothes pins from dropping. Casey is giving a male guest of honor a hot anal fuck, but unfortunately every pin that Piper drops is applied to a tight zipper on her bouncing tits. Both slaves End the scene in screaming orgasms while mean guests remove the clamps from Casey with a quick tug. \r\n\r\nPiper is tied up, helpless and unable to move while her wet pussy is split on a huge hard cock. Casey torments her little unstudy, tickling her feet, putting clamps on her tiny tits, and choking her out. Piper prevails in outstanding filthy talk and is allowed to finish her dick duties with Casey's tongue licking her hot pussy. Both slaves are cut loose and made to work the cum out of our esteemed guest using their perfect bodies in any manner he wants. Once Piper has a hot load of cum on her ass, slave collars with be discussed.\r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39366\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:54080773066eb7d538789efdcd604790e337b539","amp;dn":"The+Upperfloor--tUF-39366+Piper+Perri%2C+Casey+Calvert%2C+Marco+Band","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54080773066eb7d538789efdcd604790e337b539","infoHashBuffer":{"type":"Buffer","data":[84,8,7,115,6,110,183,213,56,120,158,253,205,96,71,144,227,55,181,57]},"announce":[],"urlList":[]}}