{"title":"Warband 1.143 Crack for WSE (Warband Script Enhancer)","uid":7086078,"size":4372765,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:55a6b4bba5d3d06405bd14a68b3bfd9d91978637&amp;dn=Warband+1.143+Crack+for+WSE+%28Warband+Script+Enhancer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AnonymousJim","files":1,"time":1331188857,"description":"WSE (Warband Script Enhancer) checks the checksum of mb_warband.exe to see if it's the original. I've changed the checksum for two different cracks so that they look like the original file to WSE. I didn't make either crack, I just changed the checksum of both of them so they'd work with WSE. I'm still testing both out. Crack 1 seems to have fewer issues with WSE, but crack 2 seems to actually see some servers. If your crack is working fine for you, I've also included everything that you'll need to change the SRC32 checksum of your current cracked .exe. Here's what you'll need to do once you've extracted the archive...\n\nIf you want to use either of the cracks I've included for 1.143:\n\n1)Copy either of the mb_warband's to your installation directory, then either use them or WSE to launch the game. If you like mb_warband2.exe better, rename it to mb_warband.exe. \n\nIf you want to use your current crack with WSE:\n\n1) Copy fakecrc.exe\n\nXP\n2) Open up cmd by clicking start, run, then cmd\n\nor\n\nVista/7\n2) Type cmd in the start menu, right click cmd.exe, and choose 'Run as administrator'\n\n3) Minimize that window for now, browse to your Warband installation directory (ie C:Program Files (x86)Mount&amp;Blade - Warband), and paste fakecrc.exe here.\n\n4. Create a backup somewhere of mb_warband (or whatever your crack is called) in case it gets messed up here in a little bit.\n\n5) At the top of your file browser, copy your current directory.\n\n6) Switch to the cmd window. Type 'cd' without quotes, hit space, right click in the window, and select paste. Enter.\n\n7) If you're in the same directory as your cracked .exe and fakecrc.exe in your cmd window, copy the text 'fakecrc mb_warband.exe 0xC3FEE1D1' without quotes and paste it into the cmd window (replace mb_warband.exe with whatever the cracked .exe is). Hit enter. You should see &quot;Done! CRC32 is now 0xC3FEE1D1&quot; somewhere. If that's not what it says, something is wrong.\n-Note: Type fakecrc by itself for help with its functions.\n\nHope it works out for you, please seed if it does =)","torrent":{"xt":"urn:btih:55a6b4bba5d3d06405bd14a68b3bfd9d91978637","amp;dn":"Warband+1.143+Crack+for+WSE+%28Warband+Script+Enhancer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a6b4bba5d3d06405bd14a68b3bfd9d91978637","infoHashBuffer":{"type":"Buffer","data":[85,166,180,187,165,211,208,100,5,189,20,166,139,59,253,157,145,151,134,55]},"announce":[],"urlList":[]}}