{"title":"FSX-Dutch Harbour","uid":6307074,"size":329067685,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:56727da0659ec565f7b44ea16955e8b0a7ba3f14&amp;dn=FSX-Dutch+Harbour+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vittupaa1980","files":-1,"time":1302376886,"description":"Aerosoft - Dutch Harbor-FSX\n\n\n1:Point Installer to FSX installation files.\n2:add the flight file folder contents too as per read me file.\n3:add scenery to your fsx files D-Harbour x first than AFD make sure AFD is above all Aerosoft products.\n4:add Area's to your fsx.cfg file in main folder to activate as per the read me.\n\nYou're Done Enjoy.ICAO     = PADU unalaska in Alakska\nMake sure to have lots of Fuel. You'll need itttttttttttttttttttttt!\nBeautiful Scenery very well done.\n\nYear of manufacture : 2010\nGenre : addition to MS FSX\nDeveloper : Thorsten Reichert\nPublisher : Aerosoft\nPlatform : MS FSX Acceleration (Gold)\nSystem requirements :\n2.0 GHz processor (Intel Core 2 Duo highly recommended)\n2 GB RAM internal memory\n256 MB graphic card (512 Mb highly recommended)\nDownload-Size: 260 MB\nInstallation-Size: 600 MB\nPublication Type : license\nLanguage : English\nCrack : Not required\nFeatures :\nOriginal lendklass and LOD11 mesh Aleutian Islands (see map)\nSeasonal textures\nDutch Harbor port city, sightseeing and airport\nOriginal night texture\nStrip lights (on request)\nAdditional runway and villages:\nNikolski Airfield\nAkutan Seaplane Base\nChernofski Seaplane Base\nFort Glenn Air Force Base (abandoned)\nDriftwood Bay Air Force Station (abandoned)\nAdditional local attractions since WWII\nVolcanoes with the effects of\nFact-finding mission and modified the original mission simulator in the region\nFinished downloading free flights with the typical for the region weather\nDX10 compatible\n\nThe Aleutian Islands must be one of the most remote places in North America, extending about 1,200 miles from the Alaska Peninsula into the Bering Sea toward the Kamchatka Peninsula. Despite its enormous size, the chain of more than 300 volcanic islands have just a bit over 8,000 inhabitants, most of them living on Unalaska Island.\n\nThere is a reason why the small town of Unalaska is known further than you would expect for a city located in no man's land, somewhere between the U.S. and Russia: its port facilities &quot;Dutch Harbor&quot;. Named by Russians because they believed that a Dutch vessel was the first European ship to enter the harbor, this port is the largest commercial fishing port of the United States.\n\nThis would sound impressing for lovers of ship or fishing simulators, but why did we create a FSX add-on covering Dutch Harbor? The answer is simply: challenge! Very few airports in the world are as much of a challenge for any pilot trying to master it, be it in a Boeing 737 or in a Twin Otter.\n\nWith over 250 rainy days a year, constant fogs, heavy crosswinds floating over the mountains from the Bering Sea and average winter temperatures that stay well below freezing it is enough to trouble even the most experienced pilots. And if the weather conditions are not challenging enough, the towering mountains on almost all sides of the airport force the pilot to fly a difficult circling approach with a tight turn to line up with the 3,900ft long runway.\n\nPlease Seed this once done downloading .:D","torrent":{"xt":"urn:btih:56727da0659ec565f7b44ea16955e8b0a7ba3f14","amp;dn":"FSX-Dutch+Harbour+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56727da0659ec565f7b44ea16955e8b0a7ba3f14","infoHashBuffer":{"type":"Buffer","data":[86,114,125,160,101,158,197,101,247,180,78,161,105,85,232,176,167,186,63,20]},"announce":[],"urlList":[]}}