{"title":"Microsoft Office 2007 Blue Edition","uid":4438273,"size":524021901,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:57be562ee0676f5d338774ba89b847c767417312&amp;dn=Microsoft+Office+2007+Blue+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xtensity","files":1,"time":1223673272,"description":"There is quite a big chance that you have never heard of this Blue Edition, because - it is only available to equipment manufacturers and not to the general public. This is the copy from the original disk, which is only accessible to technicians of Microsoft. This version of Microsoft Office 2007 will never appear for sale, since this is the only version where there is no need for a serial. This version also doesnt need an activation. The installer is very simple, undetailed and handy. The interface of application is completely changed, it is modernized and practically reminds in no way to the previous versions.In a few minutes the software will be installed on your computer, without any questions or other things that slow down the installation.\n\n\nThere is no viruses or anything that will harm your computer. If you think it has a virus then just don't download it. I had this up before but my account got deleted due to an idiot mod. An admin has reinstated my account. Before this torrent had tons of positive feed back.\n\nHeres a pic of virus scan... if it doesn't show up Ill get a mod to reattach it.\n\n","torrent":{"xt":"urn:btih:57be562ee0676f5d338774ba89b847c767417312","amp;dn":"Microsoft+Office+2007+Blue+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57be562ee0676f5d338774ba89b847c767417312","infoHashBuffer":{"type":"Buffer","data":[87,190,86,46,224,103,111,93,51,135,116,186,137,184,71,199,103,65,115,18]},"announce":[],"urlList":[]}}