{"title":"BangBus - Mary XXX 480p 20.01.2002","uid":11264258,"size":986568797,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5d5c774cc83972662bbed08b5a22d0ee03300907&amp;dn=BangBus+-+Mary+XXX+480p+20.01.2002+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"christian2353","files":1,"time":1414005066,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/LACNjAAGd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LACNjAAGd&lt;/a&gt;\n\n\n\n\nSo while driving around an old hood of mine where I used to kick it with my homies drinking 40.s and tokin that killa wheezy, Jesus spots a young lady around 80 yards away walking by a busted down fucked up crx. He nudges me and I tell ugly to hook a right, and then a left to race balls out down a one way road to catch up with her...and man was it worth it this girl was from the stars apparently the bang bus gods had been pleased with us to have us come across such a babe. This gem's name was Marry this was the kind of girl that you pass by and say to yourself 'man thats a piece of ass' but you know that your never gonna get it. Well I got it for ya and its as sweet as you've always imagined. She was new to miami and had no friends...did I forget to mention the fact that she hated the aunt she was living with so I think we were probly just helping her out of her absolute bordem. She jumped in and we were off, Jesus didn't talk much at first so ugly and I did most of it. she was super cool and we all had alot of fun she was the kinda of girl that always wanted to break out of her suburban shell but couldnt't and we were just there at the right time and place to help her peel out of it and right down to the phat sexy ass and tities. She was sporting them and as usual I wont give away the whole story but it has some hot sex funny ass *censored*and she got fuckin slammed but remember dont try this at home we're trained proffecionals. thanks for watching and enjoy The Dirty One","torrent":{"xt":"urn:btih:5d5c774cc83972662bbed08b5a22d0ee03300907","amp;dn":"BangBus+-+Mary+XXX+480p+20.01.2002+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5c774cc83972662bbed08b5a22d0ee03300907","infoHashBuffer":{"type":"Buffer","data":[93,92,119,76,200,57,114,102,43,190,208,139,90,34,208,238,3,48,9,7]},"announce":[],"urlList":[]}}