{"title":"Thomas Malory - Le Morte d'Arthur [King Arthur] (2 editions)","uid":10201595,"size":17522679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e11f70f964f4b6f6f6e2288f6228673fd5499eb&amp;dn=Thomas+Malory+-+Le+Morte+d%27Arthur+%5BKing+Arthur%5D+%282+editions%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1400780588,"description":"\nLE MORTE D'ARTHUR (&quot;The Death of Arthur&quot;) is a compilation by SIR THOMAS MALORY (d. 1471) of romance-era tales about the legendary King Arthur, Guinevere, Lancelot, and the Knights of the Round Table.  Malory drew upon existing French and English verse sources about these figures, and added original material (the Gareth story), to give an epic unity to the myth.  First published in 1485, it remains today the best-known work of Arthurian literature in English.\n\nRecounting Arthur's birth, his ascendancy to the throne after claiming Excalibur, his ill-fated marriage to Guinevere, the treachery of Morgan le Fay, the exploits of Tristan and other Knights of the Round Table, and the quest for the Holy Grail, Malory's epic romance magically weaves together adventure, battle, love and enchantment, and is full of wistful, elegiac regret for a vanished age of chivalry.\n\n\nBoth the Penguin Classics and Oxford World's Classics editions are included here in retail ePUB / MOBI format:\n\n* LE MORTE DARTHUR: The Winchester Manuscript (Oxford World's Classics, 1998).  Edited and abridged with Introduction and Notes by Helen Cooper.\n\n* LE MORTE D'ARTHUR (Penguin Classics, 2004).  2 volumes.  Edited by Janet Cowen with an Introduction by John Lawlor.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:5e11f70f964f4b6f6f6e2288f6228673fd5499eb","amp;dn":"Thomas+Malory+-+Le+Morte+d%27Arthur+%5BKing+Arthur%5D+%282+editions%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e11f70f964f4b6f6f6e2288f6228673fd5499eb","infoHashBuffer":{"type":"Buffer","data":[94,17,247,15,150,79,75,111,111,110,34,136,246,34,134,115,253,84,153,235]},"announce":[],"urlList":[]}}