{"title":"Pre-Columbian Art (Art Ebook).pdf","uid":12537339,"size":14221565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f7cbb6b4845f51b197f40717d48feaddc86bb40&amp;dn=Pre-Columbian+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1444338438,"description":"Pre-Columbian Art\r\nGallery Books | 1984 | ISBN: 0831771755 | English | 96 pages | PDF | 13.6 MB\r\n\r\nBeautiful book includes 40 color plates. Heads and masks, vessels, mosaics, carvings, textiles, gold ornaments etc. In this volume on Pre-Columbian art of Central and South America, the author discusses a collection of artifacts that include: Heads and Masks, Vessels, Mosaics, Carvings, Textiles, Gold Ornaments representative of PC civilizations of Mexico and Peru. Includes a concise Introduction. A stand-alone volume in the 'Art For All' series. Includes Middle America, The Olmecs,, The Classic Period in Mexico, the Maya, the Post-Classic Civilizations, Peru, Moche and Nazca, Tiahuanaco and Chimu, and The Incas. Pre-Columbian Art is the art of Mexico, Central, the Caribbean, and South America in the time prior to the arrival of European colonizers in the 15th century. Pre-Columbian art thrived over a wide timescale from 1800 BCE to 1500 CE. Despite the great range and variety of artwork, certain characteristics were repeated throughout the region, namely a preference for angular, linear patterns, and three-dimensional ceramics. Most of the now known artworks made in Central America and South America before the voyage of Christopher Columbus have been found in tombs. Enormous amounts of time, energy and materials were spent to properly equip the societies' leaders and elite for their after-death journeys. Pre-Columbian cultures viewed reality as a multi-layered universe with various divisions, attended by numerous deities whose activities and relationships metaphorically expressed the forces of nature and cosmos. Death was considered a transition and journey from one realm of existence to another. The elaborate preparation and offerings associated with burying the dead reflect the importance of equipping a soul for transition from one realm to another","torrent":{"xt":"urn:btih:5f7cbb6b4845f51b197f40717d48feaddc86bb40","amp;dn":"Pre-Columbian+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f7cbb6b4845f51b197f40717d48feaddc86bb40","infoHashBuffer":{"type":"Buffer","data":[95,124,187,107,72,69,245,27,25,127,64,113,125,72,254,173,220,134,187,64]},"announce":[],"urlList":[]}}