{"title":"Star Trek - A Piece Of Dat Action","uid":5219840,"size":1360691200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:60dba2d351833b796794a53defa089e3f1a981b1&amp;dn=Star+Trek+-+A+Piece+Of+Dat+Action&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thegreeneyedguy","files":1,"time":1260892955,"description":"I recently found an old VHS tape of a recording that I had done in my mid-twenties with an old 4 track analog tape recorder and a VCR.  It is an overdub of the original Star Trek series episode #46, titled A Piece Of The Action. \n \n   After painstakingly going through it an writing down the entire script, I decided on which characters I wished to change and then proceeded to rewrite the script over, trying to keep as much mouth movement as I could with the original.  I then recorded the voiceovers individually along with some minor sound effects.  When finished, I manually sychronized the multitrack cassette tape with the dub containing intentionally dropped out portions to get this finished product.  \n\n   By todays standard, it is pretty lame, but for the early 1990's and the tech that I had, hey, it's not bad at all.\n\n   My character changes are as follows;\n\nCapt. Kirk                -             Capt. Quirk\nMr. Spock                 -             Mr. Spook\nDr. McCoy &quot;Bones&quot;         -             Dr. McQueer &quot;Boner&quot;\nMr. Scott &quot;Scotty&quot;        -             Mr. Snot &quot;Snotty&quot;\nMr. Chekov                -             Mr. Jackoff\nLieut. O'Hara             -             Lieut. O'Whora\nJo-Jo Cracko              -             Up-My Cracko\n\n\n   The general storyline is the same.  Ya ya, the crew goes down and saves the planet, only this time it is for the benefit of the Federation.  You see, the Iotian planet of gangsters are now having dilemas with who sells what to whom, meaning drugs.  If our intrepid crew does not accomplish what needs to be done to unite these processing plants, the Federation will be dopeless.  You and me included.\n\n   Well, you get the idea.  \n\n   Needless to say, this is not meant to be viewed by children.  I did this in my younger years as a farce.  When I did do it, I was sharing a house with a couple of roomates, so when you hear reference to Marts', Johns' and Joes' house, that's who they mean.  Yup, even the crew of NCC1701 used to come over and party with us.  \n   \n   Oh yeah, forgot to mention.  Vic Tayback, playing Jo-Jo Cracko has too classic a voice to change but the other gangster Bela Okmyx was too hard to resist.  And what's better than giving him a French Canadian accent.  Ah, the Quebecois.  Hence the change in my title to A Piece of Dat Action.\n\n   Hope you enjoy.  I had a blast making it way back when.  Joe.\n\n\n   Now, pass that damn thing and don't be a bogart!!","torrent":{"xt":"urn:btih:60dba2d351833b796794a53defa089e3f1a981b1","amp;dn":"Star+Trek+-+A+Piece+Of+Dat+Action","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60dba2d351833b796794a53defa089e3f1a981b1","infoHashBuffer":{"type":"Buffer","data":[96,219,162,211,81,131,59,121,103,148,165,61,239,160,137,227,241,169,129,177]},"announce":[],"urlList":[]}}