{"title":"G-Maps East and West","uid":4625922,"size":1849501312,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:620981c375ee5cfe0614d7a17bc5f4c36aa54134&amp;dn=G-Maps+East+and+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Oxymor0n","files":2,"time":1231209510,"description":"raveling somewhere you've never been? Or need directions right away? If so, run G-Map on the iPhone you're holding in your hand. G-Map can show you the way wherever you go, even with no Wi-Fi connection or in dead zones up in the mountains, out on the ocean, or even in an airplane. G-Map is a stand-alone electronic map. So once it's downloaded, you can freely search your location and get directions without an internet connection, anytime, anywhere, even when you're on the move. G-Map's massive data will help you find any desired location, and can also provide detailed information of the searched location such as address and phone number. It's also possible to enter your own personal notes or make changes to the information of the location searched, so you can even use your G-Map as a travel notebook. So now when you travel, you can leave the paper maps behind. You'll have everything you need once you download the G-Map onto the iPhone or iPod Touch you're holding in your hand. Don't forget: When you travel, take G-Map with you.\n\n \tStand-alone electronic map that needs no internet connection\n\tUnfettered location search in the mountains, on the ocean, or the middle  of .       nowhere, even when on the move\n \tLarge-capacity map data enables easy search of desired location and route\n\tReal 3D View of intricate major intersections and highway junctions\n\tSmart location search powered by a search engine similar to internet .   .  ..      search   engines, using keyword search\n\tDetailed information on restaurants, hotels, and leisure destinations       .       provided with Premium POI\n\tPOI editing and memo capability for personalized POI\n\tRoute preview provides optimal route to destination\n\tSearch by phone number and latitude/longitude\n\tPhone number dial by POI (for iPhone)","torrent":{"xt":"urn:btih:620981c375ee5cfe0614d7a17bc5f4c36aa54134","amp;dn":"G-Maps+East+and+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"620981c375ee5cfe0614d7a17bc5f4c36aa54134","infoHashBuffer":{"type":"Buffer","data":[98,9,129,195,117,238,92,254,6,20,215,161,123,197,244,195,106,165,65,52]},"announce":[],"urlList":[]}}