{"title":"Mount Washington - 2012 - Mount Washington [320K/CBR]","uid":7156732,"size":99053382,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:629e9e36b835ad83080c505327798bc2651eb359&amp;dn=Mount+Washington+-+2012+-+Mount+Washington+%5B320K%2FCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1333475394,"description":"Details:\n\nArtist: Mount Washington\nAlbum: Mount Washington\nGenre: Country, Folk, Pop, Indie\nLabel: Glitterhouse Records\nLanguage: English\nRelease Date: Feb 02, 2012\nNumber of Tracks: 10\nTotal Length: 00:41:08\nTotal Size: 94.30 MB\nFormat: MPEG 1 Layer III (mp3), Joint Stereo\nQuality: 320 KBPS, 44 KHz, CBR\nWebstore: http://www.glitterhouse.com/index.asp?lang=d&amp;mode=artinfo&amp;submode=&amp;id=74440&amp;rid=0&amp;searchfor=&amp;searchmode=&amp;pos=&amp;wk=&amp;rnd=0%2C3848383&amp;s1=&amp;s2=&amp;incs=false\n\nNarratives:\n\nThe Arctic in Tromso, and Berlin have little in common: on the one hand in a relaxed Norwegian harbor town with impressive natural scenery, on the other hand, the bustling German capital, and cultural Mecca hochgehypte a trendy metropolis. Basically, the two cities as two opposing poles, two extremes.\nA radical move from one extreme to another, however, was exactly what took Mount Washington in the last year: Rune Simonsen singer, bassist and drummer Andreas HÂ°yer Esko Pedersen had had enough of life in their soporific northern Norway home. &quot;On to Berlin!&quot; Was the watchword, and the suitcases were packed quickly. Once there, the three began with the already writing new songs for their fourth self-titled album. It served them, as many of their musical heroes, the city as a source of inspiration.\n\nAlready on the three previous works of Mount Washington were never entered on the spot: From the wide-ranging and profound approach of &quot;A New Order Rising&quot; on the dreamy pop of &quot;Astral Sky&quot; to the sound experiments of 'Rouge / Noir &quot;It was a long route.\n\nBut &quot;Mount Washington&quot; differs most clearly from the previous output of the band. It represents a fresh start, while wounds are licked, including the end of a long-standing relationship. Here enters Berlin from every pore: reduced, groove-oriented and provided with a healthy dose of electronics, Mount Washington, urban sound than ever. While taking a distinctive voice of the Rune Simonsen still on trips through his own head, still arise in your mind the powerful images, and still afraid of the band neither melancholy nor the grand gesture. But the sound universe of Mount Washington, joined by new nuances. The single &quot;Lisboa&quot; is programmatic for the entire album: it starts playful and up-beat, with an airy guitar lick, later singing background elegiac choruses seemingly in vain against the spirited lead vocals on - a song, bittersweet as life itself\n\nWith the support of both producer Guy Sternberg (Junior Boys, Keane) and David Newfeld (Broken Social Scene, Superfurry Animals) have Mount Washington created an album that the scars of the past is not hidden, but much looks forward, with energy and expectation seems almost to bursting.\n\nThe CD comes in a multi-digipak, as usual on the vinyl strapping 180 grams\n\nTrack Listing:\n\n01. How Does it Feel?  (03:19), 7.61 MB\n02. Silver Screen  (03:54), 8.96 MB\n03. Lisboa  (04:00), 9.16 MB\n04. A Good Run  (03:34), 8.18 MB\n05. Toscana  (04:27), 10.19 MB\n06. Next Year  (03:28), 7.96 MB\n07. Concords  (03:29), 8.00 MB\n08. If Ever  (04:29), 10.28 MB\n09. Broken Home  (04:17), 9.81 MB\n10. Radio Silence  (06:11), 14.15 MB","torrent":{"xt":"urn:btih:629e9e36b835ad83080c505327798bc2651eb359","amp;dn":"Mount+Washington+-+2012+-+Mount+Washington+%5B320K%2FCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629e9e36b835ad83080c505327798bc2651eb359","infoHashBuffer":{"type":"Buffer","data":[98,158,158,54,184,53,173,131,8,12,80,83,39,121,139,194,101,30,179,89]},"announce":[],"urlList":[]}}