{"title":"Harry Harrison - The Stainless Steel Rat Series [1-11]","uid":13704702,"size":2644747636,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:62c695a286230da25e994f882750e29dced9b3fa&amp;dn=Harry+Harrison+-+The+Stainless+Steel+Rat+Series+%5B1-11%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Cybotage","files":310,"time":1456808536,"description":"\n\r\nThe Stainless Steel Rat is anti-hero James Bolivar diGriz, who goes by many aliases, including &quot;Slippery Jim&quot; and &quot;The Stainless Steel Rat&quot;. He is a futuristic con man, thief and all-round rascal. He is charming and quick-witted, a master of disguise and martial arts, an accomplished bank robber, an expert on breaking and entering, and (perhaps most usefully) a skilled liar. Highly intelligent, and a master of self-rationalization, the Rat frequently justifies his crimes by arguing that he is providing society with entertainment; and besides which, he only steals from institutions which have insurance coverage. He displays a strong morality, albeit in a much more restricted sense than is traditional. For example, diGriz will steal without compunction, but deplores killing.\r\n\r\n\r\nFrom the original publisher's blurb:\r\n\r\nWe must be as stealthy as rats in the wainscoting of their society. It was easier in the old days, of course, and society had more rats when the rules were looser, just as old wooden buildings have more rats than concrete buildings. But there are rats in the building now as well. Now that society is all ferrocrete and stainless steel there are fewer gaps in the joints. It takes a very smart rat indeed to find these openings. Only a stainless steel rat can be at home in this environment.\r\n\r\n\r\nThe character was introduced in Harrison's short story, &quot;The Stainless Steel Rat&quot;, which was first published in 1957 in Astounding magazine. The story introduces the Rat, who has just carried out a successful larceny operation, and subsequently details a complex bank robbery which the Rat pulls off with ease. However, he is outfoxed by the mysterious &quot;Special Corps&quot; — a crime-fighting organisation staffed with former criminals — and recruited by them in order to fight crime. Harrison used the story, with minor modifications, as the introduction to the series' first full-length novel, also called The Stainless Steel Rat. Like other characters created by Harrison, the Rat is a speaker of Esperanto and advocates atheism","torrent":{"xt":"urn:btih:62c695a286230da25e994f882750e29dced9b3fa","amp;dn":"Harry+Harrison+-+The+Stainless+Steel+Rat+Series+%5B1-11%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c695a286230da25e994f882750e29dced9b3fa","infoHashBuffer":{"type":"Buffer","data":[98,198,149,162,134,35,13,162,94,153,79,136,39,80,226,157,206,217,179,250]},"announce":[],"urlList":[]}}