{"title":"The Hills Have Eyes_DVD rip_Original Unrated Version_NL subs","uid":4613889,"size":3972165995,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6381f0e54f36fc5a6255babf7461a10505a815eb&amp;dn=The+Hills+Have+Eyes_DVD+rip_Original+Unrated+Version_NL+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DSpace9","files":2,"time":1230739927,"description":"The Hills Have Eyes - Original unrated version / dutch subs (1977) \n\nA family going to California accidentally goes through an Air Testing range closed to the public. They crash and are stranded in a desert. They are being stalked by a group of people, which have not emerged into modern times. \nWhile traveling in a trailer through the desert to California, the retired detective Big Bob Carter stops in an isolated gas station with his family for fueling and rest. Bob is traveling with his wife Ethel, his son Bobby, his daughters Brenda and Lynn and his son-in-law and Lynn's husband Doug and their daughter baby Katy. When they leave the gas station, the owner advises Bob to stay in the main road. However, the stubborn driver takes a shortcut through a nuclear testing site and wrecks his station wagon. With the family stranded in the middle of nowhere, Bob and Doug walk on the road trying to find some help. Bob is captured by an insane and sadistic member of a deranged evil family that lives nearby the spot. Doug returns to the trailer, and along the night the Carter family is attacked by a group of psychotic cannibal criminals. Absolutely trapped by the murderers, they have to fight to survive. \n","torrent":{"xt":"urn:btih:6381f0e54f36fc5a6255babf7461a10505a815eb","amp;dn":"The+Hills+Have+Eyes_DVD+rip_Original+Unrated+Version_NL+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6381f0e54f36fc5a6255babf7461a10505a815eb","infoHashBuffer":{"type":"Buffer","data":[99,129,240,229,79,54,252,90,98,85,186,191,116,97,161,5,5,168,21,235]},"announce":[],"urlList":[]}}