{"title":"The Foundations of Wealth Economics Documentary","uid":7297279,"size":1887882610,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:63db71c772dab102fb593cbbed4de336c77595fb&amp;dn=The+Foundations+of+Wealth+Economics+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kamchatka","files":-1,"time":1337921876,"description":"THE FOUNDATIONS OF WEALTH\n\nMost of us associate wealth with money but real wealth can only be achieved through the production and distribution of goods and services. This series of ten playful English segments will explain how society evolved in such a way to enable a huge increase in production to be achieved. Of course there were no television cameras or film crews available 10,000 years ago to record what happened, so this series uses cartoons to illustrate how things might have been all those years ago! Each cartoon section is followed by real-world images showing how this is relevant today.\n\nThe Foundations of Wealth is designed to help students understand what the subject of Economics is all about. Economic decisions are made every day even though students may not be aware of them. For example, all of us think about: How will I choose to spend my time today? How will I choose to spend my money? Who made the things I use? How were they made? This series of videos will help explain a great deal about the way in which these decisions are made. \n\nThe Foundations of Wealth was devised by Sir Antony Jay, author of comedy series &quot;Yes Minister&quot; and &quot;Yes Prime Minister&quot;. He is also founder, with John Cleese, of award winning training film producers Video Arts.  \n\n\nEPISODES\n\nEpisode 1. How It All Began (11 mins) \nKey concepts: subsistence level, subsistence economy, scarcity, surplus \n\nEpisode 2. Division of Labour - i. Product  (9 mins) \nKey concepts: organisation, specialisation, efficiency, investment, capital  \n\nEpisode 3. Division of Labour - ii. Process (10 mins) \nKey concepts: trade, productivity, exports and imports, production line \n\nEpisode 4. Mechanisation (10 mins) \nKey concepts: mechanical device, energy source, harnessing  \n\nEpisode 5. A Life Worth Living (11 mins) \nKey concepts:  cultivation, goods and services, natural resources, leisure \n\nEpisode 6. The Market (11 mins) \nKey concepts:  voluntary exchange, command economy, incentive \n\nEpisode 7. Money (11 mins) \nKey concepts: token of value, store of value, measure of wealth \n\nEpisode 8. Supply, Demand and Price - i. Price and the consumer (13 mins)\nKey concepts:  prices as information, law of demand, relative value \n\nEpisode 9. Supply, Demand and Price - ii. Price and the producer (13 mins) \nKey concepts: gluts and shortages, innovation, law of supply, equilibrium price \n\nEpisode 10. The Mixed Economy (11 mins) \nKey concepts: planned economy, market economy, public goods ","torrent":{"xt":"urn:btih:63db71c772dab102fb593cbbed4de336c77595fb","amp;dn":"The+Foundations+of+Wealth+Economics+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63db71c772dab102fb593cbbed4de336c77595fb","infoHashBuffer":{"type":"Buffer","data":[99,219,113,199,114,218,177,2,251,89,60,187,237,77,227,54,199,117,149,251]},"announce":[],"urlList":[]}}