{"title":"Peter Kawaja exposes Joyce Riley fraud NWO Zionist v2-1","uid":3695874,"size":330288848,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:6527cb01cb044a5e1ddba3e135c44d1fb29c1ff6&amp;dn=Peter+Kawaja+exposes+Joyce+Riley+fraud+NWO+Zionist+v2-1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theshop","files":28,"time":1179992242,"description":"During the Gulf Wars, the US American, and possibly troops of other nations who were also involved in the Gulf Wars, were experimented on by the Zionists who were using the US government as a front.  George Bush Sr was president and knew that these experiments were going on, as documented by Peter Kawaja.\n\nThe experiment was to develop a super-soldier, that is able to regrow missing limbs or blown off body parts. Peter Kawaja uses &quot;Universal Soldier&quot; as the example, which was to create a &quot;non-soulless soldier,&quot; which is to say, a mindless, or brainless, soldier that is able to heal himself and would regenerate body parts very fast.  \n\nThis experiment was conducted by &quot;reverse engineering.&quot; Instead of having soldiers grow extra limbs, therby understanding which parts of the human gene was reponsible for the regeneration, the scientists tried to produce soldiers with missing body parts, such as eyes, mouth, arms, etc.  The scientists identified which genes were responsible for the regrowth by figuring out which genes prevented the growth of body parts.\n\nThe deformed babies of the Gulf War Vets IS NOT FROM DEPLETED URANIUM. The defomed babies are the result of the, to quote Peter Kawaja, &quot;lucifarian and satanic zionist&quot; experiments.\n\nThe Depleted Uranium story is only partly true, namely, that DU was used during the Gulf wars and is still is in use.  However, DU story is a &quot;small truth&quot; purposely promoted by disinformation agents so that it would detract from the very evil experiments that were conducted on the US troops by the zionist perpatrators.  The disinformatoin agents, such as Joyce Riley and her zionist/Nazi hander Dave Von Kleist, are using the DU story to blame the babies&amp;#039; deformities so that people will never know about the regeneration experiments.\n\nPeter Kawaja was able to document the fact, during the Gulf Wars, scientists had already produced human bodies that grew animal faces and animal bodies with human faces.  The depleted uranium story is a disinformation promoted to keep everyone away from the various experiments that were going on and used the Gulf war troops as guinea pigs.\n\nAnother set of experiments were going on.  This one was to depopulate the world by a massive plague.  Peter Kawaja bugged the P.I.T. (product ingredient technology) plant that was located in Florida.  A Mr. Louise Champone and Dr. Ishan Barbouti were documented by Peter Kawaja to be involved in the testing of a hydrogen cyanide strain known as &quot;prussian blue&quot; that was able to leak into the gas masks.\n\nPeter Kawaja found that the Gulf War troops were infected by a hybrid HIV/ebola microbe that contained 40% of the HIV DNA contained in the microbes envelope.  This microbe is a communicable disease and is transmissible by casual contact, by sweat, and even by air.  The microbe lives indefinitely with a minimum of 7 years. Lime disease was sited by Peter Kawaja to be a derivative of this microbe.  A sexually transmissible cancer(such as HPV the human papaloma virus) was also sited as a derivative of the microbe.\n\nThe Gulf war troops were infected so that they could return to the general population and infect the general population.  The equipment and gear from the Gulf War are also contaminated with this microbe, and as a result, millions of people world wide are also carriers of this microbe.\n\nThe microbe is in a dormant state, which means, it does not attack the human cells yet.  However, the microbe is constantly mutating and therefore, the immune system cannot properly fight this microbe.  Part 2 is predicted by Peter Kawaja to be a chemical of some type, perhaps the prussian blue that was being under experiment, to contaminate the water supplies or spread to the populace by chemtrais, much the same way Japan had infect the Chinese with bubonic plague by flying airplanes over the civilians.\n\nWhen this microbe reacts with the part 2 chemical, it will become active.  The end result is an ebolic death, where the person dies by bleeding to death.  This will cause a world-wide epidemic and UN or some organization controlled by the zionists will step in to &quot;solve the crisis.&quot;\n\nThere will be a treatment available, NOT A CURE, but this treatment will only be available to those who take the medical/national ID chip, or as Peter Kawaja refers to it, the Mark of the Beast.  People everywhere will be quaranteened.  Those who do not take the medical/national ID will be hunted down by the zionists and killed(murdered). Those who do not get treatment will bleed to death from the disease microbe.  People will turn in their family and friends to these zionists in order to survive.  After the zionists kill those who do not accept the medical/national ID chip/card, they will be called heroes by those who survive for solving the plague problem.  The one world government will be in place, along with a one world satanic religion.\n\nThe vaccine stories, Reigle report, anthrax stories, depleted uranium stories, micoplasma incognitus stories, and other &quot;contagious disease&quot; stories are ALL DISINFORMATION.  Many are already fooled by them.  The globalists DON&amp;#039;T want you to know about the coming world wide plague, NOR the experiments of regeneration that played and is still playing part to the plot against people everywhere to prepare them for the New World Order that the talmudists/zionists/satanists are pushing forth.\n\nJoyce Riley and her handler Dave Von Kleist have done much to spread disinformation. DO NOT FALL FOR THEIR ZIONIST TRICKS! Spread this information!\n\nTwo doctors, Rebecca Carley and Garth Nicholson, have worked with Joyce Riley and the US ZOG(zionist occupied governemnt) in order to discredit Peter Kawaja.  Both have been discovered by Peter Kawaja to be working with the government, before he was murdered.  This is why Dr. Garth Nicholson refers to his close friendly contact as &quot;George,&quot; refering to George Bush.  They worked with Joyce Riley to minimize what Peter Kawaja was saying, so that once people were disillusioned enough, they could erase even the name &quot;Peter Kawaja&quot; from any media, including the internet.  This is why there is almost NOTHING about what the real Peter Kawaja has unconvered and DOCUMENTED.  The perpetrators have had success suppressing his information and steering everyone away from the real Gulf War story.\n\nThe SAME crew involved in the Gulf War crimes were behind WACO, Murrah OKC building bombing, USS Libert attack by Israel, the cover up of these facts, 911 terror attack, etc.  There is just TOO many crimes by these evil talmudists(zionists).  THE SAME PEOPLE ARE STILL COMMITTING SIMILAR CRIMES(Londond 7/7 bombing, iraqi(who was really a crypto-israeli) sniper, etc)!\n\nJoyce Riley, Rebecca Carley, Garth Nicholson, and the whole disinfo crimials keep insisting that the US officials were incompetent and trusted Saddam Hussain and sold bio/chem weapons to him, and that Saddam is the one who infected the troops.  THE DISEASE WAS NOT IN THE SCUDS!  THE MICROBES WERE IN THE PATRIOT MISSILES, AMMUNITION, AND EQUIPMENTS THAT THE GULF WAR TROOPS WERE HANDLING!\n\nThe &quot;US sold Saddam weapons and he used it against US&quot; story is a fall back story, deliberately to keep everyone thinking that US was INDIRECTLY involved in the crimes.  In reality, it was the zionist US government that had been DIRECTLY involved, planned and executed.  It was the AMERICAN ZOG government that had infected and experimented on the gulf war troops, NOT SADDAM.\n\nThe current impersonator of Peter Kawaja is exactly that: an impersonator.  The real Peter Kawaja would NEVER agree with what Joyce Riley or Dr. Garth Nicholson are saying, because he found them out to be disinformers and psy-op agents.  And yet, the current person who claims to be Peter Kawaja is saying the same things that Riley and Nicholson is saying.  DON&amp;#039;T FALL FOR THEIR TRICKS!\n\nPray for America. Pray for YOUR COUNTRY. Pray for your leaders.","torrent":{"xt":"urn:btih:6527cb01cb044a5e1ddba3e135c44d1fb29c1ff6","amp;dn":"Peter+Kawaja+exposes+Joyce+Riley+fraud+NWO+Zionist+v2-1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6527cb01cb044a5e1ddba3e135c44d1fb29c1ff6","infoHashBuffer":{"type":"Buffer","data":[101,39,203,1,203,4,74,94,29,219,163,225,53,196,77,31,178,156,31,246]},"announce":[],"urlList":[]}}