{"title":"Journey to 10,000 BC  (History Channel)","uid":6107136,"size":1086043184,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67364df58629ace81f7f1d21b5943854d2fddba1&amp;dn=Journey+to+10%2C000+BC++%28History+Channel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":2,"time":1295207250,"description":"Movies : Documentary : DVD Rip : English\n\nJOURNEY TO 10,000 BC and experience the suspense and heart-pounding action of a woolly mammoth hunt. A single kill could feed the tribe for weeks. As the winters grow curiously colder and longer, this vital source of nourishment becomes even more critical.\n\nTHE HISTORY CHANNELÃ‚Â® has pulled out all the stops to dramatize on a human scale the changes on Earth twelve thousand years ago. Experience the land where giant ground sloths, great saber-toothed cats, and camels roamed. Witness their extinctions and live through the cataclysms that we are only now beginning to understand.\n\nThe Hollywood epic 10,000 BC tells a dramatic story of woolly mammoth hunt, but this groundbreaking program from THE HISTORY CHANNELÃ‚Â® offers the authoritative chronicle of the world as it was then and the events that changed it forever. Convincing green-screen dramatizations and location filming evoke the prehistoric times. And modern segments reveal the cutting-edge research that is vastly improving our understanding of what changed the Earth forever in 10,000 BC.\n\nYou will be as surprised by the scientific revelations of JOURNEY TO 10,000 BC as you will be moved by its compelling reconstructions of a long-lost world.","torrent":{"xt":"urn:btih:67364df58629ace81f7f1d21b5943854d2fddba1","amp;dn":"Journey+to+10%2C000+BC++%28History+Channel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67364df58629ace81f7f1d21b5943854d2fddba1","infoHashBuffer":{"type":"Buffer","data":[103,54,77,245,134,41,172,232,31,127,29,33,181,148,56,84,210,253,219,161]},"announce":[],"urlList":[]}}