{"title":"Transvision Vamp - Baby I Don't Care.mpg","uid":5102845,"size":88969220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6764572832de1f862345aca43d353594af6082ab&amp;dn=Transvision+Vamp+-+Baby+I+Don%5C%27t+Care.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":-1,"time":1254129870,"description":"Transvision Vamp were a popular British alternative rock group. Formed in 1986 by Nick Christian Sayer and Wendy James the band enjoyed chart success in the late 1980s. James, the lead singer and focal-point of the group, attracted media attention with her sexually-charged and rebellious image.\n\nThe band's original lineup was James, Sayer, Dave Parsons (bass), Tex Axile (keyboards) and Pol Burton (drums). [1] Parsons and Axile had both been in punk bands prior to joining the band - Parsons in The Partisans, and Axile in various bands, most notably The Moors Murderers and X-Ray Spex offshoot Agent Orange. \nThe band were signed by MCA and released a cover single of the Holly and the Italians' song &quot;Tell That Girl to Shut Up&quot; in April 1988, but it only reached number 45 on the UK Singles Chart. A month later the follow-up single &quot;I Want Your Love&quot;, with its pop/punk crossover appeal, entered the top 10, and peaked at number 5 in the United Kingdom. Minor success was achieved with 2 further singles, titled &quot;Revolution Baby&quot; and &quot;Sister Moon&quot;, which reached 30 and 41 respectively on the UK Singles Chart in 1988. The band went on to release the hit album Pop Art in October. It stayed on the album chart for 32 weeks, peaking at number 4\n\nPol Burton left the band after touring to promote the debut album, and was replaced for live appearances by Martin Hallett (aka Mallett). Guitarist James &quot;Jazz&quot; Piper was also added to the live lineup..\n\n1989 was the band's most successful year, with the number 3 hit single &quot;Baby I Don't Care&quot; and hit album Velveteen, which went entered the UK Albums Chart at #1 and stayed on the chart for 26 weeks. \nIn 1990 MCA refused to release Transvision Vamp's third album Little Magnets Versus the Bubble of Babble in the UK, reportedly disliking the mellower direction of the music.[citation needed] Wendy James has stated &quot;...it came out in America and did better than the other two albums in America. But then we decided to split up, during which time the English record label had said they weren't convinced about this record, we're going to hold off on it and see how well it does in other countries first. By the time they were ready to release it, we'd already decided to split up, and so it never came out.&quot;\n\n\n\nClassic from 1989\n\n\n\nEnjoy\n","torrent":{"xt":"urn:btih:6764572832de1f862345aca43d353594af6082ab","amp;dn":"Transvision+Vamp+-+Baby+I+Don%5C%27t+Care.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6764572832de1f862345aca43d353594af6082ab","infoHashBuffer":{"type":"Buffer","data":[103,100,87,40,50,222,31,134,35,69,172,164,61,53,53,148,175,96,130,171]},"announce":[],"urlList":[]}}