{"title":"Nelly Furtado feat. Concha Buika - Fuerte(Xvid-2nafish)1080p","uid":5935615,"size":129977212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:695c34500cd229204d503a3c8fd8463892a63d7d&amp;dn=Nelly+Furtado+feat.+Concha+Buika+-+Fuerte%28Xvid-2nafish%291080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1288932831,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:02:56\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 5556 Kbps\nQuality Factor : 0.11 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nNelly Furtado feat. Concha Buika - Fuerte (English Version) (Xvid-2nafish)1080p\n\n\n\nThis video has no logo and is the English Version with some Spanish. 'Spanglish'\n\n\n\n&quot;Fuerte&quot; (English: Strong) is a song recorded by Canadian singer-songwriter Nelly Furtado and singer Concha Buika for Furtado's first full-length spanish album Mi Plan (2009). It was written by Nelly Furtado, Alex Cuba and James Bryan and was produced by Salaam Remi.\n\nThe music video for &quot;Fuerte&quot; was directed by Richard Bernardin, Robacho Buika and Aaron A.\n\nIn the video, Furtado is shown in various elegant dresses wondering around a lavishly decorated house before descending into it's indoor swimming pool as the chorus begins. During the second and third choruses, Concha Buika also features, though appearing separately from Furtado, standing at the bottom of a staircase in a more modern-day building.\n\nThe song reached number 3 on the Billboard Hot Dance Club Songs chart without any promotion. It was said to be the summer club single for Mi Plan, however, the release was delayed. It was officially released on October 26.\n\nIt tells of a woman who's strong without her lover; strong enough not to need him, and she doesn't want to think about the past. So she moves on, and now that he wants her back, she refuses - showing her strength as a woman.\n\nMi Plan (Spanish: My Plan) is the first full-length Spanish studio album, and fourth overall by Portuguese-Canadian singer-songwriter Nelly Furtado. It was released in North America on September 15, 2009 by Universal Music Latino. The album was produced primarily by Furtado with contributions by James Bryan, Lester MÃƒÂ©ndez, Salaam Remi, The Demolition Crew and Brian West.\n\nOn December 31, 2008, El Diario La Prensa posted an article that Furtado is planning on recording songs in English and Spanish for her upcoming album and that it is &quot;expected to launch between May and August.&quot; In early March, a song called &quot;Gotta Know&quot; leaked in the internet and was said to be Furtado's. As response, on March 4, 2009, Furtado stated on her MySpace blog that the song is not hers and that she is recording two new albums: one in Spanish, and the other in Portuguese. In June 2009, Furtado announced that her new album will be titled Mi Plan and the first single titled &quot;Manos al Aire&quot;.\n\nThe album was nominated for Best Pop Female Vocal Album in the 2010 Latin Grammys and has received generally positive reviews from most music critics. It It was supported by the Latin American Mi Plan Tour.\n\nOn June 30, 2009, &quot;Manos al Aire&quot; was released to worldwide radio as the lead single from the album with digital and mobile retail availability the next day. It was Furtado's first single to top the U.S. Billboard Top Latin Tracks. With the song, Furtado made history by becoming the first North American artist to reach number one on the Billboard Hot Latin Tracks chart with an original Spanish song that was not tranlated from another language. &quot;MÃƒÂ¡s&quot; was the second single released from the album. It was released as a download-single on December 18, 2009 in Germany. &quot;Bajo Otra Luz&quot; was released to radio on May 4, 2010 and it was the least successful single having not charted on any chart. &quot;Fuerte&quot; is the fourth overall and final single from the album and the lead single for Mi Plan Remixes, released to radios on October 26, 2010. In June 2010, a ten track remix promo was released that features a Spanglish remix of the song done by Cajjmere Wray. The song reached number three on the Billboard Hot Dance Club Songs without any promotion.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:695c34500cd229204d503a3c8fd8463892a63d7d","amp;dn":"Nelly+Furtado+feat.+Concha+Buika+-+Fuerte%28Xvid-2nafish%291080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695c34500cd229204d503a3c8fd8463892a63d7d","infoHashBuffer":{"type":"Buffer","data":[105,92,52,80,12,210,41,32,77,80,58,60,143,216,70,56,146,166,61,125]},"announce":[],"urlList":[]}}