{"title":"Great Bear-A Journey Remembered-Frederick B. Watt","uid":9521404,"size":31209293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6cb46f280659ddf016f52cfecda823e6dabfecd7&amp;dn=Great+Bear-A+Journey+Remembered-Frederick+B.+Watt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1390643352,"description":"Format: PDF Searchable, scanned from hardcover book and cleaned up. Out of print.\n\n\nGreat Bear-A Journey Remembered by Frederick B. Watt [1980]\n\n\nGreat Bear. The name had magic in the early 1930s. It sparked a great mining rush in Canada, sending men North in desperate search of riches. The news of Gilbert LaBine's strike - pitchblende, the glossy, black mineral that sold for hundreds of dollars an ounce - was a beacon in the bleakest days of the Depression. But Great Bear Lake- 12 000 square miles of dark , cold water, frozen most of the year - was unimaginably cruel to those whose dreams were based on romantic hopes of &quot;Eldorado&quot;. \nThis is the story of one man who went to Great Bear. Ted Watt went in desperation and in hope, like the others. And he made passage through a savage landscape - both of the implacable lake itself, and of the mind and heart. He takes us with him across the frozen, gale-swept face of Great Bear, to the edge of human endurance. Along the way, he saw men and events with a disciplined reporter's eye. Here are the colourful giants of those early days , mining men and bushpilots, native chiefs and lone prospectors. This is the record of one man's journey to Great Bear, a surprising and moving account of Ted Watt's struggle to survive and to grow. Great Bear is very much a book for the eighties.\n\nFrederick B. Watt was deeply involved in the daredevil adventures of the bush fliers who opened up Canada's uncharted Northwest Territories. As a reporter, he rode the frozen skies with Punch Dickins and Wop May, whose rugged single-engine planes forged vital supply routes between isolated settlements, paving the way for development of Northern resources. He was born in Woodstock, Ontario, but his family went West in 1905 to the new province of Alberta. Steeped in the lore of a brawling land, he took naturally to writing and by the late 1920s was contributing fiction and articles to Maclean's, Collier's, Country Gentleman, and the Canadian Home Journal.\nHe served with Naval Intelligence in World War II, emerging as Lieutenant Commander Frederick B. Watt, M.B.E. From\n1957 to 1969 he was with the information branch, Health and Welfare, Ottawa.\nHe has authored or contributed to four previous books, most notably Who Dare to Live (Macmillan, 1943), a book length narrative poem of fighting men at sea. It sold widely and was broadcast on CBC and NBC radio.\nMr. Watt lives in Victoria, B.C., with his wife, Ernestine. He writes regularly, and contributes to radio and television.","torrent":{"xt":"urn:btih:6cb46f280659ddf016f52cfecda823e6dabfecd7","amp;dn":"Great+Bear-A+Journey+Remembered-Frederick+B.+Watt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cb46f280659ddf016f52cfecda823e6dabfecd7","infoHashBuffer":{"type":"Buffer","data":[108,180,111,40,6,89,221,240,22,245,44,254,205,168,35,230,218,191,236,215]},"announce":[],"urlList":[]}}