{"title":"BitDefender Total Security 2008 V11.0.15+Keygen(Patch)","uid":4382465,"size":48994478,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e255d256c15ca88473b6ad42c750f2bdd06a8a6&amp;dn=BitDefender+Total+Security+2008+V11.0.15%2BKeygen%28Patch%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vibept","files":5,"time":1220729768,"description":"+++++++++++++++++++++++++++++++++++++++++++++\n\nBitDefender Total Security 2008 V11.0.15\n+++++++++++++++++++++++++++++++++++++++++++++++\n\nOverview\nBitDefender Total Security 2008 provides the ultimate proactive protection for your PCs. It combines state of the art protection against viruses, spyware, hackers, spam and other Internet security threats. Moreover, its system maintenance and PC backup tools keep your PC running fast and protected from data loss.\n\nTop features\n\n   * State of the art proactive protection against new viruses\n   * Protects against phishing attacks by filtering all accessed web pages for fraud attempts\n   * Helps prevent unauthorized access to your Wi-Fi network\n   * New adaptive engines detect &amp; block spam faster and more reliably than ever\n   * Parental control blocks access to inappropriate websites and e-mail\n   * Automated incremental backup backup copies your data to local or removable drives for safekeeping\n   * Tune-up module improves PC performance\n\n\nANTIVIRUS &amp; ANTISPYWARE\n\n   * Protects your PC in real time from known viruses, spyware and other malware with hourly updates\n   * Blocks unknown viruses using advanced proactive detection techniques\n   * Monitors and prevents spyware threats in real-time\n   * Detects and removes the newest breed of hidden threats known as rootkits\n   * Provides a smooth gaming experience by reducing the system load to a minimum\n\nANTI-PHISHING\n\n   * Protects against phishing attacks by filtering all accessed web pages for fraud attempts\n   * Reduces the risk of identity theft by preventing personal information leaks via e-mail or web.\n\nFIREWALL\n\n   * Controls applications? access to the Internet while ?hiding? your computer from hackers\n   * Helps prevent unauthorized access to your Wi-Fi network by notifying you when computers log in to the network.\n\nANTISPAM\n\n   * Prevents different types of spam and scam e-mails from reaching your Inbox\n   * Now responds faster to new spamming techniques with new adaptive engines\n\nPARENTAL CONTROL\n\n   * Blocks access to inappropriate websites and e-mail\n   * Allows or blocks web access during specified time periods\n\nBACKUP\n\n   * Safeguards your data by creating backup copies to local and removable drives, CD-R/RW or DVD-R/RW\n   * Automatically backs up only new files, based on a pre-set schedule.\n\nTUNE-UP\n\n   * Improves your PC performance by removing unnecessary files and registry entries\n   * Completely erases files and &quot;traces&quot; of files from disk to prevent recovery\n\n\nSystem Requirements\n\n   * Windows 2000 with Service Pack 4\n   * Windows XP with Service Pack 2 (32/64 bit)\n   * Windows Vista (32/64 bit)\t\t","torrent":{"xt":"urn:btih:6e255d256c15ca88473b6ad42c750f2bdd06a8a6","amp;dn":"BitDefender+Total+Security+2008+V11.0.15%2BKeygen%28Patch%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e255d256c15ca88473b6ad42c750f2bdd06a8a6","infoHashBuffer":{"type":"Buffer","data":[110,37,93,37,108,21,202,136,71,59,106,212,44,117,15,43,221,6,168,166]},"announce":[],"urlList":[]}}