{"title":"BWMeter 4.1.2","uid":4357120,"size":581695,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e71b7f561a067da83a1443fbaa3bbdfe0adcdf5&amp;dn=BWMeter+4.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jodyanne","files":3,"time":1219461287,"description":"Screenshot: &lt;a href=&quot;\nhttp://jody.hopto.org/imagehost/images/jody/wmeter4.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jody.hopto.org/imagehost/images/jody/wmeter4.gif&lt;/a&gt;\n\nInfo:\nBWMeter is a powerful bandwidth meter, monitor and traffic controller, which measures, displays and controls all traffic to/from your computer or on your network. Unlike other products, it can analyze the data packets (where they come from, where they go, which port and protocol they use). This makes it possible to distinguish between local and internet traffic for example. BWMeter can also be used for traffic control by setting a speed limit for all kinds of connections or restricting access to certain internet sites. It creates statistics for all computers in your network, measuring and displaying all LAN traffic as well as download / upload from the internet. You can even define filters which show your transfer with certain internet addresses (e.g. to see how much data you download from your favorite news server). BWMeter is ideal for home users to get an overview of how much bandwidth they use, as well as small to large businesses, where one computer can control the traffic and maintain the statistics of downloaded / uploaded data of all computers in the network. The product is easy to configure and offers a rich set of options and features for beginners as well as experts and network administrators.\n\nFeatures:\nGraphical and numerical display of bandwidth\nUser definable filters for measuring bandwidth\nUser definable graphs to visualize bandwidth\nCan monitor all network interfaces / adapters\nCan monitor and display all traffic on the network\nTraffic control, access control and speed limits\nCreates daily, weekly, monthly and yearly statistics\nShows statistics of other computers running BWMeter\nAlerts and notifications\nCreates statistics of all local network and internet traffic\nShows hostile internet traffic (hackers, viruses, etc.)\nStatistics can be exported / imported\nEasy installation and configuration with default options\nSupports LAN, WAN, VPN, ADSL, xDSL, Modem, Dial-Up, etc.\nCan run as a Service (Windows NT, 2000, XP and 2003 only)\nAbsolute flexibility\nMany options for full customization\nand much more...\n\nSystem requirements:\nWindows 95, 98, ME, NT 4.0, 2000, XP, 2003 or Vista, 32 bit only\n\nVersion 4.1.2 (20.08.08)\n* Fix: fixed setup problems for user accounts with special characters\n* Fix: fixed problems with license activation on certain configurations","torrent":{"xt":"urn:btih:6e71b7f561a067da83a1443fbaa3bbdfe0adcdf5","amp;dn":"BWMeter+4.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e71b7f561a067da83a1443fbaa3bbdfe0adcdf5","infoHashBuffer":{"type":"Buffer","data":[110,113,183,245,97,160,103,218,131,161,68,63,186,163,187,223,224,173,205,245]},"announce":[],"urlList":[]}}