{"title":"Miranda Lambert - New Strings","uid":4639229,"size":135075844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:70c24041cc5c21604265873e0b7167456d369467&amp;dn=Miranda+Lambert+-+New+Strings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1231663733,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nMiranda Lambert (b. November 10, 1983, Lindale, Texas) is a two time Grammy Award nominated American country music artist who gained fame as a finalist on the 2003 season of Nashville Star, where she finished in third place and later signed to Epic Records. Lambert made her debut with the release of &quot;Me and Charlie Talking&quot;, the first single from her 2005 debut album Kerosene. This album, which was certified Platinum in the United States, also produced the singles &quot;Bring Me Down&quot;, &quot;Kerosene&quot;, and &quot;New Strings&quot;. All four singles were Top 40 hits on the Billboard Hot Country Songs charts.\n\nLambert was transferred to Columbia Records Nashville for her second album, Crazy Ex-Girlfriend, which was released in early 2007. Although its first single (the title track) failed to make top 40, the next two singles (&quot;Famous in a Small Town&quot; and &quot;Gunpowder &amp; Lead&quot;) became her highest-charting singles, with the latter becoming her first Top Ten country hit in July 2008.\n\nIn 2003, Lambert auditioned for the talent competition Nashville Star, eventually becoming a third-place finisher on the show. On September 15, 2003, she signed with Epic Records; her debut single, &quot;Me and Charlie Talking&quot; (co-written by her father and Heather Little), was released in summer of 2004 as the lead-off single to her debut album. Titled Kerosene, Lambert's first album comprised twelve songs, eleven of which she co-wrote. The album debuted at number one on the Billboard Top Country Albums charts, and eventually gained a Platinum certification by the RIAA for shipments of over one million copies, selling more than 930,000 copies up to July 2008. Overall, the album produced four Top 40 singles on the Billboard country charts, including the title track which was a Top 20 hit. Lambert also toured with Keith Urban and George Strait in early 2006. In 2007, she toured with Dierks Bentley and Toby Keith.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:70c24041cc5c21604265873e0b7167456d369467","amp;dn":"Miranda+Lambert+-+New+Strings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70c24041cc5c21604265873e0b7167456d369467","infoHashBuffer":{"type":"Buffer","data":[112,194,64,65,204,92,33,96,66,101,135,62,11,113,103,69,109,54,148,103]},"announce":[],"urlList":[]}}