{"title":"Return to the Forbidden Planet (1989 original London cast)","uid":8118269,"size":85145177,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:712379c1558a0c0a309d00ee05f979c10c3edff9&amp;dn=Return+to+the+Forbidden+Planet+%281989+original+London+cast%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PiperK","files":24,"time":1360339233,"description":"Return To the Forbidden Planet\n\nby Bob Carlton : Based - very loosely on the 1956 film Forbidden Planet which was a sci-fi version of William Shakespeare's The Tempest.\n\nCambridge Theatre, London - September 18, 1989 (1516 perfs)\n\nSummary:\n\nOn a stormy night way back in the winter of 2009, mad scientist Doctor Prospero worked late in his laboratory, aided only by his wife, Gloria, as he developed the elusive formula with which he would change the world. The apparently faithful Gloria, however, duped him and sent him off into hyper-space in an old spacecraft. Unknown to Gloria, her infant daughter, Miranda, slumbered peacefully in the craft and was now catapulted light years into the future in her father's company. Fifteen years later, a routine survey flight under the command of the chisel-jawed Captain Tempest leaves earth's orbit with a new Science Officer aboard - a hard and bitter woman. As a shower of meteorites hits the ship, the Science Officer flees, and the craft is pulled inexorably towards the plant D'Illyria - the Forbidden Plant. The adventure begins .......\n\n\nBlast off on a routine flight and crash into the planet D'Illyria where a sci fi version of The Tempest set to rock and roll golden oldies unfolds with glee. The planet is inhabited by a sinister scientist, Dr. Prospero; his delightful daughter Miranda; Ariel, a faithful robot on roller skates; and an uncontrollable monster, the product of Prospero's Id, whose tentacles penetrate the space craft.\n&quot;A masterpiece.... Take one plot (Shakespeare's The Tempest), one B movie (Forbidden Planet) and for added flavor plunder the entire Shakespearean cannon for dialogue (the more pungent the plagiarism, the more piquant the final effect).... Your favorite blasts from the past ... ring out of the story with such unadulterated audacity that the cue lines themselves beg for mercy.&quot; - What's On\n\n\n&quot;Prepare to dance in the aisles.&quot; - Time Out\n\n&quot;The best rock and roll show in town.... You just have to laugh at the death defying puns ... and the way the songs are worked into the plot with perfect logic.&quot; - Daily Express\n\n&quot;Tacky, camp, irreverent and-- frankly enjoyable..... A cult hit.&quot; - Daily Mail\n\n&quot;An outbreak of fun and joy.... It is irresistible.&quot; - Jewish Chronicle\n\nRETURN TO THE FORBIDDEN PLANET first appeared at the Cambridge Theatre on September 11, 1989.","torrent":{"xt":"urn:btih:712379c1558a0c0a309d00ee05f979c10c3edff9","amp;dn":"Return+to+the+Forbidden+Planet+%281989+original+London+cast%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"712379c1558a0c0a309d00ee05f979c10c3edff9","infoHashBuffer":{"type":"Buffer","data":[113,35,121,193,85,138,12,10,48,157,0,238,5,249,121,193,12,62,223,249]},"announce":[],"urlList":[]}}