{"title":"An Introduction to Molecular Medicine and Gene Therapy","uid":6921211,"size":4615878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:716e16f14c56d4675320fbda0d47bb6061b26c7f&amp;dn=An+Introduction+to+Molecular+Medicine+and+Gene+Therapy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"playmee","files":1,"time":1325229734,"description":"Gene therapy, or the use of genetic manipulation for disease treatment, is derived from advances in genetics, molecular biology, clinical medicine, and human genomics. Molecular medicine, the application of molecular biological techniques to disease treatment and diagnosis, is derived from the development of human organ transplantation, pharmacotherapy, and elucidation of the human genome. An Introduction to Molecular Medicine and Gene Therapy provides a basis for interpreting new clinical and basic research findings in the areas of cloning, gene transfer, and targeting; the applications of genetic medicine to clinical conditions; ethics and governmental regulations; and the burgeoning fields of genomics, biotechnology, and bioinformatics. By dividing the material into three sections - an introduction to basic science, a review of clinical applications, and a discussion of the evolving issues related to gene therapy and molecular medicine-this comprehensive manual describes the basic approaches to the broad range of actual and potential genetic-based therapies.\n\nIn addition, An Introduction to Molecular Medicine and Gene Therapy:\n\nCovers new frontiers in gene therapy, animal models, vectors, gene targeting, and ethical/legal considerations\nProvides organ-based reviews of current studies in gene therapy for monogenetic, multifactoral or polygenic disorders, and infectious diseases\nIncludes bold-faced terms, key concepts, summaries, and lists of helpful references by subject in each chapter\nContains appendices on commercial implications and a review of the history of gene therapy\nThis textbook offers a clear, concise writing style, drawing upon the expertise of the authors, all renowned researchers in their respective specialties of molecular medicine. Researchers in genetics and molecular medicine will all find An Introduction to Molecular Medicine and Gene Therapy to be an essential guide to the rapidly evolving field of gene therapy and its applications in molecular medicine.","torrent":{"xt":"urn:btih:716e16f14c56d4675320fbda0d47bb6061b26c7f","amp;dn":"An+Introduction+to+Molecular+Medicine+and+Gene+Therapy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"716e16f14c56d4675320fbda0d47bb6061b26c7f","infoHashBuffer":{"type":"Buffer","data":[113,110,22,241,76,86,212,103,83,32,251,218,13,71,187,96,97,178,108,127]},"announce":[],"urlList":[]}}