{"title":"A Death in the Family (TV) [2002] Annabeth Gish","uid":6064642,"size":732806083,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:71f958aff8b53ebd3bd062b145e1c2f47fb95faf&amp;dn=A+Death+in+the+Family+%28TV%29+%5B2002%5D+Annabeth+Gish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1293293776,"description":" &lt;a href=&quot;http://bayimg.com/PaBAKAAdL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PaBAKAAdL&lt;/a&gt;\n\nA Death in the Family (TV 2002) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0251042/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0251042/&lt;/a&gt;\n\n  Annabeth Gish  ...  Mary Follet  \n  John Slattery  ...  Jay Follet  \n  Austin Wolff  ...  Rufus Follet  \n  Kathleen Chalfant  ...  Aunt Hannah  \n  Christopher Strand  ...  Ralph Follet  \n  Bill Raymond  ...  Father Jackson  \n  Matthew Carlton  ...  Walter Starr  \n  Margaret Askew  ...  Catherine Lynch  \n  James Cromwell  ...  Joel Lynch  \n\nA Death in the Family is an autobiographical novel by author James Agee, set in Knoxville, Tennessee. He began writing it in 1948, but it was not quite complete when he died in 1955. It was edited and released posthumously in 1957 by editor David McDowell. Agee's widow and children were left with little money after Agee's death and McDowell wanted to help them by publishing the work. Agee won the Pulitzer Prize for Fiction in 1958 for the novel. Time included the novel in its Time 100 Best English-language Novels from 1923 to 2005.\n\nIt is the lazy summer of 1915. Jay and Mary Follet live in Knoxville, Tennessee, with their bright, sensitive 7-year-old son, Rufus, who idolizes his father. The Follets lead an idyllic middle-class life, troubled only by a low-level conflict between Mary's Catholic piety and Jay's love for innocent pleasures, such as a dapper hat, an occasional drink, and outings with Rufus to see Charlie Chaplin movies.\n\nRufus, naturally, takes his father's side.\n\nJay and Mary are close to her family, which includes her Aunt Hannah and her painter brother Andrew. Jay's difficult father lives on the family farm 40 miles away; his brother Ralph is a self-pitying alcoholic.\n\nAt 3:30 one morning Ralph calls to tell Jay their father is dying. When Jay arrives at the farm, he finds his father as cantankerous as ever and his brother half drunk. \n\nMary receives a phone call, summoning a man that's kin to a serious accident involving Jay, with no details given. After a long wait, Mary's brother Andrew finally returns with the dreaded news that Jay has been killed. \n\nIt is left for Mary to tell Rufus his father is dead. At first the boy does not know what to make of it. When a sanctimonious priest tells Mary that her husband cannot have a full Catholic service because he was not baptized in the Church, Rufus reacts with fury. \n\nThe funeral service is a blur for the little boy, but as the long day draws to a close, Mary looks down from the bedroom window and sees Rufus watering the lawn, a chore that had belonged exclusively to Jay. After Rufus learns of a miracle witnessed at the funeral by his Uncle Andrew, we see that he has grown up in a way he will not understand for years.\n\nAgee contrasts the mystery and wonder of death as experienced by Rufus with the grownups' more complex reactions: Andrew's anger at the Church; Ralph's guilt for summoning Jay to his fatal appointment; Aunt Hannah's vindication that now someone else is suffering as she has; and Mary's determination to accept her faith uncritically -- in spite of the Church's failure to offer its full comfort -- and to sweep Rufus into its smothering embrace. \n\n","torrent":{"xt":"urn:btih:71f958aff8b53ebd3bd062b145e1c2f47fb95faf","amp;dn":"A+Death+in+the+Family+%28TV%29+%5B2002%5D+Annabeth+Gish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f958aff8b53ebd3bd062b145e1c2f47fb95faf","infoHashBuffer":{"type":"Buffer","data":[113,249,88,175,248,181,62,189,59,208,98,177,69,225,194,244,127,185,95,175]},"announce":[],"urlList":[]}}