{"title":"Strike Witches","uid":9374205,"size":20024806811,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7243f88b24ef6c73b5337065af7707a86ce06384&amp;dn=Strike+Witches&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chouhi","files":-1,"time":1387590483,"description":"The year is 1944 and the world lives in fear of unidentified flying objects called Neuroi. With the old-boy old guard unable to thwart this deadly menace, humanity turns its desperate eyes to an aerial attack force with much nicer legs. Meet the girls of the 501st Joint Fighter Wing, better known as the Strike Witches. These darlings of the great blue yonder may not have standard issue uniforms, but they do have all the right stuff. Where the average flyboy falters, these dolls blast aliens to bits in the bat of an eyelash. With a little magic and a whole lot of leg, the girls of the 501st are winning the war on pants, and aliens!\n\nAfter discovering that Neuroi are capable of communication with humans and making peace with the nest above Gallia the Witches squads are now on a mission to re-establish communication when a sudden attack vanishes the Neuroi; they now discover a new and massive nest that just appeared covering almost all Europe. Ruthless and without mercy it annihilates allied forces along with Witches. Word of the attack reaches Fuso and a support battalion is deployed to rescue the survivors. Among the rescue team is the former Striker captain Mio Sakamoto and the now civilian Yoshika Miyafuji who want to save their dear friends.\n","torrent":{"xt":"urn:btih:7243f88b24ef6c73b5337065af7707a86ce06384","amp;dn":"Strike+Witches","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7243f88b24ef6c73b5337065af7707a86ce06384","infoHashBuffer":{"type":"Buffer","data":[114,67,248,139,36,239,108,115,181,51,112,101,175,119,7,168,108,224,99,132]},"announce":[],"urlList":[]}}