{"title":"Astrud_Gilberto_3_LPs.rar","uid":4948226,"size":165901988,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:726a5cd0a00a7d1bedd14cabc376772debc40877&amp;dn=Astrud_Gilberto_3_LPs.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothman7","files":1,"time":1244757232,"description":"3 great albums by the legendary Astrud Gilberto all encoded at 320kbps mp3\n\n1. A certain smile a certain sadness (classic and brilliant album)\n2. Self titled, with Turrentine - 1973 (great band on this album)\n3. I haven't got anything better to do (this one is probably my favorite, but all three are must haves)\n\n\nAstrud Gilberto was born Astrud Weinert, the daughter of a Brazilian mother and a German father, in the state of Bahia, Brazil, and was raised in Rio de Janeiro. In 1959, she married JoÃƒÂ£o Gilberto, later emigrating to the United States in 1963. They eventually divorced in the mid-1960s.\n[edit]Career\n\nShe sang on the influential album Getz/Gilberto featuring JoÃƒÂ£o Gilberto, Stan Getz, and Antonio Carlos Jobim. She had never performed professionally, and sang on the recordings at the suggestion of her (then) husband, JoÃƒÂ£o Gilberto.\nAstrud Gilberto's recording of &quot;The Girl from Ipanema&quot; established her as a jazz and pop singer. In 1964, Gilberto appeared in the films Get Yourself a College Girl and The Hanged Man. Her first solo album was The Astrud Gilberto Album (1964). Gilberto began as a singer of bossa nova and American jazz standards, but recorded her own compositions in the 1970s. Her repertoire includes &quot;The Shadow of Your Smile&quot;, &quot;It Might As Well Be Spring&quot;, &quot;Love Story&quot;, &quot;Fly Me To The Moon&quot;, &quot;Day By Day&quot;, &quot;Here's That Rainy Day&quot;, and &quot;Look To The Rainbow&quot;. She has recorded songs in Brazilian Portuguese, English, Spanish, Italian, French, German, and Japanese.\nIn 1982, Gilberto's son Marcelo joined her group, and toured with her for more than a decade as her group's bassist. In addition to working as a bassist, he collaborated as co-producer of the albums Live in New York (1996) and Temperance (1997). Son Gregory Lasorsa played on the Temperance album, playing the guitar on her song &quot;Beautiful You&quot;, which features singer Michael Franks.\nGilberto received the &quot;Latin Jazz USA Award for Lifetime Achievement&quot; in 1992, and was inducted to the &quot;International Latin Music Hall of Fame&quot; in 2002. Although not officially retired, Gilberto announced in 2002 that she was taking &quot;indefinite time off&quot; from public performances. She is also a fine artist, and an ardent advocate of animal rights.[1]\n[edit]Influence\n\nGilberto's original recording of the song &quot;Fly Me To The Moon&quot; was edited as a &quot;duet&quot; using a recording of the same song by Frank Sinatra for the soundtrack of Down with Love (2003). Her song &quot;Who Can I Turn To&quot; was sampled by the Black Eyed Peas in the song &quot;Like That&quot; from the album Monkey Business. Her vocals on &quot;Berimbau&quot; were sampled by Cut Chemist in his song &quot;The Garden&quot;.\nHer recording of the song &quot;Once I Loved&quot; was featured in the 2007 film Juno.\nThe &quot;Astrud&quot; track on Basia Trzetrzelewska's 1987 album Time and Tide is a tribute to Gilberto.","torrent":{"xt":"urn:btih:726a5cd0a00a7d1bedd14cabc376772debc40877","amp;dn":"Astrud_Gilberto_3_LPs.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726a5cd0a00a7d1bedd14cabc376772debc40877","infoHashBuffer":{"type":"Buffer","data":[114,106,92,208,160,10,125,27,237,209,76,171,195,118,119,45,235,196,8,119]},"announce":[],"urlList":[]}}