{"title":"Everest.Ultimate.Edition.v5.01.1726.beta.Incl.Serials","uid":4883712,"size":10275071,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:726fafdd984b268b1601f41a539844e86d77a3ce&amp;dn=Everest.Ultimate.Edition.v5.01.1726.beta.Incl.Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Murlok","files":-1,"time":1241536500,"description":"EVEREST Ultimate Edition is an industry leading system diagnostics and benchmarking solution for enthusiasts PC users, based on the award-winning EVEREST Technology. During system optimizations and tweaking it provides essential system and overclock information, advanced hardware monitoring and diagnostics capabilities to check the effects of the applied settings. CPU, FPU and memory benchmarks are available to measure the actual system performance and compare it to previous states or other systems. Furthermore, complete software, operating system and security information makes EVEREST Ultimate Edition a comprehensive system diagnostics tool that offers a total of 100 pages of information about your PC.\n\nFeatures:\nÃ‚Â» Accurate low-level information about motherboard and CPU\nÃ‚Â» Detailed information about the video adapter, video drivers and monitor\nÃ‚Â» Information about all storage devices\nÃ‚Â» Exhaustive information about network adapters, multimedia and input devices\nÃ‚Â» Information about PCI, PnP, PCMCIA and USB devices\nÃ‚Â» Detailed Windows information, including operating system installation date, product key and more\nÃ‚Â» Information about network shares, users and groups list and more\nÃ‚Â» Large amount of information about networking status, remote access, mailing accounts and more\nÃ‚Â» Detailed information about installed programs, scheduled tasks and startup programs\nÃ‚Â» Operating system security information\nÃ‚Â» Firewall, anti-spyware and anti-trojan software list\nÃ‚Â» System Stability Test\nÃ‚Â» CPUID Panel\nÃ‚Â» Hardware monitoring\nÃ‚Â» Sensor icons feature to display actual system temperature and voltage values on the System Tray\nÃ‚Â» CPU and FPU benchmarks\nÃ‚Â» Memory benchmarking\nÃ‚Â» Disk Benchmark module\nÃ‚Â» Detection of possible hardware and software misconfiguration and compatibility issues\nÃ‚Â» Report Wizard\nÃ‚Â» Report e-mailing and printing\n\nNew features in EVEREST version 5.00:\nÃ‚Â» Improved Hardware Monitoring module with Alerting feature\nÃ‚Â» Support for Intel Core i7, Intel Atom and AMD Phenom II processors\nÃ‚Â» Support for OpenGL 3.0 with OpenGL version compliancy test\nÃ‚Â» Support for Windows 7 and a new auto-load feature under Windows Vista\nÃ‚Â» Extended audio information: OpenAL and High Definition Audio pages\nÃ‚Â» New information page for installed Windows Vista Sidebar Gadgets\nÃ‚Â» GPGPU devices information for ATI Stream and nVIDIA CUDA\n\nNew features and improvements in EVEREST v5.01:\nÃ‚Â» Support for up to 8 GPUs in the Hardware Monitoring module.\nÃ‚Â» Support for the latest graphics processors: ATI Mobility Radeon HD 4570, nVIDIA GeForce GT 140, nVIDIA GeForce GTS 250, nVIDIA GeForce GTX 295.\nÃ‚Â» Support for Intel Pentium E32xx Series processors.\nÃ‚Â» GPGPU support for ATI Stream v1.4 API.\nÃ‚Â» Improved IPMI event log and sensor information.\nÃ‚Â» Improved Dell SMI sensor support.\nÃ‚Â» Improved support for VIA Nano CPU and VIA VX800 chipsets.\nÃ‚Â» Fixed diode temperature measurement on 65nm AMD K8 processors.\nÃ‚Â» Fixed benchmark results on EIST (Enhanced Intel SpeedStep) capable Intel processors.\nÃ‚Â» Fixed Sidebar Gadgets enumeration under 64-bit Windows.\n\n\nOC: Windows 95/98/ME/2000/XP/2003/Vista/Seven","torrent":{"xt":"urn:btih:726fafdd984b268b1601f41a539844e86d77a3ce","amp;dn":"Everest.Ultimate.Edition.v5.01.1726.beta.Incl.Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726fafdd984b268b1601f41a539844e86d77a3ce","infoHashBuffer":{"type":"Buffer","data":[114,111,175,221,152,75,38,139,22,1,244,26,83,152,68,232,109,119,163,206]},"announce":[],"urlList":[]}}