{"title":"Coast to Coast AM December 31 2012","uid":7977726,"size":55430736,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:72ea4e9d29b6e60d42e20ff4a41aa028e0e0f83c&amp;dn=Coast+to+Coast+AM+December+31+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357049974,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-31-12\nHost: \tGeorge Noory\nGuests: \tOpen Lines, Lauren Weinstein\n\nGeorge Noory celebrated New Year's Eve live on the air, reviewing listener predictions for 2012, and recording predictions for the new year. Here are some highlights of callers' predictions for 2013:\n\n    Marshall in Yellow Springs, Ohio said this will be the year that time travel with Dr. Ronald Mallett is going to happen.\n    'Satyr' from North Carolina said Syria's President Assad will try to use chemical weapons against his foes in their civil war but a miraculous being will intervene and stop him.\n    The coming hurricane season will be particularly deadly with Jamaica taking a direct hit, warned Simon from Baltimore.\n    Angelique from Tuscon predicted that doctors in the US will increasingly use a patients' voice for medical diagnosis.\n    Mike in San Bernardino foresees a nuclear submarine accident or incident in the Atlantic, close to the Florida coast.\n    Rena, a caller on Skype, said that a new food additive will make many people sick.\n    Due to a pole shift and changes in the electromagnetic field, the Earth will grow rings around it similar to Saturn, Elizabeth in LA intriguingly posited.\n    George Noory shared his own prediction: &quot;I think sometime in 2013, we're going to get hit by some kind of a flare from the sun, an X-type flare, that will finally convince people that we need to fix the grid.&quot;\n\nReviewing callers' predictions from last year, here are some of the hits &amp; misses.\nHits:\n\n    Scientists create a new element on the periodic table.\n    Predictions of doom in 2012 will be just like Y2K.\n    The NRA will be under assault.\n\nMisses:\n\n    Hillary will be VP, with Biden stepping down.\n    Terrorist attack on a resort in the Caribbean.\n    Identity of Jack the Ripper will be revealed.\n    Something huge at the London Olympics-- like a staged alien invasion.\n    Studies of earthworms will open up anti-gravity technology.\n\nFor more predictions, see the recap of the previous night's show.\nInternet Update\n\nFirst hour guest, technology expert Lauren Weinstein talked about Internet and privacy issues. He addressed recent controversies concerning Facebook and Instagram's terms of service related to advertising, and apps like Snapchat (that deletes photos soon after they're sent), which is thought to possibly increase 'sexting' amongst teens. Weinstein noted that a lot of the software related to computers and the Internet hasn't changed that much over the years but because the hardware is so much more powerful and faster, and focused on mobile devices, it seems as if there's been a major shift.\n\nNews segment guests: Craig Smith, Peter Davenport\nWebsite(s):\n\n    vortex.com\n    pfir.org\n\n","torrent":{"xt":"urn:btih:72ea4e9d29b6e60d42e20ff4a41aa028e0e0f83c","amp;dn":"Coast+to+Coast+AM+December+31+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ea4e9d29b6e60d42e20ff4a41aa028e0e0f83c","infoHashBuffer":{"type":"Buffer","data":[114,234,78,157,41,182,230,13,66,226,15,244,164,26,160,40,224,224,248,60]},"announce":[],"urlList":[]}}