{"title":"Farming Simulator 16 v1.0.0.7 Moded.apk","uid":12451579,"size":137276720,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:73c1fd46960c420fbdf23c16ea51e4f53dbd10ad&amp;dn=Farming+Simulator+16+v1.0.0.7+Moded.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kabonsa","files":1,"time":1442691235,"description":"Manage your own farm and drive massive machines in an open world!\n\nFarming Simulator 16 allows you to manage your own realistic farm in extraordinary detail. Plant, grow, harvest, and sell five different crops, raise cows and sheep, and sell timber at your own pace. Buy new fields to expand your farm land. Take direct control of harvesters and tractors, or hire AI helps and manage your growing farm from the full screen management map.\n\nAs the newest in the series of Farming Simulator games, this game has the best of agriculture simulation. The game features massive tractors and other machines from over 20 brands of agricultural manufacturers, including New Holland, Case IH, Ponsse, Lamborghini, Horsch, Krone, Amazone, MAN and more.\n\nFeatures of Farming Simulator 16 include:\n\n- New 3D graphics show even more detail on your machinery!\n- Plant and harvest five different crops: Wheat, canola, corn, sugar beet and potatoes\n- Sell your crops in a dynamic market\n- Use realistic tractors and trucks from some of the biggest agriculture machine makers\n- Feed your cows and sheep to produce and sell milk and wool\n- Forestry has gone mobile! Harvest wood with dedicated machinery and sell the timber\n- Manage AI helpers for better results\n- Play with a friend in local multiplayer mode for WiFi and Bluetooth","torrent":{"xt":"urn:btih:73c1fd46960c420fbdf23c16ea51e4f53dbd10ad","amp;dn":"Farming+Simulator+16+v1.0.0.7+Moded.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c1fd46960c420fbdf23c16ea51e4f53dbd10ad","infoHashBuffer":{"type":"Buffer","data":[115,193,253,70,150,12,66,15,189,242,60,22,234,81,228,245,61,189,16,173]},"announce":[],"urlList":[]}}