{"title":"Doom No Rest For The Living + Master Levels ZDOOM GZDOOM EXPANSI","uid":8721407,"size":8530803,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:73fdecc1ffed2209df7a1cd58be66af3c033f033&amp;dn=Doom+No+Rest+For+The+Living+%2B+Master+Levels+ZDOOM+GZDOOM+EXPANSI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LyleLyleMrLyle","files":2,"time":1374427648,"description":"A Wad file for Zdoom, Gzdoom, Zandronum/Skulltag and family that adds No Rest for the Living \n\nand the Master Levels to your Doom II game, without &quot;removing&quot; your Doom II levels.\n\nIf you are using a previous version of this Wad, keep in mind that the previous saved games \n\nprobabbly won't work as the level order was changed to something more genuine.\n\n-You can still acess the original levels, as already noted.\n\n- No Rest For The Living is as it is on the original Xbox 360 version (BFG edition is botched, \n\nwith wrong music and other already known details)\n\n- In the Master Levels, you can't carry weapons and other items from level to level and the \n\nlife and armor is reseted (except one particular ocasion that you might not even encounter). \n\nThis is intentional to keep with the same dificulty of the original PC version, as they are \n\npresented as standalone maps. The repetitive music is also changed, but only in levels based \n\non MAP01 (and even that it's not all of them).\nThe ending is from the PS1 version.\n\n- There is also one easter-egg from the Xbox version, that is only included for completition \n\nsake and for those interested. Keep in mind you are not forced to see it and it's very easy to \n\nignore it and doesn't break the flow of the game.\n\n!!!BONUS:- Also Included and extra wad with the ps1 exclusive levels doom2tlm.wad, don't load this one if you don't want them.!!!\n\nSeed and support ID and Bethesda products if you like it and have the means to do so.\t","torrent":{"xt":"urn:btih:73fdecc1ffed2209df7a1cd58be66af3c033f033","amp;dn":"Doom+No+Rest+For+The+Living+%2B+Master+Levels+ZDOOM+GZDOOM+EXPANSI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73fdecc1ffed2209df7a1cd58be66af3c033f033","infoHashBuffer":{"type":"Buffer","data":[115,253,236,193,255,237,34,9,223,122,28,213,139,230,106,243,192,51,240,51]},"announce":[],"urlList":[]}}