{"title":"Sexually Broken--Ass out and throat ready Skin Diamond  Matt Wil","uid":9101820,"size":860570611,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7423aa3bbc890b759016a93e00d37daad48f502f&amp;dn=Sexually+Broken--Ass+out+and+throat+ready+Skin+Diamond++Matt+Wil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1382786265,"description":"\nAss out and throat ready, Skin Diamond bent over, bound and roughly fucked and deep throated! | Skin Diamond | Matt Williams\n\nOctober 25, 2013 \n \n\nMP4 only.\n \n \nAVN and XBIZ nominated performer of the year Skin Diamond returns to the pages of the best bondage and rough sex site on the net. Skin is one of the few nominated performers of the year that actually does bondage and rough sex, so she's the winner in our book!\n\nBound ass out and throat ready, Skin is bend over a simple 'H&quot; frame. Her ankles, in custom leather cuffs, are bound spread, and her wrists are bound half-way down the frame causing her amazing ass to stick out, just begging for cock. Sexually Broken is not just a bondage and sex site, we are the best at destroying professional sexual athletes at their own game. We bring the dick, and the girls are completely overwhelmed sexually with orgasms and deep throat fuckings. We blast girls into subspace and further. When we are done they are all left exhausted, cummed out and dazed at what just happened. You can't fake the smiles our girls have in the interviews afterwards as they describe how well they just got fucked.\n\nSkin is no exception. Two cocks own her and make her cum over and over. Her throat is deeply fucked without mercy. Her pussy is pounded to several gut-wrenching screaming orgasms. Both cocks working her over at the same time. Deep down her tiny throat and balls deep in her dripping wet pussy, the dicks force her to cum over and over. Skin's eyes glaze over and she is gone, completely stupid and cum drunk, helpless and dripping some form of liquid out of each of her holes. That's what we do here, we fuck Professional porn stars into the ground.  \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_25sdiamond6/SexuallyBroken-Skin-Diamond-Matt-Williams-Ass-out-and-throat-ready-Skin-Diamond-bent-over-bound-and-roughly-fucked-and-deep-throated.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_25sdiamond6/SexuallyBroken-Skin-Diamond-Matt-Williams-Ass-out-and-throat-ready-Skin-Diamond-bent-over-bound-and-roughly-fucked-and-deep-throated.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:7423aa3bbc890b759016a93e00d37daad48f502f","amp;dn":"Sexually+Broken--Ass+out+and+throat+ready+Skin+Diamond++Matt+Wil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7423aa3bbc890b759016a93e00d37daad48f502f","infoHashBuffer":{"type":"Buffer","data":[116,35,170,59,188,137,11,117,144,22,169,62,0,211,125,170,212,143,80,47]},"announce":[],"urlList":[]}}