{"title":"Eddy Clearwater Help Yourself(blues)(mp3@320)[rogercc]","uid":5605884,"size":103481996,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:747783ceda0bc4e9140c44d76c1517cf418842cb&amp;dn=Eddy+Clearwater+Help+Yourself%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rogercc","files":13,"time":1275587869,"description":"EDDY CLEARWATER HELP YOURSELF\nRecorded in Chicago, 1991.\nReleased: 1992\nLabel: Blind Pig\nFormat: Mp3@ 320 \nTime: 42.40 min.\n\n\nJudging by the effortless way in which southpaw blues guitarist Eddy Clearwater hurls out his boogies, shuffles, and aching blues ballads here, he had the time of his life. This is stout stuff that explodes out of the chute. Clearwater packs this album with one blues rush after another.&quot; - Downbeat \n\n\n01. Who Loves You Baby (2:37)\n02. Help Yourself (3:46)\n03. Set It Out (2:31)\n04. All Your Love (3:58 )\n05. Chicago Weather Woman (3:26)\n06. Crossover (4:18 )\n07. That's My Baby (2:37)\n08. Big Time Gambler (4:26)\n09. Little Bit of Blues (3:04)\n10. Poison Ivy (2:48 )\n11. Messed Up World (4:58 )\n12. We're Out of Here (2:52)\n\nEddy Clearwater - Guitar &amp; Vocals\nWill Crosby - Rhythm Guitar\nKurt Krahnke - Acoustic Bass\nBob Stroger - Electric Bass\nBrian Jones - Drums\nCarey Bell - Harmonica\n\n\nGuitarist Eddy Clearwater is one of the most versatile, colorful, and unique entertainers to have emerged from Chicago's blues scene. Clearwater, whose real name is Eddie Harrington, grew up listening to Delta blues and country &amp; western records in Macon, Missisippi, where he was born in 1935. At age thirteen he moved to Birmingham, Alabama, and started playing guitar in church. He was still playing gospel music when he arrived on Chicago's South Side. But by 1953, having come from a family with a rich blues background (he's related to Carey Bell, Lurie Bell, and Lovey Lee) Eddy had made his move into blues. Performing as Guitar Eddy, he and his band worked the South and West Side taverns. And when he would finish his shift as a cab driver, he would spend hours in clubs listening to Otis Rush, Magic Sam, B.B. King, and Muddy Waters.\n\nEddy happened upon one of his major stylistic influences when he first heard Chuck Berry's rudimentary rock 'Oh Baby Doll' shooting out of his car radio in 1957. With his powerful, left-handed guitar playing, stage costumes (his Indian headdress earned him his nickname 'The Chief'), and flamboyant performances, Clearwater soon developed a reputation as a multifaceted and dynamic showman.\n\nRecording several singles and working steadily in Chicago area nightclubs for over twenty years, Clearwater remained one of the Windy City's hidden treasures until recognition of his talents began to come from abroad. Touring Europe twice in the 70's, Eddy appeared on BBC television in England and recorded for France's MCM label. Other recording opportunities quickly followed. He recorded three albums for the Rooster Blues label in the 80's and one album for England's Red Lightnin' label, which won a W.C. Handy Award for Best Import Blues Album.\n\nEddy and his band tour coast to coast in North America, and have headlined festivals in Europe and Mexico. He realized a lifelong dream in 1987 when he toured six West African countries under U.S. Government auspices.\n\n\n\n","torrent":{"xt":"urn:btih:747783ceda0bc4e9140c44d76c1517cf418842cb","amp;dn":"Eddy+Clearwater+Help+Yourself%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747783ceda0bc4e9140c44d76c1517cf418842cb","infoHashBuffer":{"type":"Buffer","data":[116,119,131,206,218,11,196,233,20,12,68,215,108,21,23,207,65,136,66,203]},"announce":[],"urlList":[]}}