{"title":"Metro2.iso","uid":5161474,"size":1481179136,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7572500fbc18122b39188107f6e8ff42a6ebf4e7&amp;dn=Metro2.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"x0r","files":1,"time":1258173889,"description":"Metro 2; The Stalin Subway; Russian version.\nIn the Kremlin's depths there is ripening a covert plot against Stalin. Stalin - the General Secretary of the Soviet Communist Party - is already 72 years old, but he is still able to arouse fear in his subordinates and subjects. The most reliable way to do away with the aged ruler and usurp his power is to use a powerful secret weapon right during the Bolsheviks Party assembly...\n\nThe main character - the KGB officer Gleb Suvorov - finds himself involved in the dramatic events against his own will. But he must prevent the explosion and rescue the lives of the innocent people.\n\nLeading the main character through the tempest of the events, the player will visit the most prominent sights and secret underground objects of Moscow, like the existent subway stations, a secret military subway line, suburban catacombs, and many others.\n\n    * The photorealistic representation of the most prominent Moscow sights: subway stations, the Kremlin, Moscow State University etc.;\n    * The top-secret objects: a military transport underground line, secret labs, underground dug-outs, Stalin's bunker;\n    * Authentic weaponry, including those that have never been offered in a computer game such as anti-tank rifle PTRS-41, RKG-3 grenades, Molotov cocktail, flamethrower ;\n    * The opportunity to set fires or to flood certain locations;\n    * The NPC's are able to show the emotional reaction to the environment and the player's actions;\n    * You can control the trains of the secret underground line and drive the &quot;Pobeda&quot; car along the underground tunnels;\n    * Over 300 types of destroyable objects: book-cases, chairs, ashtrays and so on;\n    * Facial animation of the in-game characters powered by LifeStudio:HEAD technology;\n    * Multiplayer: deathmatch and special team scenarios, multiplayer maps designed as real Moscow places.\t\t","torrent":{"xt":"urn:btih:7572500fbc18122b39188107f6e8ff42a6ebf4e7","amp;dn":"Metro2.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7572500fbc18122b39188107f6e8ff42a6ebf4e7","infoHashBuffer":{"type":"Buffer","data":[117,114,80,15,188,24,18,43,57,24,129,7,246,232,255,66,166,235,244,231]},"announce":[],"urlList":[]}}