{"title":"Production of Biodiesel Using Lipase Encapsulated in K-carrageen","uid":15185406,"size":4765650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7662381d5986ad230066f32925fecb1f4bfec368&amp;dn=Production+of+Biodiesel+Using+Lipase+Encapsulated+in+K-carrageen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467489881,"description":"Production of Biodiesel Using Lipase Encapsulated in κ-carrageenan - P. Ravindra, K. R. Jegannathan (Springer, 2015).pdf\r\n\r\nISBN 978-3-319-10821-6\r\n\r\nThis book explores a novel technique for processing biodiesel using lipase immobilization by encapsulation and its physical properties, stability characteristics, and application in stirred tank and re-circulated packed bed immobilized reactors for biodiesel production. The enzymatic processing of biodiesel addresses many of the problems associated with chemical processing. It requires only moderate operating conditions and yields a high-quality product with a high level of conversion and the life cycle assessment of enzymatic biodiesel production has more favourable environmental consequences. The chemical processing problems of waste water treatment are lessened and soap formation is not an issue, meaning that waste oil with higher FFA can be used as the feedstock. The by product glycerol does not require any purification and it can be sold at higher price. However, soluble enzymatic processing is not perfect. It is costly, the enzyme cannot be recycled and its removal from the product is difficult. For these reasons, immobilized enzymatic process has been developed which retains the advantages of the soluble enzymatic process and reuse of the enzyme is possible which decreases the enzyme cost, the biodiesel produced does not contain any enzyme residue and the activity of the enzyme can be increased by immobilization. The drawbacks of the immobilized enzyme process are mass transfer limitation, enzyme leakage, the lack of a versatile commercial immobilized enzyme and some of immobilization methods involve toxic chemicals. To overcome the drawbacks of the immobilized enzyme, an attempt is made to use a degradable biopolymer (κ-carrageenan) as a carrier for lipase immobilization","torrent":{"xt":"urn:btih:7662381d5986ad230066f32925fecb1f4bfec368","amp;dn":"Production+of+Biodiesel+Using+Lipase+Encapsulated+in+K-carrageen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7662381d5986ad230066f32925fecb1f4bfec368","infoHashBuffer":{"type":"Buffer","data":[118,98,56,29,89,134,173,35,0,102,243,41,37,254,203,31,75,254,195,104]},"announce":[],"urlList":[]}}