{"title":"Big.Anal.Booties.2.XXX.DVDRip.x264-VBT","uid":9582078,"size":1867276849,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:76c64dfe1c216954c10fed1f7f3e6307695042fa&amp;dn=Big.Anal.Booties.2.XXX.DVDRip.x264-VBT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1391782782,"description":"Rectally obsessed director Mike Adriano is a genius of anal intercourse, a tireless butt fucker that makes playgrounds of beautiful ladies tender tushes. But Mike prefers the bitches with the big butts, and thats what his new is all about. The movies four all new scenes feature the nasty ass action and perverse gaping that are Mikes trademarks, focusing on full bodied, experienced sluts with filthy minds and bodacious bottoms. Big assed booty queen Phoenix Marie has no anal inhibitions. She licks her own toes through her sheer nylons and deepthroats the directors big dick in a wet, drooling blow job. Phoenix rides Mikes meat until her sphincter is wrecked and dilated. Pretty, 22 year old blonde Laela Pryce shows off her plump, jiggling ass walking on a treadmill in fishnets. she enjoys a deep sodomy session before kneeling to receive a mouthful of creamy cum. After five years of retirement, porn legend Kaylynn is back! The foxy MILF pumps a toy in and out of her anus. Mike licks her gaping sphincter, thrusts his beefy boner inside and splatters her butt with hot cum. With short cropped blonde hair and sheer stockings, Joslyn James is a curvaceous, mature bombshell that loves it dirty. Teasing the director with her huge tits and outrageous, womanly ass, the adventurous lady performs ass to mouth stunts and even pushes a peeled banana out of her gaping colon is a thick, meaty ass pirates treasure.\n\nJoslyn James, Kaylynn, Laela Pryce, Phoenix Marie\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=19032649853612577686.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=19032649853612577686.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=48365747321759875895.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=48365747321759875895.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:76c64dfe1c216954c10fed1f7f3e6307695042fa","amp;dn":"Big.Anal.Booties.2.XXX.DVDRip.x264-VBT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76c64dfe1c216954c10fed1f7f3e6307695042fa","infoHashBuffer":{"type":"Buffer","data":[118,198,77,254,28,33,105,84,193,15,237,31,127,62,99,7,105,80,66,250]},"announce":[],"urlList":[]}}