{"title":"[Desperate Pleasures] Family Anal Adventures 2 (2016)","uid":14633470,"size":1355813875,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:79012d5c89b5a0b071b8711d85055c1778bebe37&amp;dn=%5BDesperate+Pleasures%5D+Family+Anal+Adventures+2+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":10,"time":1463397136,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=5174097288\r\n \nhttp://imagedisco.net/?g=9810318537\r\n\r\n\r\nPlot:\r\n\r\nIf You Sit On Daddy's Lap Be Prepared To Get Fucked In The Ass!\r\n\r\nLast weekend mommy finally let me go see dad and I was so excited. We hadn't seen each other since the divorce and so much has changed. We spent the night catching up for lost time and Daddy told me I would finally get to meet my sister Hope. I was so nervous before she arrived I went in Daddy's room for some comfort which of course led to me sucking his cock. Daddy and I were soon fucking like crazy and totally lost track of time 'til my sister walked in. At first she thought I was some girl Daddy picked up but when she found out we're sisters she joined us in bed. The next morning I went to Daddy's room to wake him up and caught him fucking Hope in the ass. I've been curious about anal for awhile so I watched a bit. Later that day I went to my sisters room and confided my desires to her. Hope was so excited she offered to help me prepare. Hope made me get undressed then gave me an in-tense orgasm. After I came she started stretching my ass with fingers and toys until I was ready for daddy. We went into his room together and revealed my surprise. Daddy was more than ready and took turns pleasing both of us until I was ready for his cock in my virgin ass. Daddy was gentle with me at first until I got comfy then he really fucked my ass hard. Hope watched and masturbated while Daddy fucked my ass, I can only imagine what she was thinking, then after I came we both finished Daddy off with our mouths. - XO Olivia","torrent":{"xt":"urn:btih:79012d5c89b5a0b071b8711d85055c1778bebe37","amp;dn":"%5BDesperate+Pleasures%5D+Family+Anal+Adventures+2+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79012d5c89b5a0b071b8711d85055c1778bebe37","infoHashBuffer":{"type":"Buffer","data":[121,1,45,92,137,181,160,176,113,184,113,29,133,5,92,23,120,190,190,55]},"announce":[],"urlList":[]}}