{"title":"Patrick van Rhijn - Big sister live. NL Ebook. DMT","uid":8954365,"size":769268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a07ab0f7b9ce4aed7ea451c9732d43beb2aecd1&amp;dn=Patrick+van+Rhijn+-+Big+sister+live.+NL+Ebook.+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BiWild","files":-1,"time":1379969624,"description":"Patrick van Rhijn - Big sister live. NL Ebook. DMT\n\nAfbeelding\n\nAuteur: Patrick van Rhijn \nPagina's: 216\nTaal: Dutch/Nederlands\nUitgever: Dutch Media Uitgevers\nJaar van uitgifte: 2011\nGenre: Thriller\n\nSamenvatting\n\nIk verwacht hem, maar toch schrik ik een beetje van zijn verschijning. Het is altijd schrikken als iemand die je niet kent jou opeens wel \nblijkt te kennen. Zeker als-ie kaal is en er best ruig uitziet. Ik laat niet merken dat ik me ongemakkelijk voel en volg hem, voor het station \nlangs. In een zijstraatje bij het spoor zie ik het busje staan. Het is een pikzwart busje. Het heeft geblindeerde ramen en er staat geen enkel \nlogo op. Onderweg naar de wagen zegt de jongen geen woord. Pas als we bij het busje zijn en hij de deur openschuift, kijkt hij me aan. 'Zo,' \nzegt hij. 'Welkom bij Big Sister. Noem mij maar Kojak. Stap snel in, er wordt op je gewacht.' Ik zet mijn tas in de wagen en klim op een van \nde stoelen. De deur wordt achter me dichtgeschoven. Achter het stuur blijkt nog een jongen te zitten. Hij heeft donker haar, draagt net als \nde kale jongen een zonnebril en zwaait naar me door het glas zonder erbij te lachen. Ik kijk om me heen om te zien of ik al ergens een camera \nzie in een stoel of aan het dak of zo. Bij dit soort programma's moet je volgens mij constant op je hoede zijn. Die filmen je altijd als je het niet \nin de gaten hebt. Ik schuif naar de middelste rij stoelen en kijk door de getinte ramen naar de ingang van het station. Ik herken de vriendelijke \nbuurman van tweehoog uit onze flat. Het busje wordt gestart. Ik kijk de buurman na tot we de bocht om gaan en vraag me af hoe lang ik hier \neven niet zal komen. Ach, misschien vlieg ik er bij de eerste eliminatieronde al uit, ben ik hier volgende week weer terug.\n\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:7a07ab0f7b9ce4aed7ea451c9732d43beb2aecd1","amp;dn":"Patrick+van+Rhijn+-+Big+sister+live.+NL+Ebook.+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a07ab0f7b9ce4aed7ea451c9732d43beb2aecd1","infoHashBuffer":{"type":"Buffer","data":[122,7,171,15,123,156,228,174,215,234,69,28,151,50,212,59,235,42,236,209]},"announce":[],"urlList":[]}}