{"title":"Anamorph","uid":4438529,"size":4655372335,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7a4ef6525a7c8a0eebca088f2a6fa840fea1331c&amp;dn=Anamorph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"storm1970","files":2,"time":1223686059,"description":"Full DVD\n\nWhen reclusive Detective Stan Aubray (Willem Dafoe) is called in to investigate a series of increasingly spectacular murders, he is thrust into a dark and unsettling underworld that threatens to reveal the secrets of his tormented past.\n\nAs elaborate as they are gruesome, the murders are a paean to the mysteries of anamorphosis, where different perspectives reveal hidden meanings, clues to the crime, and, for Aubray, something more... personal. For the crime scenes resemble those of a previous serial killer who terrorized New York City before being tracked down and killed by Aubray and his men five years before. That case has haunted Aubray ever since, and something about these eerie copycat killings-seemingly planned and executed with him in mind-force him to reexamine the questions he&amp;#039;s tried so hard to bury. Besieged on all sides-by an ambitious young detective (Scott Speedman) with his own take on the killings; by a troubled young woman (Clea Duvall) with a dangerous link to his past; and by his own paralyzing sense of guilt-Aubray must finally confront the possibility he&amp;#039;s been dreading-and denying-all along. ","torrent":{"xt":"urn:btih:7a4ef6525a7c8a0eebca088f2a6fa840fea1331c","amp;dn":"Anamorph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a4ef6525a7c8a0eebca088f2a6fa840fea1331c","infoHashBuffer":{"type":"Buffer","data":[122,78,246,82,90,124,138,14,235,202,8,143,42,111,168,64,254,161,51,28]},"announce":[],"urlList":[]}}