{"title":"Friday The 13th 2009 CAM ( A Commission-kvcd empire )","uid":4725759,"size":784510833,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7aa9b468f78decd116755c14bc8d606f7d70bb72&amp;dn=Friday+The+13th+2009+CAM+%28+A+Commission-kvcd+empire+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"porno6","files":4,"time":1234736914,"description":"Friday The 13th 2009 CAM ( A Commission-kvcd empire )\n\n\n\n\nYoung friends Whitney (Amanda Righetti), Mike (Nick Mennell), Richie (Ben Feldman), Amanda (America Olivio), and Wade (Jonathan Sadowski) end up missing in the woods near the abandoned Camp Crystal Lake (made famous by the original 1980 film), after allowing their curiosity to get the better of them and visiting the site where a psychopathic killer resides. Six weeks later, Trent (Travis Van Winkle) invites friends Jenna (Danielle Panabaker), Bree (Julianna Guill), Chewie (Aaron Yoo), Chelsea (Willa Ford), Lawrence (Arlen Escarpta), and Nolan (Ryan Hansen) to his father's cabin on Crystal Lake for a weekend of sex, booze, pot smoking, and water skiing. However their seemingly fun weekend soon escalates into a nightmare after lone traveler Clay (Jared Padalecki) shows up looking for his missing sister Whitney. The police have searched with no luck, and Clay is now searching alone. Local citizens have advised Clay not to go into those woods, because anyone who shows up missing is already dead, and he is wasting his time. During his search, one of the students, Jenna, decides to help Clay find his sister, and they go into the woods. They find the abandoned Camp Crystal Lake and search the dilapidated camp house for any signs of his sister. They soon find themselves face to hockey-mask with evil reborn, reimagined, and rebooted, and his name is Jason Vorhees (Derek Mears).\n\n\nLOOKIN FOR ENCODERS IN ALL AREAS \n                       please visit us at www.The-Commission.com  www.reputation-resource.com \n\n\n","torrent":{"xt":"urn:btih:7aa9b468f78decd116755c14bc8d606f7d70bb72","amp;dn":"Friday+The+13th+2009+CAM+%28+A+Commission-kvcd+empire+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa9b468f78decd116755c14bc8d606f7d70bb72","infoHashBuffer":{"type":"Buffer","data":[122,169,180,104,247,141,236,209,22,117,92,20,188,141,96,111,125,112,187,114]},"announce":[],"urlList":[]}}