{"title":"Worlds Collide Storyline","uid":4967937,"size":140713209,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7b67edc4f4c64e436386b92eaaf8e7d27f615317&amp;dn=Worlds+Collide+Storyline&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"brodahisou","files":-1,"time":1245625325,"description":"Worlds Collide was an intercompany crossover event presented in July 1994 in the Milestone Comics titles and the Superman-related titles published by DC Comics. It featured a meeting between Metropolis-based superheroes from the DC Universe and Dakota-based superheroes from the Dakotaverse. Unlike many intercompany crossovers, it was intended to be part of the regular continuity and took place in the monthly issues of the involved series.\n\nThe situation was somewhat complicated by the fact that in the Dakotaverse, DC superheroes such as Superman were known as fictional characters from comic books. Although the crossover had no lasting consequences in DC continuity (DC's Zero Hour event cancelled out everything before), it was remembered by Milestone's superheroes. That was until in 2008, the continuity of the Milestone characters was modified. Dakota City and the Dakotaverse characters were placed within the mainstream DC universe.\n\nPlot:\nA postal worker named Fred Bentson unwittingly becomes a portal between two worlds and two cities. A living link between Dakota, home city of the Milestone heroes, and Metropolis, home of Superman. Eventually Bentson loses control of his powers and transforms into Rift, a cosmic being capable of manipulating and reconfiguring matter on a subatomic scale. The heroes of the two universes come together to stop him and seal the dangerous rift between their worlds. \t\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:7b67edc4f4c64e436386b92eaaf8e7d27f615317","amp;dn":"Worlds+Collide+Storyline","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b67edc4f4c64e436386b92eaaf8e7d27f615317","infoHashBuffer":{"type":"Buffer","data":[123,103,237,196,244,198,78,67,99,134,185,46,170,248,231,210,127,97,83,23]},"announce":[],"urlList":[]}}