{"title":"Cottage To Let (1941 Alastair Sim)","uid":5481983,"size":583386696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bbf0f0f4829a1c7436e0699db91f2fc03f8bb48&amp;dn=Cottage+To+Let+%281941+Alastair+Sim%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"renman","files":-1,"time":1270484261,"description":"Upper-class Mrs. Barrington (Jeanne De Casalis) takes in two child evacuees from London, including cocky teenager Ronald (George Cole), lodging them in a cottage she owns. However, it has already been let to annoyingly inquisitive Charles Dimble (Alastair Sim). To compound the confusion, Mrs. Barrington had also agreed to allow it to be converted into a military hospital. Spitfire pilot Flight Lieutenant Perry (John Mills) parachutes into the nearby loch  and becomes the first patient, tended by Mrs. Barrington's pretty daughter Helen (Carla Lehmann). Mrs. Barrington relocates Ronald to the main house, while Dimble and Perry remain in the cottage.\n\nRonald makes friends with Mrs. Barrington's husband John (Leslie Banks), a brilliant but eccentric inventor, currently working on a bombsight for the Royal Air Force. However, he insists on working on his own. His assistant, Alan Trently (Michael Wilding), becomes jealous when Helen starts spending too much time with Perry. Eventually though, Helen lets Trently know that she prefers him.\n\nMeanwhile, the government grows concerned about Barrington's security; his last invention, a self-sealing fuel tank, was copied by the Germans within a month of its mass production. Trently comes under suspicion, as he had been educated in Germany.\n\nIt turns out that there is cause for concern; German agents kidnap Barrington. Ronald stows away in the car used to take the captive to an isolated water mill. When Perry shows up, Ronald attacks one of the spies to help in the &quot;rescue&quot;. Unfortunately, it is all in vain, as Perry is revealed to be the ringleader. Perry intends to take Barrington to Berlin on a seaplane which is due to arrive the next night.\n\n\nHowever, Dimble turns out to be a British counterintelligence officer. He manages to infiltrate the ring and learn where Barrington is being held. All but one of the spies are captured and the prisoners are freed. Perry initially escapes, but is eventually tracked down and killed in a shootout with Dimble.\n\n\n\nPLEASE ENSURE YOU SEED THANK YOU","torrent":{"xt":"urn:btih:7bbf0f0f4829a1c7436e0699db91f2fc03f8bb48","amp;dn":"Cottage+To+Let+%281941+Alastair+Sim%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bbf0f0f4829a1c7436e0699db91f2fc03f8bb48","infoHashBuffer":{"type":"Buffer","data":[123,191,15,15,72,41,161,199,67,110,6,153,219,145,242,252,3,248,187,72]},"announce":[],"urlList":[]}}