{"title":"The Dawn of Human Culture - Richard G. Klein [ePub] - Traitor","uid":9554427,"size":227641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c1deb1fcab9fffe94c878c5e6485bada5c8dde8&amp;dn=The+Dawn+of+Human+Culture+-+Richard+G.+Klein+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":1,"time":1391331343,"description":"A bold new theory on what sparked the &quot;big bang&quot; of human culture\nThe abrupt emergence of human culture over a stunningly short period continues to be one of the great enigmas of human evolution. This compelling book introduces a bold new theory on this unsolved mystery. Author Richard Klein reexamines the archaeological evidence and brings in new discoveries in the study of the human brain. These studies detail the changes that enabled humans to think and behave in far more sophisticated ways than before, resulting in the incredibly rapid evolution of new skills. Richard Klein has been described as &quot;the premier anthropologist in the country today&quot; by Evolutionary Anthropology. Here, he and coauthor Blake Edgar shed new light on the full story of a truly fascinating period of evolution.\n\nRichard G. Klein, PhD (Palo Alto, CA), is a Professor of Anthropology at Stanford University. He is the author of the definitive academic book on the subject of the origins of human culture, The Human Career. Blake Edgar (San Francisco, CA) is the coauthor of the very successful From Lucy to Language, with Dr. Donald Johanson. He has written extensively for Discover, GEO, and numerous other magazines.","torrent":{"xt":"urn:btih:7c1deb1fcab9fffe94c878c5e6485bada5c8dde8","amp;dn":"The+Dawn+of+Human+Culture+-+Richard+G.+Klein+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c1deb1fcab9fffe94c878c5e6485bada5c8dde8","infoHashBuffer":{"type":"Buffer","data":[124,29,235,31,202,185,255,254,148,200,120,197,230,72,91,173,165,200,221,232]},"announce":[],"urlList":[]}}