{"title":"Star Magazine UK - 13 January 2014","uid":9448444,"size":26230597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d83f865c04a1454d666660ddc823de53cdff74c&amp;dn=Star+Magazine+UK+-+13+January+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1389129850,"description":"Star Magazine UK - 13 January 2014\n English | 100 pages | True PDF | 26.00 Mb\n\n\nStar was founded by Rupert Murdoch in 1974 as competition to the tabloid National Enquirer with its headquarters in New York City. In the late 1980s it moved its offices to Tarrytown, NY and in 1990 Murdoch sold the magazine to The Enquirer's parent company American Media Inc. (Murdoch now owns the New York Post, which, although it has more of a regional, news-centered focus, still has significant celebrity coverage.)\n\nOriginally an unstapled, inexpensive, supermarket tabloid printed on newsprint, Star was hugely successful but remained in the shadow of its longer-established stablemate. Along with the Enquirer its circulation declined with the advent of celebrity-driven television shows such as Entertainment Tonight and Hard Copy.\n\nIn 1999, AMI was bought by investors fronted by David Pecker, who personally pledged that Star would never relocate to Florida, the home state of all the country's other tabloids. However, it took Pecker less than a year to renege on his promise and Star was moved into AMI's headquarters in Boca Raton, Florida, sharing the building with the Enquirer and AMI's other recently acquired titles Globe, National Examiner, and Sun. Editor Phil Bunton was replaced before the move when he angered Pecker by telling the New York Post: &quot;It's going to be open warfare. How we're going to all work together I don't know. It's like having the Bosnians, Croats, the Jews and Arabs all together in the same area.&quot; Virtually all Star's staff of experienced tabloid journalists refused to make the move south. Four years later, Pecker appointed former Us Weekly editor Bonnie Fuller to oversee the paper and, at her demand, he moved it back to New York in the summer of 2003.\n\nAt the beginning of 2004, Star gained new life by switching to a more traditional magazine format, with a higher grade of paper and, denying its tabloid roots, put itself into competition with a new breed of entertainment magazine typified by Fuller's former publication, Wenner Media's Us Weekly, and the German-owned magazine publisher Bauer's In Touch Weekly. However, its page layout remains tabloid-derived, with sections including &quot;Worst of the Week,&quot; which points out the most amusing celebrity fashion disasters of the previous week, and &quot;Knifestyles of the Rich and Famous&quot; section, which illustrates suspected incidences of plastic surgery with before-and-after photos.\n\nAs of 2010, Star sells for US$3.49 per issue with reduced rate subscriptions varying from 26-52 issues.\n\nWith the advent of the internet, gossip is now widespread on an instant basis, from one place in the world to another what used to take a long time to filter through is now instant. Online gossip magazines are impacting the sales of traditional supermarket tabloids.\n","torrent":{"xt":"urn:btih:7d83f865c04a1454d666660ddc823de53cdff74c","amp;dn":"Star+Magazine+UK+-+13+January+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d83f865c04a1454d666660ddc823de53cdff74c","infoHashBuffer":{"type":"Buffer","data":[125,131,248,101,192,74,20,84,214,102,102,13,220,130,61,229,60,223,247,76]},"announce":[],"urlList":[]}}