{"title":"Carole King - Fantasy (1973) [Rock Pop][mp3 256][h33t][schon55]","uid":4996866,"size":80166420,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7db3c365bfa0335518166ef2ccc394852005d92f&amp;dn=Carole+King+-+Fantasy+%281973%29+%5BRock+Pop%5D%5Bmp3+256%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"schon55","files":22,"time":1247326934,"description":"Carole King - Fantasy \nOriginal Release Date: June 1973 \nAudio CD (March 1, 1991) \nLabel: Sony \nBitrate: 256 kbps\n\n1973's &quot;Fantasy&quot; is certainly one of Carole King's greatest musical achievements and one of the most innovative albums of the early 1970s.  The entire album works as a &quot;sound suite&quot; or &quot;medley&quot; as each song bleeds seamlessly into the next without any pause or interruption.  King, of course, wrote, arranged and orchestrated all of the music, taking charge of conducting the string sections as well.  \nMusically, it is simply brillant.  Observe the transitions from &quot;You've Been Around Too Long&quot; into &quot;Being at War With Each Other&quot; or how &quot;Corazon&quot; emerges with its bright Latin beat from the final strings of &quot;You Light Up My Life. &quot; Likewise, it is a marvel to hear King launch from &quot;Corazon&quot; into the funky, &quot;Soul Train&quot; strains of &quot;Believe In Humanity&quot;.  She is positively joyous. \n\nLyrically, &quot;Fantasy&quot; has been attacked by critics throughout the years for being superficial and shallow.  I find the lyrics adequate and sometimes even thought provoking, but at the same time very straightforward and uncomplicated in their phrasing, but I have always felt the best ideas are stated simply without pretention and complication.  With that said. . .  &quot;Fantasy&quot; becomes more magical and exciting with each and every listen.  ~ &quot;earthvolunteer&quot;\n\nLay back, close your eyes, and listen to the words, phrasing, and music of one of the best albums ever recorded.  To Carol King, this may be fantasy, to millions of us, these are songs about everyday life.  From the listener being urged to look around. . .  at whats going on around them in &quot;You've Been Around Too Long&quot; to closing with the need to &quot;Believe In Humanity&quot;, this album has it all.  In between those songs, you will find a non-stop succession of songs about life, hopes and dreams, all beautifully performed.  For many listeners, it will seem as if Carol King reached inside your mind and wrote the words you have tried to express for so many years.  While written from a female point of view, the songs will have meaning to all.  This is a must have album for those times when you want to lay back, enjoy the music, but keep on thinking.  ~ A Customer, Amazon\n\nCarole King - Fantasy Tracks:\n01.  Fantasy Beginning\n02.  You've Been Around Too Long\n03.  Being At War With Each Other\n04.  Directions\n05.  That's How Things Go Down\n06.  Weekdays\n07.  Haywood\n08.  A Quiet Place To Live\n09.  Welfare Symphony\n10.  You Light Up My Life\n11.  CorazÃƒÂ³n\n12.  Believe In Humanity\n13.  Fantasy End \n","torrent":{"xt":"urn:btih:7db3c365bfa0335518166ef2ccc394852005d92f","amp;dn":"Carole+King+-+Fantasy+%281973%29+%5BRock+Pop%5D%5Bmp3+256%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db3c365bfa0335518166ef2ccc394852005d92f","infoHashBuffer":{"type":"Buffer","data":[125,179,195,101,191,160,51,85,24,22,110,242,204,195,148,133,32,5,217,47]},"announce":[],"urlList":[]}}