{"title":"Charles Dickens - A Tale of Two Cities (BBC)","uid":6922494,"size":224504758,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7dd04468ce9f72569997a2ccaa62a3beb0a4f894&amp;dn=Charles+Dickens+-+A+Tale+of+Two+Cities+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1325325391,"description":"From BBC Radio 4. Written by Charles Dickens; Full-cast dramatisation; Dramatised by Mike Walker.\n\nAfter 18 years as a political prisoner in the Bastille the aging Dr Manette is finally released and reunited with his daughter in England. There two very different men, Charles Darnay, an exiled French aristocrat, and Sydney Carton, a disreputable but brilliant English lawyer, become enmeshed through their love for Lucie Manette. From the tranquil lanes of London, they are all drawn against their will to the vengeful, bloodstained streets of Paris at the height of the Reign of Terror and soon fall under the lethal shadow of La Guillotine.\n\nCharles Dickens...Robert Lindsay\nJarvis Lorry...Jonathan Coy\nMiss Pross...Alison Steadman\nLucie Manette...Lydia Wilson\nDr Alexandre Manette...Karl Johnson\nCharles Darnay...Andrew Scott\nErnest Defarge...James Lailey\nTherese Defarge...Tracy Wiles\nGaspard...Simon Bubb\nJerry Cruncher...Carl Prekopp\nJoe...Rikki Lawton\nWith Adam Billington and Christopher Webster\nMusic by Lennert Busch\nDirected by Jessica Dromgoole and Jeremy Mortimer\n\n-----------------------------------------------------------------------------------\n\nThe Tale of a Tale of a Two Cities (BBC Radio 4 Documentary) - an additional bonus!\n\nCrime novelist Frances Fyfield takes us into the heart of Dickens' creative process: his handwritten manuscripts.\n\nWhen Dickens wrote A Tale of Two Cities in 1859 it was, for him at least, both the best of times and the worst of times.\n\nHe'd separated from his wife, started a new weekly journal and was becoming more and more familiar as a performer of his own works.\n\nBut the process of creation for his new novel was the same as ever.\n\nA tightly written manuscript on individual leaves was whisked off to the printers, proof-read and edited by the author and then made available, instalment by instalment, to a loyal public.\n\nFrances Fyfield has been given access to that manuscript, held by the Victoria and Albert Museum in London, and along with the scholar Robert Patten and actor David Timson, she explores the frantic handwriting, the ferocious self-editing and the sheer energy of Dickens' original pages.\n\nAnd she also visits a print museum to get an idea of just what a challenge it was, turning these pages into print against the deadlines Dickens had set himself.","torrent":{"xt":"urn:btih:7dd04468ce9f72569997a2ccaa62a3beb0a4f894","amp;dn":"Charles+Dickens+-+A+Tale+of+Two+Cities+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd04468ce9f72569997a2ccaa62a3beb0a4f894","infoHashBuffer":{"type":"Buffer","data":[125,208,68,104,206,159,114,86,153,151,162,204,170,98,163,190,176,164,248,148]},"announce":[],"urlList":[]}}