{"title":"[PSP]Locoroco_[EUR][torrents.ru]","uid":4044029,"size":647138299,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:7e9ddfc87c17d95917548997edb3cf0180d30a48&amp;dn=%5BPSP%5DLocoroco_%5BEUR%5D%5Btorrents.ru%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nw123","files":1,"time":1203812969,"description":"Developed by Sony Computer Entertainment Japan, LocoRoco is an innovative 2D platform/action game available exclusively for the PSP. Featuring unique controls utilizing the \\&quot;L\\&quot; and \\&quot;R\\&quot; shoulder buttons, players are tasked with controlling via \\&quot;tilting or bumping\\&quot; the landscape of the LocoRoco in order to help them navigate through the level and keep them out of harm\\&amp;#039;s way. With more than 40 stages, players control and guide the LocoRoco through vibrant, thriving and lush worlds filled with slippery slopes, swing ropes, and more. \n\nFeaturing six different types of LocoRoco that include their own voices and actions, players will be enchanted by captivating music that communicates the joyous world of these LocoRoco. In addition, LocoRoco features the rewarding LocoHouse, three mini-games, and wireless features. \n\nThe peaceful world of the LocoRoco are under attack by the not-so-nice Moja Corps. These evil outer space creatures want nothing but to capture the blissful LocoRoco and take them from their land of blowing flowers, lively creatures and pastel scenery. As the planet where the LocoRoco inhabit, players must tilt, roll and bounce the LocoRoco to safety.\n\nFull Europe version!\n\nSpecially for torrents.ru","torrent":{"xt":"urn:btih:7e9ddfc87c17d95917548997edb3cf0180d30a48","amp;dn":"%5BPSP%5DLocoroco_%5BEUR%5D%5Btorrents.ru%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e9ddfc87c17d95917548997edb3cf0180d30a48","infoHashBuffer":{"type":"Buffer","data":[126,157,223,200,124,23,217,89,23,84,137,151,237,179,207,1,128,211,10,72]},"announce":[],"urlList":[]}}