{"title":"antiX MEPIS 11 [Jayaben Desai] [32-Bit] [ISO] [geno7744]","uid":6369026,"size":1400791040,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7ec3fe486da57bc6369a87b2a2f6183c800df8e8&amp;dn=antiX+MEPIS+11+%5BJayaben+Desai%5D+%5B32-Bit%5D+%5BISO%5D+%5Bgeno7744%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geno7744","files":1,"time":1304610186,"description":"Just over a year since the release of antiX-M8.5, the antiX-team are pleased to announce that antiX MEPIS 11 'Jayaben Desai' - a fast, light, very flexible and complete desktop and livecd based on Debian Testing and SimplyMEPIS - is now available in full, base and core versions (for 686 and 486 kernel all using hybridiso). This release defaults to a fully customised icewm-Rox desktop (fluxbox, wmii and dwm are also installed) using a SimplyMEPIS 2.6.36-4 kernel, our own assistants to help configuration, and the usual range of applications for desktop use. Latest Iceape (2.0.13-1) for internet needs, Abiword (2.8.6) and gnumeric (1.10.14) for office use, qmmp and goggles music manager (0.12.1) for audio, gxine, mplayer and gnome-mplayer for video, gppp (dial-up), wicd (1.7), umt-panel2 (from aptosid) for GPRS/UMTS/3G and ceni (2.21) for network connection, pidgin (2.7.11) for chat. Many cli apps are also included such as Alpine for email, moc for audio, elinks for browsing, abcde and ripit for cd ripping and much more. Features include a cli-installer script for fast and light install, live with persistence, 'remaster on the fly', new boot cheatcodes for setting dpi and desktop windows manager with or without icons, antix2usb to easily install to usb stick. Many languages are fully supported out of the box with the language chosen at live CD boot carrying over to install. Chinese, Japanese and Korean fonts are included as well as ibus in the full version.\n\nantiX works on computers with as little as 64 MB RAM, though 128MB RAM is the recommended minimum and the 486 kernel version should work on AMD K5/k6.\nantiX is fast and has low RAM usage running live or installed.\n\n\nFile Info\n\nMD5:da06883556f83e27e0053dba310f7267","torrent":{"xt":"urn:btih:7ec3fe486da57bc6369a87b2a2f6183c800df8e8","amp;dn":"antiX+MEPIS+11+%5BJayaben+Desai%5D+%5B32-Bit%5D+%5BISO%5D+%5Bgeno7744%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec3fe486da57bc6369a87b2a2f6183c800df8e8","infoHashBuffer":{"type":"Buffer","data":[126,195,254,72,109,165,123,198,54,154,135,178,162,246,24,60,128,13,248,232]},"announce":[],"urlList":[]}}