{"title":"Taj Mahal - The Best Of Taj Mahal 2000 TQMP [FLAC]","uid":4959233,"size":431612433,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f310802930826745bee62de4a3f5685d810aaba&amp;dn=Taj+Mahal+-+The+Best+Of+Taj+Mahal+2000+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Breezin","files":23,"time":1245244653,"description":"Quotes from amazon.com (avg 4.5 star rating)\n\n&quot;I had heard the name, Taj Mahal over the years but never took the time to investigate his music. Then one day while listening to the radio, the song &quot;Fishing Blues&quot; came on and it sparked my interest. When I saw that he had this &quot;Best Of...&quot; collection I figured it would be a good place to start. Well,I haven't stopped playing it since I recieved it. What a find, this is great music! Every track on this cd touched me in some way. Songs like &quot;Statesboro Blues&quot;, &quot;Leaving Trunk&quot;, and &quot;She Caught The Katy&quot; are gritty, bluesy, and soulful. Taj sings with a voice that was made for the blues, and plays a mean harmonica to boot. Aside from the songs on this collection that really cook, there are others that seem to transcend the blues and create a different feeling. &quot;Corinna&quot;, &quot;Take A Giant Step&quot; and &quot;Johnny Too Bad&quot; are more thoughtful and laid back, making for a good mix of tempos'. Then, just when I thought it couldn't get much better, I listened to the jazzed up, instrumental &quot;Ain't Gwine To Whistle Dixie (No Mo')&quot;. Awesome! Then there's &quot;Oh Susanna&quot;, a song that you might think you've heard before as a child, but not like this! I could go on, but just know that all in all this is a collection of incredible, inspired music from a great artist,and track for track, it's one of the best albums I have ever purchased.&quot;\n\n&quot;This collection focuses on the very early Taj Mahal and contains most of his early classics. For anyone not familiar with this artist this is a great place to start. You get a full taste of &quot;Taj Mahal&quot;, &quot;The Natch'l Blues&quot; and &quot;The Real Thing&quot;(with the tuba band), his first 3 excellent albums, and it is obvious from these how eclectic a blues performer he is. Taj Mahal has always been one of my favorites, and he presented one of the best live shows I have ever seen. He is touring this summer so check him out if you get a chance, and delve deeply into the rest of his recorded material, particularly &quot;Senor Blues&quot;. \n\n&quot;The capacity of Taj Mahal to go from rock'n roll to New Orleans blues in this cd is clearly evidence of his great versatile style to play.The interpretation of Statesboro Blues is a psychodelic way to play,sometimes remembering The Doors.The 4th.and 5th.tracks remembers New Orleans nights and...the 6th.some Dylan's tunes!!Great cd for those blues and early rock'n roll fans.The 7th.track,is something from Stones...ohhh!!!!....Is he a versatile bluesman or no???\nWhat must be said is that all the tracks are from that early years of fertile sinergy between blues and rock'n roll..67;68;71;72;What more we can say???Nothing more...Just sit down and play this fantastic cd with the begining of Mahal's\ncareer!!!&quot;\n\nNot my Rip! But excellent Quality nevertheless :))\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork.\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;26445443435c4f48664a4f504308484a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:7f310802930826745bee62de4a3f5685d810aaba","amp;dn":"Taj+Mahal+-+The+Best+Of+Taj+Mahal+2000+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f310802930826745bee62de4a3f5685d810aaba","infoHashBuffer":{"type":"Buffer","data":[127,49,8,2,147,8,38,116,91,238,98,222,74,63,86,133,216,16,170,186]},"announce":[],"urlList":[]}}