{"title":"Warlord of Mars 23-27 (2013) (2 covers) (Digital) (K6-Empire)","uid":8839675,"size":271620644,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7f57d8d1ba59b40e22693760f838f68192f823b2&amp;dn=Warlord+of+Mars+23-27+%282013%29+%282+covers%29+%28Digital%29+%28K6-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1377210337,"description":"English | CBR | 5 Issues\n\nWarlord of Mars #23-27\nPublisher:  Dynamite Entertainment\nPublication Date:  February 27, 2013 - July 24, 2013\n\nWriter:  Arvid Nelson\nArtists:  Leandro Oliveira (#23-24, 27) and Everton Sousa (#25-26)\nColorists:  Thiago Ribeiro (#23, 26-27) and Alex Guimaraes (#24-25)\nLetterer:  Marshall Dillon\nCovers:  Joe Jusko and Lucio Parrillo\n\nWarlord of Mars #23\nJohn Carter slams face-first into the forbidden terrors of the Martian North Pole-- literally! Not a single person to have crossed into the frozen northern wastes has ever returned to tell the tale, and Carter's going to find out why. What he discovers will shock him to his very core, but when the life of his princess, Dejah Thoris, is at stake, no risk is too great. Warlord of Mars #23 -- The Carrion Caves!\n\nWarlord of Mars #24\nJohn Carter is a prisoner of the brutal tyrant Salensus Oll. His princess is still in the clutches of the ever-sleazy Matai Shang. But Carter's a lucky guy! A friendly fleet is approaching Salensus Oll's domed fortress. There's just one little hitch: the ships are doomed if Carter can't escape and shut down the terrible Guardian of the North that renders Salensus Oll invincible. Even if he breaks free, Carter will have to face the guardian of the Guardian -- the greatest swordsman Mars has ever known!\n\nWarlord of Mars #25\nIt's Judgment Day on Mars. Everything John Carter has achieved has lead him to this final confrontation with the cruel tyrant of the Martian north. But he's going to be so busy commanding his army he's not going to be able to rescue Dejah Thoris this time -- she's going to have to rescue herself! And even if Carter is victorious, he has upset the ancient religion of Mars and smashed the red planet's eons-old customs. What will be his reward? The epic battle to unite all of Mars awaits you in Warlord of Mars #25: The Final Reward!\n\nWarlord of Mars #26\nJohn Carter might be the brand-new Warlord of Mars, but his his honeymoon's gonna be real short. The savage green Martians start running amok the moment he ascends the throne, threatening to smash the fragile peace he has fought so hard to win. What's behind the uptick in violence? Only John Carter and his old pal Tars Tarkas can find the truth. Warlord of Mars #26 is the first installment of the thrilling Savages of Mars story arc. John Carter's exploits on the Red Planet are just beginning!\n\nWarlord of Mars #27\nJohn Carter's going north -- to the Martian north pole, that is, in hopes of finding clues that will lead him to the murderer stalking his palace. From the moment he arrives, Carter finds himself embroiled in the conspiracies and intrigues of the Martian north, where the only thing more bitter than the cold is the politics. How many asses is our hero gonna have to kick to get to the truth? A whole lot, trust us -- this is Mars!\n\nThanks goes to K6 for this release.\n\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8689374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8689374&lt;/a&gt;","torrent":{"xt":"urn:btih:7f57d8d1ba59b40e22693760f838f68192f823b2","amp;dn":"Warlord+of+Mars+23-27+%282013%29+%282+covers%29+%28Digital%29+%28K6-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f57d8d1ba59b40e22693760f838f68192f823b2","infoHashBuffer":{"type":"Buffer","data":[127,87,216,209,186,89,180,14,34,105,55,96,248,56,246,129,146,248,35,178]},"announce":[],"urlList":[]}}