{"title":"Mercenaries 2","uid":4488194,"size":10066367,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:812d25c418c32efce0d78779c19696e6f6f1392f&amp;dn=Mercenaries+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pikoino2","files":4,"time":1225859631,"description":"The original Mercenaries game was what you could call a &quot;sleeper hit&quot;. Featuring incredible destructible environments (on the PS2) and a story involving Korea which was all-right, the game fell on deaf ears considering its release date and relative proximity to games like GTA: San Andreas. However, the game was enough of a hit for Pandemic and EA to release a follow-up; one that advances almost everything that the original game had and then some.\nMercenaries 2 on the PC is undeniably a &quot;GTA clone&quot;, but as far as GTA clones go, it is one of the better ones - advancing the genre rather than just releasing another shovelware version of something that people like better from Rockstar. The destructible environments go a long way towards making this work in the game&amp;#039;s favor. Everything in the game is destructible (the buildings, etc). And while the destruction isn&amp;#039;t as detailed as say, Battelfield: Bad Company, it still is sufficient that you feel immersed in the game.\nThe story arc is reasonably well-developed, but is nothing to really get excited about. The set-up is extremely rushed and simple. In a nutshell, you run one mission for a man in Venezuela who then betrays you, and for no apparent reason, you all of a sudden treat him like your mortal enemy who must be killed. The story reeks of cliched vengeance and absurd humor, but that may not be so much of a detriment if you treat the game like a B-movie.\nUltimately, the gamplay shines well in the game. The vehicles control well, but having played GTA IV, I can&amp;#039;t help but feel that the vehicles are very arcade-y in control, as opposed to the realistic, physics-based vehicles in the fourth game. The helicopter controls are solid, but nothing remarkable. Furthermore, the shooting mechanics of the game are also pretty good - though I occasionally had problems with aiming inside the vehicles.\nWhile I actually enjoyed the gameplay and the story, the game itself feels rushed in the sense that it has some graphical issues and some significant glitches. In my first three hours with the game, I experienced falling right through the map, swimming underneath landmasses with no water, and a few other glitches including pop-in. The PC version doesn&amp;#039;t feel perfectly polished - with very little in the way of optimization for the PC platform.\nUltimately, it boils down to how much you enjoy GTA&amp;#039;s gameplay - if you feel like its the greatest thing since sliced bread, then you&amp;#039;ll want to pick up Mercenaries 2 for the PC. Otherwise, if you have another platform, like 360 or PS3, it&amp;#039;ll be best to grab the game for that console.\n","torrent":{"xt":"urn:btih:812d25c418c32efce0d78779c19696e6f6f1392f","amp;dn":"Mercenaries+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812d25c418c32efce0d78779c19696e6f6f1392f","infoHashBuffer":{"type":"Buffer","data":[129,45,37,196,24,195,46,252,224,215,135,121,193,150,150,230,246,241,57,47]},"announce":[],"urlList":[]}}