{"title":"Night Ranger - The Secret Of My Success","uid":4398080,"size":175767556,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8158ff4625b1902394a954412f572e4ba830e461&amp;dn=Night+Ranger+-+The+Secret+Of+My+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1221532871,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNight Ranger is an American rock band formed in San Francisco, California that gained significant popularity during the 1980s with a series of successful albums and singles. The band&amp;#039;s first five albums sold over 10 million copies worldwide, and gave the band international recognition. The quintet is perhaps best known for the power ballad &quot;Sister Christian&quot;, which peaked at #5 in early 1984.\n\nAfter their success waned in the late 1980s, the band split up in 1989 and its members pursued other musical endeavours including both group and solo efforts. Several members released an album without original singer Jack Blades in the mid-1990s, but the band soon re-united to release two new albums in the latter half of the decade. Despite the departure of original keyboardist Alan Fitzgerald and guitarist Jeff Watson, the band has continued to tour into 2008 and remains very popular in Asian countries including Japan.\n\nBetween 1984 and 1987, Night Ranger branched out into soundtracks, recording or contributing songs to several teenage films. In 1984, the band released &quot;Interstate Love Affair&quot; (later appearing on Seven Wishes) for Teachers, starring Nick Nolte. The band also received exposure on two Anthony Michael Hall vehicles, Sixteen Candles (1985) and Out of Bounds in (1986). &quot;Rumours in the Air&quot; from Midnight Madness appeared on the former, while the latter featured &quot;Wild and Innocent Youth,&quot; a Blades-Keagy composition unreleased by the band.\n\nIn 1987, they co-wrote the title theme to the Michael J. Fox film The Secret of My Success, which served as the lead single from Big Life. Unfortunately, Night Ranger faced stiff competition from glam bands such as Bon Jovi and Poison, while overall tastes had begun to shift toward &quot;bad boy&quot; groups, such as Guns N&amp;#039; Roses. Moreover, some Night Ranger fans perceived the band&amp;#039;s Hollywood flirtations as evidence of &quot;selling out,&quot; reflected by a decline in album sales for Big Life.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8158ff4625b1902394a954412f572e4ba830e461","amp;dn":"Night+Ranger+-+The+Secret+Of+My+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8158ff4625b1902394a954412f572e4ba830e461","infoHashBuffer":{"type":"Buffer","data":[129,88,255,70,37,177,144,35,148,169,84,65,47,87,46,75,168,48,228,97]},"announce":[],"urlList":[]}}