{"title":"Did God Use Evolution - Werner Gitt","uid":11773181,"size":382616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82c3532ea8eef08d6fcebdbde41aff7e23063e84&amp;dn=Did+God+Use+Evolution+-+Werner+Gitt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427157606,"description":"Drawing from a variety of topics ? biology, biblical chronology, and the origin of human language ? and showing their relation to one another in solving this question, author Werner Gitt reveals that evolution is not only bad science, it also violates scripture. Written for the layman, but with a scientific slant, this compelling book devastates Darwinian arguments for the origin of our universe and planet.\n\nIn helping Christians answer attacks on their faith, Gitt addresses relevant subjects such as:\n\n*The origin of man*\n*The origin of human language*\n*Human behavior*\n*The origin and future of the universe*\n\nThe Bible states clearly the world was created. Humanism-dominated science presents theories of evolution as truth. Thousands of years and in six days-- or millions of years and evolution? Christians are stuck between the principles of their faith and the &quot;evidence&quot; being touted as truth in our educational system. Too often Christians struggle to find a way to bridge the gap between faith and science, and the question of God using evolution is a common one. One of the most common and confusing questions of our time is now answered convincingly by Dr. Werner Gitt, and information specialist who has studied the creation-evolution debate for decades.\n\n\nAbout the author:\nDr. Gitt is an information specialist based in Germany, and is a very popular creationist lecturer around the world. The retired Dr. Gitt was a director and professor at the German Federal Institute of Physics and Technology (Physikalisch-Technische Bundesanstalt, Braunschweig), and the Head of the Department of Information Technology. He is the author of numerous books, including the recently released If Animals Could Talk and In The Beginning Was Information","torrent":{"xt":"urn:btih:82c3532ea8eef08d6fcebdbde41aff7e23063e84","amp;dn":"Did+God+Use+Evolution+-+Werner+Gitt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c3532ea8eef08d6fcebdbde41aff7e23063e84","infoHashBuffer":{"type":"Buffer","data":[130,195,83,46,168,238,240,141,111,206,189,189,228,26,255,126,35,6,62,132]},"announce":[],"urlList":[]}}