{"title":"Call.of.Duty.5.World.at.War.[PCDVD5].[ESP]","uid":4544000,"size":4694252790,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:82ca508b5d2470c623affe3ad9ba559218b6cdff&amp;dn=Call.of.Duty.5.World.at.War.%5BPCDVD5%5D.%5BESP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"circlensess","files":52,"time":1228058241,"description":"El juego y su historia:\n\n- Volveremos a la Segunda Guerra Mundial. Pero esta vez, afrontaremos el escenario de las batallas en el PacÃƒÂ­fico.\n- Podremos llevar al bando americano y al soviÃƒÂ©tico para enfrentarnos a los Japoneses.\n- El juego va a ser mucho mÃƒÂ¡s violento y sangriento que nunca.\n- Nos encontraremos japoneses con katanas a los que tendremos que hacer frente.\n- Al fin, tendrÃƒÂ¡ modo cooperativo.\n- SaldrÃƒÂ¡ para PlayStation 2, PlayStation 3, Xbox 360, Wii, PC y Nintendo DS.\n- Esta siendo desarrollado por Treyarch.\n\nTenÃƒÂ©is muchÃƒÂ­sima mÃƒÂ¡s informaciÃƒÂ³n (jugabilidad, desarrollo, multiplayer, cooperativo) y un buen puÃƒÂ±ado de imÃƒÂ¡genes despuÃƒÂ©s del salto. No os lo perdÃƒÂ¡is.\n\nJugabilidad:\n\n- Por fin, Lanzallamas. TendrÃƒÂ¡ un efecto muy similar al visto en Far Cry 2, se propagarÃƒÂ¡n las llamas.\n- Podremos disparar desde nuestra cobertura. Podremos destruir paredes a base de balazos para pasar a travÃƒÂ©s de ellas.\n- Por primera vez en un juego Call of Duty: podremos nadar tanto en el modo historia como multiplayer).\n- HabrÃƒÂ¡n escenarios dedicados exclusivamente a llevar un vehÃƒÂ­culo. El mÃƒÂ¡s destacado serÃƒÂ¡ en el que llevaremos el PBY Catalina.\n\nSobre el desarrollo:\n\n- Usa el motor de Call of Duty 4 mejorado (sobretodo las fÃƒÂ­sicas). Los escenarios serÃƒÂ¡n mÃƒÂ¡s destruibles. Es posible quemar objetos o destruirlos a piezas. Cuerpos y objetos flotan en el agua. Impresionantes efectos de luces.\n- Esta vez la plataforma para la que se esta desarrollando el juego es Xbox 360. Otros equipos diferentes se encargarÃƒÂ¡n de portar el juego a los otros sistemas.\n- Llevan dos aÃƒÂ±os desarrollando el juego (CoD3 fue de 11 meses)\n- 96 canales de audio. Muchos de ellos son sonidos de la jungla. TendrÃƒÂ¡ un efecto &quot;Real-Time Occlusion&quot; que significa que el sonido tendrÃƒÂ¡ diferente nivel de volumen segÃƒÂºn la distancia y situaciÃƒÂ³n en la que se produzca.\n\nCooperativo:\n\n- Hasta 4 jugadores cooperativos online y 2 en pantalla partida en el modo historia.\n- El juego cooperativo es idÃƒÂ©ntico al juego de un solo jugador.\n- Incluye un sistema de puntuaciÃƒÂ³n en el que vas subiendo constantemente de nivel y sirve para desbloquear mejoras para el cooperativo o transferir esa puntuaciÃƒÂ³n al modo Multiplayer para desbloquear mejoras para el online.\n- Hay un escenario dÃƒÂ³nde un jugador tiene que atraer la atenciÃƒÂ³n de un tanque mientras el otro sube encima suya y le lanza granadas a la escotilla.\n\nMultiplayer:\n\n- 16 jugadores online a la vez.\n- Podremos llevar vehÃƒÂ­culos. SegÃƒÂºn el modo Multiplayer podremos llevar un tipo de vehÃƒÂ­culos u otros, no serÃƒÂ¡ obligatorio llevarlos.\n- Sistema de subir de nivel de COD4. TraerÃƒÂ¡n novedades y mejoras mÃƒÂ¡s acordes a la ÃƒÂ©poca. No tendremos mirillas lÃƒÂ¡ser ni similares.\n- Puede haber un jefe de equipo y este dar ÃƒÂ³rdenes a sus soldados (se indica con el HUD, para decir dÃƒÂ³nde se le necesita).","torrent":{"xt":"urn:btih:82ca508b5d2470c623affe3ad9ba559218b6cdff","amp;dn":"Call.of.Duty.5.World.at.War.%5BPCDVD5%5D.%5BESP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ca508b5d2470c623affe3ad9ba559218b6cdff","infoHashBuffer":{"type":"Buffer","data":[130,202,80,139,93,36,112,198,35,175,254,58,217,186,85,146,24,182,205,255]},"announce":[],"urlList":[]}}