{"title":"Cannabis Collection - Mr Nice - Howard Marks - 2003","uid":7425019,"size":1664401408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:834a3d81c4f97b52fccab6a2b999c0656c0d20f8&amp;dn=Cannabis+Collection+-+Mr+Nice+-+Howard+Marks+-+2003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1341776090,"description":"\n\n\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nHoward Marks - Mr. Nice - 2003 - early edition in this series\n\nMark tells again the tales of his often hazy days at Oxford University and talks in incredible detail and hilarity of his life both as a pot smuggler and today as a former smuggler and campaigner for the legalisation of marijuana. At one stage or another Marks has spent time in some of the toughest prisons on the planet, often sharing jokes and smokes with some of the most dangerous criminals of our time. At others he has spent time living it up as an 'International Man of Mystery' always watching his back, always watching millions of dollars slip through his hands. A man who has experienced highs and lows and many more highs, a man of boundless wisdom, this footage brings Howard Marks and the whole experience well and truly into your living room for the story of a life you won't forget. 'A Video Diary' does nothing more than to re-emphasise Marks' cult status and popularity among people of all ages and backgrounds but still does more than that. It shows again that Howard is a truly a nice guy and a living ledgend. \n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n\t\t","torrent":{"xt":"urn:btih:834a3d81c4f97b52fccab6a2b999c0656c0d20f8","amp;dn":"Cannabis+Collection+-+Mr+Nice+-+Howard+Marks+-+2003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834a3d81c4f97b52fccab6a2b999c0656c0d20f8","infoHashBuffer":{"type":"Buffer","data":[131,74,61,129,196,249,123,82,252,202,182,162,185,153,192,101,108,13,32,248]},"announce":[],"urlList":[]}}