{"title":"The Oxford Book of English Love Stories - John Sutherland","uid":12023291,"size":994834,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:836a96c9daebd4e04fde14e4e096f83ff3449896&amp;dn=The+Oxford+Book+of+English+Love+Stories+-+John+Sutherland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1434478194,"description":"Adulterous love, marital love, virginal love, religious devotion, agape, lust, eros: there are an infinite variety of meanings that can be packed into the four letters that spell love, and writers of fiction have been trying for centuries to plumb its depths. We turn to literature in large part to learn what love is and what it should be, and readers of The Oxford Book of English Love Stories will find consolation and inspiration in equal measure from some of the sharpest observers of this most essential human emotion.\n\nFrom the bittersweet ending of Trollope's ultra-Trollopian &quot;The Parson's Daughter of Oxney Colne;&quot; to the intricate rituals of courtship in Sylvia Plath's &quot;Stone Boy with Dolphin;&quot; to Paul Theroux's sardonic study of innocence in &quot;An English Unofficial Rose,&quot; this collection is a looking glass into the many moods of love. Editor John Sutherland has searched two centuries of English literature to select twenty-eight wholly original works, choosing those that best represent the rich and varied nature of love itself. Readers will find stories by Mary Shelley, W. M. Thackeray, Thomas Hardy, H. G. Wells, John Galsworthy, Virginia Woolf, Aldous Huxley, Graham Greene, and many others, all of which explore the infinite varieties of love and its shifting rules. Indeed, the rules of the game of love tend to change with every new set of players and with each generation. In D.H. Lawrence's &quot;Samson and Delilah,&quot; the game is violent and fraught with physical injury. In Katherine Mansfield's &quot;Something Childish but very Natural,&quot; love is more reminiscent of two people playing chess blindfolded. And, in Joyce Cary's &quot;The Tunnel,&quot; it seems that the lovers cannot, tantalizingly, even get themselves on to the same playing field.\nBittersweet endings, ironic angles on traditional platitudes, and other surprises make the insights of writers such as Elizabeth Bowen, W. Somerset Maugham, or V. S. Pritchett always fresh and challenging. Simple or sophisticated, sometimes hilarious and often very moving, The Oxford Book of English Love Stories brings a delightful perspective to the mysteries of love","torrent":{"xt":"urn:btih:836a96c9daebd4e04fde14e4e096f83ff3449896","amp;dn":"The+Oxford+Book+of+English+Love+Stories+-+John+Sutherland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"836a96c9daebd4e04fde14e4e096f83ff3449896","infoHashBuffer":{"type":"Buffer","data":[131,106,150,201,218,235,212,224,79,222,20,228,224,150,248,63,243,68,152,150]},"announce":[],"urlList":[]}}