{"title":"Bart Budwig - Whisky Girl [2012] [FLAC / WEB]","uid":8423680,"size":207350455,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84b431e8d780890d00e7d21765f1c2f99f925be3&amp;dn=Bart+Budwig+-+Whisky+Girl+%5B2012%5D+%5BFLAC+%2F+WEB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":11,"time":1367276481,"description":"01. -Intro 02:00\n02. - Whisky Girl 02:27\n03. - Weary Mind 04:38\n04. - Mommas Don't Let Your Babies Grow Up To Be Cowboys 02:59\n05. - A Coke and a Smile 05:18\n06. - Hold On Me 04:03\n07. - Change Your Mind 03:12\n08. - Smokin' 02:25\n09. - Texas 02:49\n10. - B Song 03:27\n\nThe press release for this album asks the age old question &quot;where do songwriters come from?&quot; Whilst this may be a bit of a rhetorical question, Bart Budwig certainly knows some of the tricks of the trade. Whether he is willing to part with them is a moot point but on further investigation of this, his debut album, he has certainly left some clues along with a few red herrings.\nWhat may seem on the surface like a traditional country album with its delightful pedal steel kicking off the first song proper 'Whiskey Girl' after a rather odd intro, soon develops into a piece of work which shows great potential. Bart Budwig has already set his stall out with several EPs but the wider canvas offers a deeper route into his psyche. A disparate range of influences gives this album both a traditional feel and a contemporary one. Take the boom-shick-a-boom of 'Weary Mind' where one is reminded of Johnny Cash until a mid song breakdown which could very well be Deer Tick. It is this dichotomy that keeps Whiskey Girl interesting. Highlight is the stunning 'A Coke And a Smile' which is epic in scope and forms the centrepiece of the album. Both weary and late night torn, it keeps its fractured heart close to its chest until a tongue in cheek ending prevents us from sinking into malaise.\n\nFollowing this was always going to be a hard task so it is testament to Budwig's style that he manages. Things get decidedly darker with 'Hold On Me' where he admits to having &quot;no control&quot; before the rest of the album shifts into s smoothed out groove which shows no rush to end. The flow of songs is delightful and satisfying with songs like the rhythmic Smokin' giving way to the broodier Texas. A good start then, and one that will hold Bart Budwig in good stead. It would have been nice to see him rock out more and there is potential for this. In the meantime delve into a world of heartache and whiskey.","torrent":{"xt":"urn:btih:84b431e8d780890d00e7d21765f1c2f99f925be3","amp;dn":"Bart+Budwig+-+Whisky+Girl+%5B2012%5D+%5BFLAC+%2F+WEB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b431e8d780890d00e7d21765f1c2f99f925be3","infoHashBuffer":{"type":"Buffer","data":[132,180,49,232,215,128,137,13,0,231,210,23,101,241,194,249,159,146,91,227]},"announce":[],"urlList":[]}}