{"title":"Steven Masood - Captive of Christ","uid":4869631,"size":1648775,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84e26f2359370b7ba57d86cbb57004257bb1d42a&amp;dn=Steven+Masood+-+Captive+of+Christ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":3,"time":1240729207,"description":"Two of the must read literature for all christians. We all know the Bible changes lives. Here are two vivid testimonies of the same. It will strengthen your faith enormously in our savior Jesus Christ. \n\nStory of Steven Masood, Captive of Christ\n=========================================\n\nA vivid testimony to the faithfulness of God in the life of one young man who learned to trust Him.\n\nSteven Masood was born into an Ahmadi community near to Peshawar in northern Pakistan. Disheartened by the orthodox Muslim designation of the Ahmadis as unbelievers, he determined to become a true Muslim, to follow the path of the prophet. His study of the QurÃƒÂ¢n led him to the study of the Bible, facilitated by the gift of a copy of John's Gospel in Urdu. He began the arduous task of reconciling the comments of the QurÃƒÂ¢n regarding the gospel, to the Gospel he was now reading. And this eventually led to him leaving Islam for Christianity. In his own words to himself &quot;You cannot keep two swords in one scabbard.&quot;\n\nIt was not without cost. Born Masood Ahmad Khan his parents disowned him and denied to him his family name. He was beaten and threatened. Disowned by his family and friends, Masood got baptized and became Steven Masood. Faced with persecution from Ahmadis and orthodox Muslims alike he moved to England. But here, too, he encountered frequent opposition, on one occasion having acid thrown at him. As he comments Islam does not allow its adherents to abandon faith that easily. They become targets of all sorts of persecution, which then persuades some of them to abandon what they have found. \n\nThough he was beaten and persecuted, Steven Masood fought to be allowed to follow the Lord Jesus Christ. His Ahmadi Muslim family and friends tried hard to prevent him, but Steven triumphed to become a Captive of Christ. \n\n\nSadhu Sundar Singh: A Biography of the Remarkable Indian Disciple of Jesus Christ by Phyllis Thompson\n=====================================================================================================\n\nHalf an hour before his attempt to take his own life, the young Sadhu Sundar Singh (1889-1929) had a dramatic vision of Jesus Christ. Immediately, the emptiness and despair that had filled his heart lifted, and his search for inner peace was over. Read about Sundar Singh's remarkable ministry and his spirit of simplicity, holiness and sacrifice, deftly captured by Phyllis Thompson. Phylis Thompson does a great job of illustrating how empty and hollow are indian religions, how one cannot follow Indian religions and Christ at the same time, and how any can follow Christ without the clumsy trappings of church rituals that constitute institutional Christianity. An inspiring book for all Christians who really want to follow Christ.\n\n\nUploaded by Indian Christian (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;41282f2528202f22293328323528202f73717178013820292e2e6f222e6f282f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:84e26f2359370b7ba57d86cbb57004257bb1d42a","amp;dn":"Steven+Masood+-+Captive+of+Christ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e26f2359370b7ba57d86cbb57004257bb1d42a","infoHashBuffer":{"type":"Buffer","data":[132,226,111,35,89,55,11,123,165,125,134,203,181,112,4,37,123,177,212,42]},"announce":[],"urlList":[]}}