{"title":"Human Evolution: Trails from the Past {BBS}","uid":6913278,"size":14080558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8520462aa8d9bf53077aa15534a9fbafb2102da7&amp;dn=Human+Evolution%3A+Trails+from+the+Past+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1324927853,"description":"Human Evolution provides a comprehensive overview of hominid evolution, synthesizing data and approaches from fields as diverse as physical anthropology, evolutionary biology, molecular biology, genetics, archaeology, psychology, and philosophy.\n\nThe book begins with chapters on evolution, population genetics, systematics, and the methods for constructing evolutionary trees. These are followed by a comprehensive review of the fossil history of human evolution since our divergence from the apes. Subsequent chapters cover more recent data, both fossil and molecular, relating to the evolution of modern humans. A final section describes the evolution of culture, language, art, and morality.\n\nThe authors are leading experts in two complementary fields of scholarship: physical anthropology and molecular evolution. Throughout the book they successfully integrate their expertise in evolutionary theory, phylogenetics, genomics, cultural evolution, language, aesthetics, and morality to produce a cutting edge textbook, copiously illustrated and with an extensive and up-to-date bibliography. The text is suitable for both senior undergraduate and graduate level students taking courses on human evolution within departments of biology, anthropology, psychology, and philosophy. The book may also be of interest to a more general audience seeking a readable, up-to-date, and inclusive treatment of human origins and evolution.\n\n\n# Paperback: 432 pages\n# Publisher: Oxford University Press, USA; 1 edition (November 17, 2007)\n# Language: English\n# ISBN-10: 0198567804\n# ISBN-13: 978-0198567806\n# Product Dimensions: 9.6 x 7.5 x 1 inches ","torrent":{"xt":"urn:btih:8520462aa8d9bf53077aa15534a9fbafb2102da7","amp;dn":"Human+Evolution%3A+Trails+from+the+Past+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8520462aa8d9bf53077aa15534a9fbafb2102da7","infoHashBuffer":{"type":"Buffer","data":[133,32,70,42,168,217,191,83,7,122,161,85,52,169,251,175,178,16,45,167]},"announce":[],"urlList":[]}}