{"title":"Capt. Beefheart - Strictly Personal (1968) [FLAC]","uid":4722434,"size":266034208,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:861b4bfa99de527c78d81de08db15c81e4a85953&amp;dn=Capt.+Beefheart+-+Strictly+Personal+%281968%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"storoa","files":18,"time":1234582580,"description":"Review\tby Stewart Mason\n\nConsidered by many to be a substandard effort due to the circumstances of its release (producer Bob Krasnow, the owner of Blue Thumb, the label which debuted with this album, remixed the album while Don Van Vliet and crew were off on a European tour, adding extraneous sound effects like heartbeats and excessive use of psychedelic-era clichÃƒÂ©s like out-of-phase stereo panning and flanging), 1968's Strictly Personal is actually a terrific album, every bit the equal of Safe As Milk and Trout Mask Replica. Opening with &quot;Ah Feel Like Ahcid,&quot; an a cappella blues workout with its roots in Son House's &quot;Death Letter,&quot; the brief (barely 35 minutes) album is at the same time simpler and weirder than Safe As Milk had been. Working without another songwriter or arranger for the first time, Captain Beefheart strips his idiosyncratic blues down to the bone, with several of the songs (especially &quot;Son of Mirror Man/Mere Man&quot;) having little in the way of lyrics or chords beyond the most primeval stomp. Krasnow's unfortunate sound effects and phasing do detract from the album at points, but the strength of the performances, especially those of drummer John French, make his efforts little more than superfluous window dressing. Strictly Personal is a fascinating, underrated release. ","torrent":{"xt":"urn:btih:861b4bfa99de527c78d81de08db15c81e4a85953","amp;dn":"Capt.+Beefheart+-+Strictly+Personal+%281968%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861b4bfa99de527c78d81de08db15c81e4a85953","infoHashBuffer":{"type":"Buffer","data":[134,27,75,250,153,222,82,124,120,216,29,224,141,177,92,129,228,168,89,83]},"announce":[],"urlList":[]}}