{"title":"The.Opium.Connection.aka.The.Poppy.Is.Also.A.Flower.1966.avi","uid":4515323,"size":734320640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:866ee0e9771d266a068232f2493011d6ce879ef8&amp;dn=The.Opium.Connection.aka.The.Poppy.Is.Also.A.Flower.1966.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"belalugosi","files":1,"time":1226948722,"description":"The Poppy Is Also a Flower, aka. Poppies Are Also Flowers, aka. The Opium Connection, is an oddity of a movie. It's an anti-drug movie funded and produced by the United Nations, with special thanks to the Shah of Iran. It's based on a story by James Bond creator Ian Fleming, and directed by Bond director Terence Young. It has an all star cast, all of whom were paid close to nothing. \n\n\nPlot (from IMDb): &quot;In an attempt to stem the heroin trade from Iran, a group of narcotics agents working for the UN inject a radioactive compound into a seized shipment of opium, in the hopes that it will lead them to the main heroin distributor in Europe. Along the way, they encounter a mysterious woman doing her own investigating of the smuggling operation. Together, they follow the trail as it leads them through the back alleys and luxury resorts of Europe.  &quot;\n\n\nStarring Senta Berger, Stephen Boyd, Trevor Howard, Rita Hayworth, Angie Dickinson, Yul Brynner, Marcello Mastroianni, E.G. Marshall, Anthony Quayle, Harold Sakata, Omar Sharif, Gilbert Roland, Eli Wallach, Barry Sullivan, Howard Vernon among others, and with an introduction by Princess Grace Kelly.\n\n\nFor more background info about the movie, see http://commanderbond.net/article/5170","torrent":{"xt":"urn:btih:866ee0e9771d266a068232f2493011d6ce879ef8","amp;dn":"The.Opium.Connection.aka.The.Poppy.Is.Also.A.Flower.1966.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866ee0e9771d266a068232f2493011d6ce879ef8","infoHashBuffer":{"type":"Buffer","data":[134,110,224,233,119,29,38,106,6,130,50,242,73,48,17,214,206,135,158,248]},"announce":[],"urlList":[]}}