{"title":"Girls - Luna Brothers","uid":3978239,"size":354016081,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:86a51b0dce4f49b8fb230aeb76310b04d2a6d429&amp;dn=Girls+-+Luna+Brothers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"djmanbreast","files":25,"time":1200407196,"description":"Girls is an American monthly comic book limited series created by Jonathan and Joshua Luna, published by Image Comics between 2005 and 2007.\n\nIt tells the story of the people of Pennystown, a community of 63 who are cut off from the rest of the world and attacked by a group of naked, flesh eating, egg-laying women, as well as other bizarre dangers. The first issue was published in May 2005 and the last in April 2007, after 24 issues.\n\n\nJonathan (born 1978) and Joshua Luna (born 1981) are American comics artists. They have created two series together, Ultra and Girls, and provided art for Marvel Comics&amp;#039; Spider-Woman: Origin.\n\nThe Lunas were born in California, but moved frequently during their childhood with their military family to Iceland, Virginia, and Italy. They returned to their home country in their late teens, and attended Savannah College of Art and Design, where they earned degrees in sequential art.\n\nTheir first work together, Ultra, was a miniseries published by Image Comics between 2004 and 2005. Girls was also published by Image and ran, between May 2005 and April 2007. Their latest venture is a limited series, again for Image, called The Sword. It started in October 2007.[1][2] It is intended to last for about two years.","torrent":{"xt":"urn:btih:86a51b0dce4f49b8fb230aeb76310b04d2a6d429","amp;dn":"Girls+-+Luna+Brothers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86a51b0dce4f49b8fb230aeb76310b04d2a6d429","infoHashBuffer":{"type":"Buffer","data":[134,165,27,13,206,79,73,184,251,35,10,235,118,49,11,4,210,166,212,41]},"announce":[],"urlList":[]}}