{"title":"Blowing up Russia-Alexander Litvinenko(Terrorism-Chechnya-Islam-","uid":3630335,"size":1847936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87d03f5bd62df2c2b1e868614a5882b669742676&amp;dn=Blowing+up+Russia-Alexander+Litvinenko%28Terrorism-Chechnya-Islam-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sampooran","files":2,"time":1172855805,"description":"BOTH IN ENGLISH AND RUSSIAN\n\nBook Description\nBlowing up Russia contains the devastating attack of ex-KGB \nofficer Alexander Litvinenko against his former superiors. He was poisoined \nin London with a lethal dose of radio-active Polonium 210 in November 2006. \nIn association with academic Yuri Felshtinsky, he exposes in a meticulous \nstudy how lethal KGB methods were used to catapult Vladimir Putin into \npower as one of the most popular Russian leaders ever to be elected. Banned \nin Russia, based on Litvinenko&amp;#039;s twenty year&amp;#039;s of insider knowledge of \nRussia&amp;#039;s secret campaigns, eloquently written, Blowing up Russia shows how \nthe successors of the KGB were able to survive after being cut loose from \ncommunism. Returning to old-style terror and war, they claimed a `Russian \nway&amp;#039; of government. After reading Litvinenko&amp;#039;s and Felshtinsky&amp;#039;s findings, \nthere seems little doubt that behind the pretence of democracy the \nsuccessor of the KGB has regained its absolute control over the Russian \nFederation. \n\nSynopsis\nVividly written and based on Litvinenko&amp;#039;s 20 year&amp;#039;s of insider&amp;#039;s knowledge of Russian spy campaigns and Yuri Felshtinsky&amp;#039;s comprehensive academic knowledge, &quot;Blowing up Russia&quot; is a meticulous and gripping story how the secret organs of the Russian state are out of control and plotting a return to Russia as a state of terror. Writing about his co-author, Yuri Felshtinsky recounts how the banning of their book in Russia caused 3 related deaths. \n\nFrom the Publisher\nIn this first British publication, Yuri Felshtinsky writes how \nin 1999 he contacted Alexander Litvinenko asking for help investigating the \nMoscow apartment-block bombings that had happened in September that year. \nWhile they pursued their investigations over the years, three people who \nassisted them in Russia were violently killed--two were shot, one was \npoisoned. When they first attempted to publish their findings in Russian, \nthe 5000 copies of the book&amp;#039;s print-run were confiscated on the road from \nLatvia to Moscow. \n\nAbout the Author\nAlexander Litvinenko served in the Russian military for more \nthan 20 years achieving the ranks of Lieutenant-Colonel. In 1999 he was \narrested and imprisoned on charges that were later dismissed. After \ncontinuing further charges (equally dismissed), he escaped from Russia, and \nlived with his family in Great Britain, where he was granted political \nasylum in 2001. \nYuri Felshtinsky studied studied history at Brandeis University and Rutgers \nUniversity, where he received his Ph.D. He lives in Boston and is the \nauthor of several books on Russia. He was one of the last people to speak \nto Litvinenko hours before he succumbed to radio-active poisoning by \nPolonium 210 . He converted to Islam few days before his death.\n\n","torrent":{"xt":"urn:btih:87d03f5bd62df2c2b1e868614a5882b669742676","amp;dn":"Blowing+up+Russia-Alexander+Litvinenko%28Terrorism-Chechnya-Islam-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87d03f5bd62df2c2b1e868614a5882b669742676","infoHashBuffer":{"type":"Buffer","data":[135,208,63,91,214,45,242,194,177,232,104,97,74,88,130,182,105,116,38,118]},"announce":[],"urlList":[]}}