{"title":"Boom! (Split Scenes)","uid":8646655,"size":1126805201,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:88fc391809f30535834057c0b81cdf1be74285be&amp;dn=Boom%21+%28Split+Scenes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":5,"time":1373003076,"description":"Boom! (Split Scenes)\n\nDiamond Kitty, Austin Taylor, Kristina Rose, Kayme Kai, Britney Amber, Nikki Sexx, Angel Vain, Lee Stone, Jon Jon, Carlo Carrera, Bruce Venture\n\nBoom! Has it all! Giant tithes, Giant asses, Giant attitudes and some hot ass girls. Five scenes packed with loads of action featuring some of the curviest porn girls around. The three-way between Austin Taylor, Kayme Kai &amp; Carlo Carrera steams up outside in the blazing sun. Oil flows, asses jiggle while tithes bounce as the three make this one hot scene to watch. Great tease video with the two before taking an all-star pounding. When we say the word Boom! two ladies come to mind Blonde Bombshell Britney Amber and Spicy Latina Diamond Kitty welcome each other's hands and fingers deep inside their wet holes. An erotic lesbian romp between the two makes for wonderful viewing for any lover of girl on girl action. Nikki Sexx is all we have to say! This blonde loves the cock loves to suck it, loves to ride and loves to drain it! Lee Stone is the lucky recipient of Nikki's wild sex drive as she begs for him and his giant cock to go home with her. Another voluptuous pornstar, Angel Vain, takes a big cock with a big load. Angel has it all in a double stacked sized ass and tithes then she takes a gigantic cock in a scene filled with extra big body elements. The DVD is finally concluded with a great performance from the Award winning Kristina Rose! An extra long scene with lots of foot fetish moments followed by high energy only Kristina can deliver. As the end credits will roll, you will appreciate how this DVD gave the extra bang or shall we say Boom! for your buck.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=s389oefff392ijdno0hr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=s389oefff392ijdno0hr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3jxihckyjq70np2h05xd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3jxihckyjq70np2h05xd.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:88fc391809f30535834057c0b81cdf1be74285be","amp;dn":"Boom%21+%28Split+Scenes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88fc391809f30535834057c0b81cdf1be74285be","infoHashBuffer":{"type":"Buffer","data":[136,252,57,24,9,243,5,53,131,64,87,192,184,28,223,27,231,66,133,190]},"announce":[],"urlList":[]}}