{"title":"Atomix Virtual DJ 4.2","uid":3597308,"size":38016610,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:89d4319a8ea1243df9e554f23543a981c98de68a&amp;dn=Atomix+Virtual+DJ+4.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"henningham","files":5,"time":1168986327,"description":"The sequel to AtomixMP3, VirtualDJ is the MP3 mixing software that targets every DJ from bedroom DJs to professional \nsuperstars such as Carl Cox, and is used everyday by millions of DJs, and in many big clubs. It features a breakthrough \nBeatLock engine that will keep your songs in tune and let you work your mixes incredibly faster than any other DJ. \nThe automatic seamless loop engine and the new synchronized sampler will let you perform astounding remixes on the fly. \nVirtualDJ is compatible with timecoded vinyls that let you scratch your MP3s directly on a real turntable, and with \nmany other DJ equipment.\nVirtualDJ will also let you mix and scratch music videos right from your turntables. You can use several interfaces \nto suit both beginners and professionals, record your mixes and burn them on CD, rip DVD, rip vinyl, create your own \nInternet radio, automatically mix playlists, use VST effects, display karaoke, and play DRMed file like Yahoo!\n\nThe automatic seamless loop engine and the brand new synchronised sampler will let you perform astounding remixes live, \nwith no preparation at all.\nThe visual representation and the cues allow you to clearly see the song&amp;#039;s structure, and never be surprised by a \nbreak anymore.\nThe vinyl controls will let you scratch like on a real turntable, except that with the beatlock engine your scratches \nwill never end out of the beat.","torrent":{"xt":"urn:btih:89d4319a8ea1243df9e554f23543a981c98de68a","amp;dn":"Atomix+Virtual+DJ+4.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d4319a8ea1243df9e554f23543a981c98de68a","infoHashBuffer":{"type":"Buffer","data":[137,212,49,154,142,161,36,61,249,229,84,242,53,67,169,129,201,141,230,138]},"announce":[],"urlList":[]}}