{"title":"Need You Now - James Grippando","uid":8533246,"size":158808481,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8a574ffd5abf04de074972abfc262a177244b956&amp;dn=Need+You+Now+-+James+Grippando&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"abvault","files":3,"time":1370208133,"description":"The New York Times best-selling author returns with a gripping, new stand-alone novel ripped from the headlines, in which a young financial advisor and his girlfriend uncover a conspiracy that reaches from Wall Street deep into the halls of government.\n\nAbe Cushman, the evil genius behind a $60 billion Ponzi scheme, has killed himself and taken his secrets to the grave.\n\nFor Patrick Lloyd, a young Wall Street advisor at the worlds largest Swiss bank, Cushmans fall has unexpected - and deadly - repercussions. Lloyds girlfriend, Lilly, is directly tied to billions of dollars in losses suffered by Cushmans most dangerous victims, a group of powerful investors whose identities and dirty finances are well hidden. What Lilly knows can get her and Patrick killed, and now the pair are in a run for their lives that leads to the heart of a clandestine operation, and to a cabal of powerful officials determined to keep their agenda hidden from the public.\n\nWith nowhere to turn and no one to trust, Patrick and Lilly must uncover the truth before they become collateral damage in a financial war in which casualties are no longer measured in dollars and cents.\n\n----------------------------\nVisit us for this and more:\n\nwww.audiobookvault.ws\n----------------------------","torrent":{"xt":"urn:btih:8a574ffd5abf04de074972abfc262a177244b956","amp;dn":"Need+You+Now+-+James+Grippando","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a574ffd5abf04de074972abfc262a177244b956","infoHashBuffer":{"type":"Buffer","data":[138,87,79,253,90,191,4,222,7,73,114,171,252,38,42,23,114,68,185,86]},"announce":[],"urlList":[]}}