{"title":"Grounded For Life","uid":4885756,"size":16592748880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d7713e98dfa74928f78a2bd5fe19d237231d77c&amp;dn=Grounded+For+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wipeoutnet","files":88,"time":1241720731,"description":"TV Sitcom 'Grounded For Life'\nComplete with all 5 seasons\n\nEpisodes:\n\nGrounded For Life - S01E01 - Lily B. Goode\nGrounded For Life - S01E02 - In My Room\nGrounded For Life - S01E03 - I Wanna Be Suspended\nGrounded For Life - S01E04 - Devil with a Plaid Skirt\nGrounded For Life - S01E05 - Action Mountain High\nGrounded For Life - S01E06 - You Can't Always Get What You Want\nGrounded For Life - S01E07 - Like a Virgin\nGrounded For Life - S01E08 - Devil's Haircut\nGrounded For Life - S01E09 - Eddie's Dead\nGrounded For Life - S01E10 - Catch Us If You Can\nGrounded For Life - S01E11 - Jimmy's Got a Gun\nGrounded For Life - S01E12 - Jimmy Was Kung Fu Fighting\nGrounded For Life - S01E13 - Loser\nGrounded For Life - S01E14 - Mrs Finnerty Youve Got A Lovely Daughter\nGrounded For Life - S01E15 - Love Child\nGrounded For Life - S02E01 - Baby, You Can't Drive My Car\nGrounded For Life - S02E02 - Dream On\nGrounded For Life - S02E03 - Don't Let Me Download\nGrounded For Life - S02E04 - Rubber Sold\nGrounded For Life - S02E05 - Bang on a Drum\nGrounded For Life - S02E06 - Smoke on the Daughte\nGrounded For Life - S02E07 - I Saw Daddy Hitting Santa Claus\nGrounded For Life - S02E08 - Let's Talk About Sex, Henry\nGrounded For Life - S02E09 - Is She Really Going Out With Walt\nGrounded For Life - S02E10 - We Are Family\nGrounded For Life - S02E11 - Mr. Roboto\nGrounded For Life - S02E12 - Don't Fear The Reefer\nGrounded For Life - S02E13 - Take It To The Limit\nGrounded For Life - S02E14 - Eddie Said Knock You Out\nGrounded For Life - S02E15 - Safety Dance\nGrounded For Life - S02E16 - Relax\nGrounded For Life - S02E17 - The Kids Are Alright\nGrounded For Life - S02E18 - Swearing To God\nGrounded For Life - S02E19 - Eddie and This Guy with Diamonds\nGrounded For Life - S02E20 - I Fought The In Laws\nGrounded For Life - S02E21 - Dust In The Wind\nGrounded For Life - S02E22 - Oops!...I Did It Again\nGrounded For Life - S03E01 - I Didn't Start The Fire\nGrounded For Life - S03E02 - Mustang Lily\nGrounded For Life - S03E03 - Cat Scratch Fever\nGrounded For Life - S03E04 - Drive Me Crazy\nGrounded For Life - S03E05 - Just Like a Woman\nGrounded For Life - S03E06 - Henry's Been Working For The Drug Squad\nGrounded For Life - S03E07 - Cuts Like A Knife\nGrounded For Life - S03E08 - Who Are You\nGrounded For Life - S03E09 - Welcome.to.the.working.week\nGrounded For Life - S03E10 - Claudia In Disguise With Glasses\nGrounded For Life - S03E11 - Tonight's The Night\nGrounded For Life - S03E12 - Oh, What a Knight\nGrounded For Life - S03E13 - Part Time Lover\nGrounded For Life - S04E01-02 - Your Father Should Know\nGrounded For Life - S04E03 - All the Young Nudes\nGrounded For Life - S04E04 - I Right the Wrongs\nGrounded For Life - S04E05 - I Just Paid to Say I Love You\nGrounded For Life - S04E06 - S.A.T. and Sympathy (a.k.a. S.A.T. Out of Hell)\nGrounded For Life - S04E07 - Pay You Back With Interest\nGrounded For Life - S04E08 - Ticket to Ride\nGrounded For Life - S04E09 - Smells Like Teen Spirit\nGrounded For Life - S04E10 - Baby Comeback\nGrounded For Life - S04E11 - Been Caught Stealing\nGrounded For Life - S04E12 - (She's Got) Kegs\nGrounded For Life - S04E13 - My Ex-boyfriends Back\nGrounded For Life - S04E14 - Communication Breakdown\nGrounded For Life - S04E15 - All Apologies\nGrounded For Life - S04E16 - I Think Were Alone Now\nGrounded For Life - S04E17 - Can't Get Next to You\nGrounded For Life - S04E18-19 - Racketman - Me and Mrs. O\nGrounded For Life - S04E20-21 - Tombstone Blues - Pictures of Willy\nGrounded For Life - S04E22 - It's Hard to be a Saint in the City\nGrounded For Life - S04E23 - Beat on the Brat\nGrounded For Life - S04E24 - The Cheat Is On\nGrounded For Life - S04E25 - You're So Vain\nGrounded For Life - S04E26 - Pressure Drop\nGrounded For Life - S04E27 - Get A Job\nGrounded For Life - S04E28 - Space Camp Oddity\nGrounded For Life - S05E01 - The Policy of Truth\nGrounded For Life - S05E02 - Day Tripper\nGrounded For Life - S05E03 - One Is the Loneliest Number\nGrounded For Life - S05E04 - Day Tripper\nGrounded For Life - S05E05 - You Better You Bet\nGrounded For Life - S05E06 - Psycho Therapy\nGrounded For Life - S05E07 - I'm Looking Through You\nGrounded For Life - S05E08 - Mystery Dance\nGrounded For Life - S05E09 - Do Ya Think I'm Sexy\nGrounded For Life - S05E10 - Tom Sawyer\nGrounded For Life - S05E11 - The Letter(s)\nGrounded For Life - S05E12 - Crazy\nGrounded For Life - S05E13 - Hello, Goodbye\n","torrent":{"xt":"urn:btih:8d7713e98dfa74928f78a2bd5fe19d237231d77c","amp;dn":"Grounded+For+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7713e98dfa74928f78a2bd5fe19d237231d77c","infoHashBuffer":{"type":"Buffer","data":[141,119,19,233,141,250,116,146,143,120,162,189,95,225,157,35,114,49,215,124]},"announce":[],"urlList":[]}}