{"title":"report - gli scoppiati.avi","uid":4456449,"size":696012974,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8dad17bfc3fe17afa2aeeb5dd389d6fdbb16730c&amp;dn=report+-+gli+scoppiati.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"signo","files":1,"time":1224507634,"description":"Il sistema finanziario si sta disintegrando sotto i nostri occhi, alcune banche sono fallite, altre lo stanno per fare, altre ancora stanno tremando e con loro i risparmiatori e i politici di tutto il mondo, mentre tutto ÃƒÂ¨ aumentato, il pane, la benzina, le rate del mutuo...\n\nChi o cosa ci sta rovinando la vita? E&amp;#039; solo colpa di alcuni istituti bancari americani che sui mutui &quot;malefici&quot; ci volevano guadagnare sopra tre volte?\n\nSono gli speculatori, ÃƒÂ¨ colpa dell&amp;#039;Euro o dei Cinesi e gli Indiani che hanno smesso di andare in bicicletta e ora costringono noi ad usarla? E poi ci dobbiamo rassegnare a pagare prezzi sempre piÃƒÂ¹ alti oppure stiamo solo vivendo in una immensa bolla speculativa? Negli ultimi 10 anni siamo passati dalla bolla della new economy a quella immobiliare, dalla bolla del credito a quella del petrolio e delle materie prime. Le bolle partono da un&amp;#039;idea di business che risponde ad un bisogno vero, qualcuno comincia a guadagnare bene, e chi ha tanti soldi da investire lo fa in grandi quantitÃƒÂ : ÃƒÂ¨ cosÃƒÂ¬ che si solleva l&amp;#039;onda. Gli investimenti all&amp;#039;inizio rendono anche fino al 30 % e la gente comincia a vedere un miraggio finanziario: opportunitÃƒÂ  reali anche dove non ci sono. E&amp;#039; inevitabile che a un certo punto la bolla scoppi.\n\nE chi resta con il cerino che brucia in mano? E&amp;#039; sempre la gente comune, anche perchÃƒÂ© ÃƒÂ¨ sempre la stessa bolla che si riempie e che esplode. Chi la crea lo fa per rifarsi delle perdite della precedente. Cosa si puÃƒÂ² fare per farli smettere?","torrent":{"xt":"urn:btih:8dad17bfc3fe17afa2aeeb5dd389d6fdbb16730c","amp;dn":"report+-+gli+scoppiati.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dad17bfc3fe17afa2aeeb5dd389d6fdbb16730c","infoHashBuffer":{"type":"Buffer","data":[141,173,23,191,195,254,23,175,162,174,235,93,211,137,214,253,187,22,115,12]},"announce":[],"urlList":[]}}