{"title":"Air (Anime) 480p Complete sub indo","uid":9149435,"size":648540017,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8fdda75a3eb4b4b875d86e7abc3fc74ddc64610f&amp;dn=Air+%28Anime%29+480p+Complete+sub+indo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Firstando","files":12,"time":1383661964,"description":"Plot:\nDengan setting pertengahan musim panas, Air bercerita mengenai tiga orang gadis dan seorang pemuda. Yukito Kunisaki, sang pemuda dan tokoh utama cerita ini adalah seorang ahli boneka yang berkelana keliling Jepang untuk melanjutkan pencarian ibunya terhadap &quot;gadis di angkasa&quot;.\nDi awal cerita, Yukito tiba di sebuah kota kecil di tepi pantai. Di hari pertamanya di kota ini, Yukito berusaha mencari uang dengan melakukan pertunjukkan bonekanya di depan sekelompok anak-anak. Yukito tidak berhasil membuat anak-anak tersebut terkesan dan akhirnya anak-anak itu meninggalkan Yukito begitu saja, tanpa memberikan bayaran.\nKelelahan setelah gagal mendapatkan uang, dan tidak mampu membeli sesuap nasi, Yukito jatuh tertidur di suatu dinding pembatas dekat pantai. Saat ia terbangun, disampingnya sudah ada Misuzu Kamio - seorang gadis muda yang cukup aneh, sedikit ceroboh tapi baik hati. Misuzu sangat ingin, bahkan sedikit memaksa Yukito menjadi temannya. Saat mengetahui bahwa Yukito belum memakan apa-apa, Misuzu mengajak Yukito pulang kerumahnya. Tertarik oleh makanan, Yukito akhirnya mengikuti Misuzu kerumahnya dan akhirnya Yukito tinggal sementara waktu disana.\nPada masa dimana Yukito tinggal serumah dengan Misuzu, Yukito bertemu lagi dengan dua orang gadis, Kano Kirishima dan Minagi Tohno, yang sama seperti Misuzu, memiliki sifat yang sedikit aneh. Dari sini cerita akan dimulai, dimana Yukito akan lebih mengenal satu per satu gadis, sifat-sifat mereka yang lebih dalam, masalah yang mereka hadapi sekarang dan dimasa lalu dan kemudian upaya Yukito untuk memecahkan masalah itu.\n\n-----------------------------------------------------------------------------\nVisitand follow my twitter @gangga_saisho","torrent":{"xt":"urn:btih:8fdda75a3eb4b4b875d86e7abc3fc74ddc64610f","amp;dn":"Air+%28Anime%29+480p+Complete+sub+indo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdda75a3eb4b4b875d86e7abc3fc74ddc64610f","infoHashBuffer":{"type":"Buffer","data":[143,221,167,90,62,180,180,184,117,216,110,122,188,63,199,77,220,100,97,15]},"announce":[],"urlList":[]}}