{"title":"J.F. Lewis - Void City Series: Books 1 -3","uid":6860543,"size":7224510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fff2b1e14bb22d4b83159178f5bbbc10f6441fa&amp;dn=J.F.+Lewis+-+Void+City+Series%3A+Books+1+-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VoidCity","files":4,"time":1322876417,"description":"UNREPENTANT. UNIMPRESSED. AND TOTALLY UNDEAD.\n\nEric's got issues. He has short-term and long-term memory problems; he can't remember who he ate for dinner yesterday, much less how he became a vampire in the first place. His best friend, Roger, is souring on the strip club he and Eric own together. And his girlfriend, Tabitha, keeps pressuring him to turn her so she can join him in undeath. It's almost enough to put a Vlad off his appetite. Almost.\n\nEric tries to solve one problem, only to create another: he turns Tabitha into a vampire, but finds that once he does, his desire for her fades -- and her younger sister, Rachel, sure is cute. And when he kills a werewolf in self-defense, things really get out of hand. Now a pack of born-again lycanthropes is out for holy retribution, while Tabitha and Rachel have their own agendas -- which may or may not include helping Eric stay in one piece.\n\nAll Eric wants to do is run his strip club, drink a little blood, and be left alone. Instead, he must survive car crashes, enchanted bullets, sunlight, sex magic, and werewolves on ice -- not to mention his own nasty temper and forgetfulness.\n\nBecause being undead isn't easy, but it sure beats the alternative.","torrent":{"xt":"urn:btih:8fff2b1e14bb22d4b83159178f5bbbc10f6441fa","amp;dn":"J.F.+Lewis+-+Void+City+Series%3A+Books+1+-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fff2b1e14bb22d4b83159178f5bbbc10f6441fa","infoHashBuffer":{"type":"Buffer","data":[143,255,43,30,20,187,34,212,184,49,89,23,143,91,187,193,15,100,65,250]},"announce":[],"urlList":[]}}