{"title":"[PS2] [NTSC-US] Dance Dance Revolution Supernova","uid":4108285,"size":1574736110,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:9167df4b8b151ee56fdc4510bd28b7ce7b692db9&amp;dn=%5BPS2%5D+%5BNTSC-US%5D+Dance+Dance+Revolution+Supernova&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"D4RK-PIRAT3","files":2,"time":1206916302,"description":"from wikipedia: &amp;#039;Dance Dance Revolution SuperNova (Dancing Stage SuperNova in Europe) is an arcade game in the Dance Dance Revolution series of music video games. It was produced by Konami and released through Betson Enterprises. The game was released in Europe on April 28, 2006, followed shortly by the North American release on May 15. Unlike previous DDR arcade releases, the versions for Japan, North America and Europe will have the same features and song list.\n\nThe Japanese version is its 9th traditional arcade release, and the first since Dance Dance Revolution Extreme in 2002. The North American version is its third arcade release, and the first since Dance Dance Revolution USA in 2000. The European version is its fifth arcade release, and the first since Dancing Stage Fusion in 2004.\n\nThe release contains 303 songs. Of those, 64 are completely new to DDR (including three Extra Stage songs and a One More Extra Stage), and a total of 57 songs are from home versions of DDR and are appearing on an arcade machine for the first time. Of the songs that are new to DDR, 19 are licensed. There are two sets of unlockable songs revealed on the section of the DDR SuperNova website labeled &quot;Secret&quot;. The first set is accessed by choosing Expert Mode, and passing the final stage with an AA or better. These songs are Healing-D-Vision by DE-STRAD, Fascination MAXX by 100-200-400, and Fascination ~eternal love mix~ by 2MB. The second set is unlocked by clearing any Secret Song (a song unlocked by the first method) in EXTRA STAGE. The song unlocked by this method is CHAOS by DE-SIRE retunes.[1]&amp;#039;","torrent":{"xt":"urn:btih:9167df4b8b151ee56fdc4510bd28b7ce7b692db9","amp;dn":"%5BPS2%5D+%5BNTSC-US%5D+Dance+Dance+Revolution+Supernova","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9167df4b8b151ee56fdc4510bd28b7ce7b692db9","infoHashBuffer":{"type":"Buffer","data":[145,103,223,75,139,21,30,229,111,220,69,16,189,40,183,206,123,105,45,185]},"announce":[],"urlList":[]}}