{"title":"[Kung Fu] Wheels on Meals (Jackie Chan, 1984) - DVD/Rmvb","uid":3686908,"size":327291938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92eb8f58d8f42445c33bda37682cbe922250e2d3&amp;dn=%5BKung+Fu%5D+Wheels+on+Meals+%28Jackie+Chan%2C+1984%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"John Smith","files":4,"time":1179013142,"description":"Wheels on Meals (Jackie Chan, 1984)\n\nHKFlix Says:  \t4.5 Stars\n\nOne of the best Jackie Chan films, and probably the best Chan/Biao/Hung collaboration. Features the best fight in any Chan film.\n\nAvg. Rating: \t\n  4.5 / 5 (based on 22 ratings).\n\nPlot:\tAction and humor abound in the streets of Barcelona, culminating with a battle in the castle hideout of the evil gang.\n\nOverview:\tWheels on Meals is a nonstop laughfest full of action packed fights and chases. The fight between Jackie and Benny &quot;THE JET&quot; Urquidez was hailed by INSIDE KUNG FU magazine as &quot;One of the greatest fights of all time.&quot; The movie takes place in Spain. Chan and Yuen Biao play two lunch-truck restaurateurs who are trying to make a living selling egg rolls and hamburgers in the busy squares of Barcelona. Hung is a novice private investigator searching for a beautiful pickpocket named Sylvia (Lola Ferner) whose thieving teams her up with Chan and Yuen. Sylvia is kidnapped after she discovers she is actually a wealthy heiress, and that&amp;#039;s when Chan, Yuen, and Hung join forces to free her and kick some bad guys&amp;#039; butts. Wheels on Meals is lighthearted fun with stunts and action scenes (including skateboarding tricks and a scene in which Chan and Yuen face off against a motorbike gang) that simply reaffirm the stars&amp;#039; physical and comic talents. The celebrated fight scene is a matchup between Chan and international kickboxing champion Benny &quot;the Jet&quot; Urquidez. The intensity of their scenes together spurred rumors of a rivalry beyond the film. Whether or not this was true, the two paired up again four years later in Dragons Forever. As for the nonsensical title, one theory claims the film&amp;#039;s distributor (Golden Harvest) had little success with films whose titles started with &quot;m&quot; so they simply switched the two words around.\n\nCast: \tJackie Chan (Sing Lung)  ||  Sammo Hung (Kam Bo)  ||  Yuen Biao  ||  Lola Forna  ||  Benny &quot;The Jet&quot; Urquidez\n\nCameos: Richard Ng Yil-Hon  ||  John Sham  ||  Kin-Fun  ||  Herb Edelman \n","torrent":{"xt":"urn:btih:92eb8f58d8f42445c33bda37682cbe922250e2d3","amp;dn":"%5BKung+Fu%5D+Wheels+on+Meals+%28Jackie+Chan%2C+1984%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92eb8f58d8f42445c33bda37682cbe922250e2d3","infoHashBuffer":{"type":"Buffer","data":[146,235,143,88,216,244,36,69,195,59,218,55,104,44,190,146,34,80,226,211]},"announce":[],"urlList":[]}}