{"title":"Spin Dependent Transport in Magnetic Nanostructures","uid":15538941,"size":15499949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95338b2839b192f61cbf9775184519fc41b867d4&amp;dn=Spin+Dependent+Transport+in+Magnetic+Nanostructures&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470908687,"description":"Spin Dependent Transport in Magnetic Nanostructures - Sadamichi Maekawa, Teruya Shinjo (CRC, 2002).pdf\r\n\r\nIn magnetic systems of nano-meter size, the interplay between spin and charge of electrons provides unique transport phenomena. In magnetic superlattices, magnetic and non-magnetic metallic thin films with thickness of the order of one nano-meter are piled-up alternately. Since the discovery of giant magnetoresistance (GMR) in these superlattices in 1988, spin dependent transport phenomena in magnetic nanostructures have received much attention from both academic and technological points of view.\r\n\r\nFerromagnetic tunnel junctions made of ferromagnetic metal electrodes and a very thin insulating barrier between them are also of current interest as magnetoresistive devices, where the tunneling current depends on the relative orientation of magnetization (TMR). In addition to magnetic superlattices and magnetic tunnel junctions, magnetic granular systems and magnetic dots have been studied extensively as magnetoresistive systems. \r\n\r\nEdited by two of the world's leading authorities, Spin Dependent Transport in Magnetic Nanostructures introduces and explains the basic physics and applications of a variety of spin-dependent transport phenomena in magnetic nanostructures with particular emphasis on magnetic multilayers and magnetic tunnel junctions","torrent":{"xt":"urn:btih:95338b2839b192f61cbf9775184519fc41b867d4","amp;dn":"Spin+Dependent+Transport+in+Magnetic+Nanostructures","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95338b2839b192f61cbf9775184519fc41b867d4","infoHashBuffer":{"type":"Buffer","data":[149,51,139,40,57,177,146,246,28,191,151,117,24,69,25,252,65,184,103,212]},"announce":[],"urlList":[]}}