{"title":"Puzzle Quest Challenge of the Warlords [PSP][USA]","uid":4221692,"size":94071526,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:958c106c79307145a659daeffac62db942661af5&amp;dn=Puzzle+Quest+Challenge+of+the+Warlords+%5BPSP%5D%5BUSA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xtreme-Downloads","files":3,"time":1212622658,"description":"Puzzle Quest: Challenge of the Warlords is a game developed by Australian company Infinite Interactive and published by D3 Publisher. The game combines role-playing with strategy and puzzle elements. It utilizes a competitive Bejeweled-style playfield to simulate combat and other activities common to role-playing games.\n\nThe game was first published simultaneously for the Nintendo DS and PlayStation Portable in early 2007, and several ports to other systems were subsequently announced. The Xbox Live Arcade version was released on October 10, 2007. The Wii version came out on November 29, 2007. The version for Windows came out on October 22, 2007, although the downloadable PC version is available as of October 10, 2007. A version for PlayStation 2 was released on November 13, 2007, and will be followed by a mobile version for cell phones in early 2008.\n\nOn November 16, 2007 at Game Connect, a conference for Australian game developers, lead designer Steve Fawkner announced that Infinite Interactive is working on a free, web-based game that will tie-in with Puzzle Quest and the developer's future titles.\n\nIn a D3 Publisher press release regarding the hiring of Adam Roberts as VP of Europe, a sequel was announced for Puzzle Quest with a 2008 release date. At the 2008 Game Developers Conference, Galactrix became publicly known as Puzzle Quest: Galactrix.","torrent":{"xt":"urn:btih:958c106c79307145a659daeffac62db942661af5","amp;dn":"Puzzle+Quest+Challenge+of+the+Warlords+%5BPSP%5D%5BUSA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"958c106c79307145a659daeffac62db942661af5","infoHashBuffer":{"type":"Buffer","data":[149,140,16,108,121,48,113,69,166,89,218,239,250,198,45,185,66,102,26,245]},"announce":[],"urlList":[]}}