{"title":"Forbidden Holywood Collection Vol. 2-Disk3-DVD5- Night Nurse (19","uid":9263357,"size":4032561152,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9696c8e1dd2feaf8aa14fd8f75dfe08dab4261b9&amp;dn=Forbidden+Holywood+Collection+Vol.+2-Disk3-DVD5-+Night+Nurse+%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1385660445,"description":"Forbidden Holywood Collection Vol. 2 -Disk 3-DVD5- Night Nurse (1931) Barbara Stanwyck film [DDR]\n\nNight Nurse is a 1931 all-talking pre-code, Prohibition-era, crime drama and mystery film produced and distributed by Warner Bros. and directed by William A. Wellman. \nThe film stars Barbara Stanwyck, Ben Lyon, Joan Blondell, Clark Gable and Vera Lewis. \nThe film contains many pre-code elements, particularly the scene where Stanwyck and Blondell are seen in their lingerie. \nGable portrays a vicious chauffeur gradually starving two little girls to death after having run over and killed their sister with his car.\n\nAccording to Robert Osborne, on Turner Classic Movies, the part of &quot;Nick the Chauffeur&quot; was originally intended for James Cagney, but his success in The Public Enemy prevented his accepting a supporting role, paving the way for Gable.\n\n   CAST:-\n    Barbara Stanwyck as Lora Hart\n    Ben Lyon as Mortie\n    Joan Blondell as B. Maloney\n    Clark Gable as Nick, the Chauffeur\n    Blanche Friderici as Mrs Maxwell, the Housekeeper\n    Charlotte Merriam as Mrs Ritchey\n    Charles Winninger as Dr Arthur Bell\n    Edward J. Nugent as Eagan\n    Vera Lewis as Miss Dillon, Superintendent of Nurses\n    Ralf Harolde as Dr Milton A. Ranger\n    Walter McGrail as Mack, the Drunk\n\nDirected by William A. Wellman\nWritten by Grace Perkins (novel), Oliver H.P Garrett\n\nSYNOPSIS:- Night Nurse (1931)\nLora Hart (Barbara Stanwyck) applies for a job as a trainee nurse in a hospital, but is rejected by Miss Dillon (Vera Lewis) for not having graduated from high school. Fortunately, a chance encounter with the hospital's chief of staff, Dr. Arthur Bell (Charles Winninger), in an uncooperative revolving door gets that requirement waived. Lora's roommate and fellow nurse, Miss Maloney (Joan Blondell), becomes her best friend.\n\nOne day, Lora treats bootlegger Mortie (Ben Lyon) for a gunshot wound and earns his gratitude by letting herself be persuaded not to report it to the police as required by law. He also admires the pretty young nurse.\n\nAfter she passes her training, Lora is hired for private duty, looking after two sick children, Desney and Nanny Ritchie (Betty Jane Graham and Marcia Mae Jones) at the mansion of their alcoholic socialite mother (Charlotte Merriam), where there is always a party going on. When a drunk guest tries to molest her, Nick the brutish chauffeur (Clark Gable) knocks him out. Then, when she turns down his demand that she pump out the stomach of a very drunk Mrs. Ritchie, he knocks Lora out and removes her to her room.\n\nLora becomes alarmed by the treatment prescribed by Dr. Milton Ranger (Ralf Harolde) for the children, because she sees that they are being slowly starved to death, but she is unable to get anybody to take her seriously. She quits and takes her suspicions to Dr. Bell. He is initially reluctant to interfere with another doctor's patients, but eventually advises her to return to her job so she can gather evidence. She manages to persuade Dr. Ranger to take her back.\n\nFinally, Nanny Ritchie becomes so weak, Lora fears for her life and tries unsuccessfully get Mrs. Ritchie to show any concern. By chance, Mortie is making a delivery of booze to the perpetual party at the mansion. Desperate, Lora sends Mortie for milk for a bath for the child, a folk remedy recommended by the frightened housekeeper, Mrs. Maxwell (Blanche Friderici). Maxwell gets drunk and confides to Lora her suspicion that Nick and Dr. Ranger are working to murder the children in order to get at their trust fund. Mrs. Ritchie is in love with Nick, and he plans to marry her. After being threatened by Mortie, Dr. Bell shows up and examines the little girl. However, when Bell tries to get the child to the hospital, Nick punches him. Mortie stops Nick from interfering further, and the child's life is saved by an emergency blood transfusion provided by Lora.\n\nThe next day, Mortie gives Lora a lift in his car. To allay her worries, he informs her that he told some of his friends that he didn't like Nick. Elsewhere, an ambulance brings a body dressed in a chauffeur's uniform to the hospital's morgue.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 72 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 72 mins","torrent":{"xt":"urn:btih:9696c8e1dd2feaf8aa14fd8f75dfe08dab4261b9","amp;dn":"Forbidden+Holywood+Collection+Vol.+2-Disk3-DVD5-+Night+Nurse+%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9696c8e1dd2feaf8aa14fd8f75dfe08dab4261b9","infoHashBuffer":{"type":"Buffer","data":[150,150,200,225,221,47,234,248,170,20,253,143,117,223,224,141,171,66,97,185]},"announce":[],"urlList":[]}}