{"title":"Modern Cable Television Technology 2nd Edition - (Malestrom)","uid":7433725,"size":6522604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96b4ff633ad8da95eef3f0cbd09bc025211341a7&amp;dn=Modern+Cable+Television+Technology+2nd+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1342014737,"description":"Walter Ciciora, James Farmer, David Large, Michael Adams, &quot;Modern Cable Television Technology, 2 Edition &quot;\nMorgan Kaufmann | 2003 | ISBN: 1558608281 | 1052 pages | PDF\n\n\nFully updated, revised, and expanded, this second edition of Modern Cable Television Technology addresses the significant changes undergone by cable since 1999--including, most notably, its continued transformation from a system for delivery of television to a scalable-bandwidth platform for a broad range of communication services. It provides in-depth coverage of high speed data transmission, home networking, IP-based voice, optical dense wavelength division multiplexing, new video compression techniques, integrated voice/video/data transport, and much more.\n\n\nIntended as a day-to-day reference for cable engineers, this book illuminates all the technologies involved in building and maintaining a cable system. But it's also a great study guide for candidates for SCTE certification, and its careful explanations will benefit any technician whose work involves connecting to a cable system or building products that consume cable services.\n\n*Written by four of the most highly-esteemed cable engineers in the industry with a wealth of experience in cable, consumer electronics, and telecommunications.\n\n*All new material on digital technologies, new practices for delivering high speed data, home networking, IP-based voice technology, optical dense wavelength division multiplexing (DWDM), new video compression techniques, and integrated voice/video/data transport.\n\n*Covers the latest on emerging digital standards for voice, data, video, and multimedia.\n\n*Presents distribution systems, from drops through fiber optics, an covers everything from basic principles to network architectures.\n","torrent":{"xt":"urn:btih:96b4ff633ad8da95eef3f0cbd09bc025211341a7","amp;dn":"Modern+Cable+Television+Technology+2nd+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b4ff633ad8da95eef3f0cbd09bc025211341a7","infoHashBuffer":{"type":"Buffer","data":[150,180,255,99,58,216,218,149,238,243,240,203,208,155,192,37,33,19,65,167]},"announce":[],"urlList":[]}}