{"title":"PetiteHDPorn - Jillian Janson, Sydney Cole (Multi Masseuse) NEW","uid":12805630,"size":294059438,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9730e557055e27305703ead5c6867e883f61ee44&amp;dn=PetiteHDPorn+-+Jillian+Janson%2C+Sydney+Cole+%28Multi+Masseuse%29+NEW+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1448121526,"description":"Johnny Castle has offered both Sydney Cole and Jillian Janson a massage. Jillian is happy to watch as Johnny works his magic getting Sydney naked, and then she spreads her legs eagerly when it's her turn to lose her clothes. When Johnny shifts his attention back to Sydney, Jillian joins him to put her magic tongue to work helping Johnny deliver a bald pussy licking.The two girls get their first chance to enjoy Johnny's cock when he strips out of his briefs and lies down on the massage table. A wet and horny double blowjob leaves Jillian and Sydney excited to take things a step further. When Jillian mounts Johnny's hardon and slides down until her landing strip fuck hole is filled to the brim, Sydney mirrors her lover's movements by pressing her dripping twat to Johnny's mouth.Both girls enjoy their ride on their willing man, and things only get better for Sydney when they switch things up so that Johnny can deliver a proper pussy pounding in her cum hungry twat while she works on eating Jillian out. Changing positions once again, Sydney lays with her head beneath Johnny's cock so she can watch with eagerness as he fucks Jillian to orgasmic bliss. Moments later when he fills Jillian's twat with a creampie of cum then pulls out to cover Jillian's ass with the rest, Sydney opens her mouth to receive a mouthful of salty love that she shares with Jillian.\r\nTags: Medium Boobs, Shaved Pussy, Blonde, Long hair, Hardcore, Lesbian, Tan, Petite, Girl-Girl-Boy, Blowjob, Creampie, Deep Throat\r\n \nhttp://imgdone.com/viewer.php?file=77647745679051223093.jpg\r\n \nhttp://imgdone.com/viewer.php?file=63858120387407977637.jpg","torrent":{"xt":"urn:btih:9730e557055e27305703ead5c6867e883f61ee44","amp;dn":"PetiteHDPorn+-+Jillian+Janson%2C+Sydney+Cole+%28Multi+Masseuse%29+NEW+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9730e557055e27305703ead5c6867e883f61ee44","infoHashBuffer":{"type":"Buffer","data":[151,48,229,87,5,94,39,48,87,3,234,213,198,134,126,136,63,97,238,68]},"announce":[],"urlList":[]}}