{"title":"Doc And Merle Watson - Pickin The Blues [Vinyl-180g]-aksman","uid":5999870,"size":746372379,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9739ce8ffdec0dbb868114b7e894bb9f46d14ef6&amp;dn=Doc+And+Merle+Watson+-+Pickin+The+Blues+%5BVinyl-180g%5D-aksman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"insinuendo","files":22,"time":1291153570,"description":"Doc &amp; Merle Watson - Pickin' The Blues [Analogue Productions 180g LP] 24-bit/96kHz\nPosted By : aksman | Date : 22 Nov 2010 23:36:44 |\n\n\nDoc &amp; Merle Watson - Pickin' The Blues\nAnalogue Productions 180g LP / APF 026\nMastered by Doug Sax &amp; The Mastering Lab\nVinyl rip in 24-bit/192 kHz (converted to 24/96) | FLAC | m3u, cue &amp; Tech Log\nArtwork | DR Analysis | 750 | RS &amp; Filefactory | Folk, Blues | 1985\n\nAllmusic.com rating: 4 / 5 Stars\n\nSon Merle Watson gets top billing along with his dad on this superior release of acoustic mountain music, but it is really a group effort in which the smooth mastery of Doc Watson serves as a kind of a picture frame for each of the musical canvases included.... Fans of acoustic guitar will love this record -- the instruments are recorded beautifully, especially in that warm, sonorous mid-register.\n- Eugene Chadbourne/AMG\n\nPickin' the Blues is the title of a recording by American folk music artists Doc Watson and Merle Watson, released in 1985.\n\nReview by Eugene Chadbourne/AMG\n\nSon Merle Watson gets top billing along with his dad on this superior release of acoustic mountain music, but it is really a group effort in which the smooth mastery of Doc Watson serves as a kind of a picture frame for each of the musical canvases included. The album title might indicate some limitation in the material, but the concept of &quot;blues&quot; has always been a bit more open in the white, Appalachian tradition than in Afro-American music. For example, one of the chord changes in &quot;Freight Train Blues&quot; would have probably made Muddy Waters want to jump out in front of one. Of course, a great amount of work has gone into segregating black and white music throughout the United States, with the Appalachian area absolutely no exception. Jesse Helms would no doubt be proud of how much energy has gone into making it seem like the black and white musicians of his home state of North Carolina had absolutely nothing to do with each other over the years. What we have here is really a delightful blend of several different blues traditions, transcending the stupid questions of race as if it were a bit of dust that can be blown off a the phonograph needle. Some of the music is quite swinging, such as &quot;Carroll County Blues,&quot; the fiddle playing of Sam Bush evoking more the clean sound of jazz violinists than the rugged tone of old-time fiddlers. &quot;Stormy Weather&quot; comes from the catalog of vocal jazz classics that are strongly influenced by blues, but actually have their own harmonic structure that is quite different from typical blues. Watson is such a fine vocalist that he is able to make a number such as this sound relatively fresh, no doubt helped by a blend of acoustic instruments not normally associated with this type of tune. But whatever style the players take on, everything is performed beautifully with deep feeling, comfortable tempos, and inspired picking that is never simply grandstanding. Fans of acoustic guitar will love this record -- the instruments are recorded beautifully, especially in that warm, sonorous mid-register.\n\n\nTrack listing\n\nAll songs Traditional unless otherwise noted.\n\nSide A\nMississippi Heavy Water Blues (Barbeque Bob)  2:48\nSittin' Here Pickin' the Blues (Coleman, Watson)  3:07\nStormy Weather (Harold Arlen, Ted Koehler)  3:44\nWindy and Warm (John D. Loudermilk)  2:02\nSt. Louis Blues (W. C. Handy)  2:59\nJailhouse Blues (Sleepy John Estes)  2:40\n\nSide B\nFreight Train Blues  2:35\nHobo Bill's Last Ride (Jimmie Rodgers) 3:36\nCarroll County Blues  2:47\nBlue Ridge Mountain Blues  2:44\nI'm a Stranger Here  3:07\nHoney Babe Blues  3:20\n\n\n\nPersonnel\n\nDoc Watson - guitar, vocals\nMerle Watson - guitar, slide guitar\nT. Michael Coleman - bass, harmony vocals\nSam Bush - fiddle, mandolin\nJoe Smothers - background vocals\n\n\nTechnical Log\n\nRCM Hannl 'limited' with &quot;Circulating Brush&quot;\nMusic Hall MMF 9.1 Turntable\nTonearm: Pro-Ject 9cc evo with Pure Silver Wires\nCartridge: Nagaoka MP-500\nBrocksieper Phonomax (Tube Phono PreAmp) (temporarily replaced by &quot;ProJect Tube-Box 2 SE)\nE-MU 0404 external USB 2.0 Audiointerface\nInterconnections : Silent Wire NF5\nWaveLab 6 recording software\niZotope RX Advanced 1.21 for resampling and dithering\n\nVacuum cleaning - TT - Brocksieper Phonomax - E-MU 0404 - WaveLab 6 (24/192) - manual click removal - analyze (no clipping, no DC Bias offset) - converted to 24/96 (16/44.1) with iZotope RX Advanced 1.21 - split into individual Tracks - FLAC encoded (Vers. 1.21)\n\nNo silence been removed, please burn gapless to match original tracklayout.\n\n\nPersonal Note\n\nWith my vinyl transfers, I try to catch the whole beauty of vinyl records; therefore I don't use any post-processing or any sound improvement. What you get is a clear and flat transfer. For getting a clear sound, I'll do an extended washing of each record with my RCM, which can take up to 30 minutes brushing on each side. Resistant ticks and clicks I try to remove as good as possible, but the priority is not to lose any musical information in the process. Surface noises, as long they are not too high, are left in place. Only on bad pressings or on records recorded at extremely low levels do I use a fade in-/-out. As John Peel said, &quot;Life is full of surface noises.&quot; In some cases this means that I have to make a compromise.... The result has to pass my personal quality criteria, which is IMO quite high.","torrent":{"xt":"urn:btih:9739ce8ffdec0dbb868114b7e894bb9f46d14ef6","amp;dn":"Doc+And+Merle+Watson+-+Pickin+The+Blues+%5BVinyl-180g%5D-aksman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9739ce8ffdec0dbb868114b7e894bb9f46d14ef6","infoHashBuffer":{"type":"Buffer","data":[151,57,206,143,253,236,13,187,134,129,20,183,232,148,187,159,70,209,78,246]},"announce":[],"urlList":[]}}