{"title":"Call of the Wild (1935) DVD5 - Subs-Eng-Espanol - Clark Gable, L","uid":11629824,"size":4588468224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:975b4dc1e0022b717d09d53fe180f8852e0044ad&amp;dn=Call+of+the+Wild+%281935%29+DVD5+-+Subs-Eng-Espanol+-+Clark+Gable%2C+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1417666640,"description":"Call of the Wild (1935) DVD5 - Subs-Eng-Espanol - Clark Gable, Loretta Young [DDR]\n\nThe Call of the Wild is a 1935 American adventure film directed by William A. Wellman and starring Clark Gable, Loretta Young, and Jack Oakie. \nBased on Jack London's novel of the same name, the film omits all but one of the book's story lines.\n\n    CAST:-\n    Clark Gable as Jack Thornton\n    Loretta Young as Claire Blake\n    Jack Oakie as 'Shorty' Hoolihan\n    Reginald Owen as Mr. Smith\n    Frank Conroy as John Blake\n    Katherine DeMille as Marie\n    Sidney Toler as Joe Groggins\n    James Burke as Ole\n    Charles Stevens as Francois\n    Lalo Encinas as Kali\n    Thomas E. Jackson as 'Tex' Rickard\n    Harry Woods as 'Soapy' Smith\n\nDirected by William A. Wellman\nProduced by Darryl F. Zanuck\nScreenplay by Gene Fowler, Leonard Praskins\nMusic by Alfred Newman\nRunning time 89 minutes\n\nMOVIE PLOT:- Call of the Wild (1935)\nJack Thornton has trouble winning enough at cards for the stake he needs to get to the Alaska gold fields. His luck changes when he pays $250 for Buck, a sled dog that is part wolf to keep him from being shot by an arrogant Englishman also headed for the Yukon. En route to the Yukon with Shorty Houlihan -- who spent time in jail for opening someone else's letter with a map of where gold is to be found -- Jack rescues a woman whose husband was the addressee of that letter. Buck helps Jack win a $1,000 bet to get the supplies he needs. And when Jack and Claire Blake pet Buck one night, fingers touch. \n\nA prospector heading for the Alaska gold fields loses most of his money gambling. His luck changes when he pays $250 for a sled dog to keep him from being shot by an arrogant Englishman, who is also headed for the Yukon. The prospector and his friend head off for the Yukon with a map showing the location of a major gold mine. Along the way, they rescue a woman whose missing husband owned the original map. After the dog wins them a thousand dollars used to purchase supplies, the three continue north in search of the gold mine.\n\nThis was the last film released under the 20th Century Pictures' banner before it merged with Fox Film Corporation to create 20th Century-Fox.\n\nPRODUCTION NOTES:-\nn 1935, during the making of Call of the Wild on location in Washington state, Gable and his beautiful leading lady Loretta Young fell madly in love. Young was 23 and Gable was 34. After the film's completion, Loretta Young found out she was pregnant.  A devout Catholic, Young refused a secret abortion that 20th Century Fox insisted upon. She herself realized that it would destroy her career and Gable's as well if the news became known.  Wisely, she took a six month break, took a vacation in Europe and then came back to Hollywood, secretly had the baby, put the child into a foundling home and later adopted the child as an orphan. Only Louella Parsons was privy to the plan. When William Wellman, director of Call of the Wild, saw the child for the first time, he comented on what big ears she had. Gable was aware of the child despite everything. Loretta Young loved her child dearly.\nDuring the filming of The Call of the Wild, Clark Gable and Loretta Young had an affair that resulted in Young's hushed-up pregnancy and the birth of their daughter Judy Lewis (1935-2011).\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 6153 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 89 mins\nSubtitles: Eng, Espanol\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:975b4dc1e0022b717d09d53fe180f8852e0044ad","amp;dn":"Call+of+the+Wild+%281935%29+DVD5+-+Subs-Eng-Espanol+-+Clark+Gable%2C+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"975b4dc1e0022b717d09d53fe180f8852e0044ad","infoHashBuffer":{"type":"Buffer","data":[151,91,77,193,224,2,43,113,125,9,213,63,225,128,248,133,46,0,68,173]},"announce":[],"urlList":[]}}