{"title":"Final Destination Trilogy (Multisubs PAL)","uid":3670273,"size":14042574848,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:98e853a8deb3c059803b4884d66948a85b0fb6a2&amp;dn=Final+Destination+Trilogy+%28Multisubs+PAL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ubehage","files":3,"time":1177222881,"description":"Final Destination (2000)\n------------------------\n&quot;Face Your Deepest Fears... Before They Face You.&quot;\n\nIMDB: http://imdb.com/title/tt0195714/\n\nAudio: English\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\n\nPlot outline:\nAlex and a group of high school students take a flight to Paris for a French class trip. Before they set off, Alex has a premonition of the plane bursting into flames minutes after take off. He tells everyone to get off the ill-fated aircraft. Moments later in the departure lounge the student see the plane explode before their very eyes. Now the FBI thinks that Alex had something to do with it and follows his every move. His friends start to believe he had something to do with it also and slowly fade out of his life. But now, each one of his friends is mysteriously being killed by something that appears to the Grim Reaper. Alex starts to believe that fate is starting to taking it&amp;#039;s toll.\n\n\nFinal Destination 2 (2003)\n--------------------------\n&quot;Death is like a boomerang. it keeps coming back.&quot;\n\nIMDB: http://imdb.com/title/tt0309593/\n\nAudio: English\n\nSubs: English, Swedish, Norwegian, Danish, Finnmish, Icelandic\n\n\nPlot outline:\nKimberly Corman and her friends decide to head out on a trip. On the way, they get caught up in a horrible accident, in which Kimberly survives, but her friends die brutally. Kimberly also saves a few other people. Soon after the accident, the survivors of the accident start dropping like flies. Now, it&amp;#039;s up to Kimberly, along with the help of Flight 180 junkie Thomas Burke, Clear Rivers, and the Mortician William Bloodworth, Kimberly must find a way to stop death before it&amp;#039;s to late... Before it&amp;#039;s her turn\n\n\nFinal Destination 3 (2006)\n--------------------------\n&quot;This Ride Will Be The Death Of You.&quot;\n\nIMDB: http://imdb.com/title/tt0414982/\n\nAudio: English\n\nSubs: English, Suomi, Swedish, Norwegian, Danish, Icelandic\n\nSpecial Feature: Choose-Their-Fate; You control the movie :)\n\n\n\nPlot outline:\nAfter a high school senior, Wendy Christensen (Mary Elizabeth Winstead), has a fatal premonition of a disastrous roller-coaster accident that involves her and her friends, she warns everyone and luckily gets herself and many of her friends and others off the roller-coaster before it sets off, after they get off and the roller-coaster starts off, it crashes just like in her premonition, soon she teams up with a friend, Kevin Fischer (Ryan Merriman) as well as many other people, some including Erin (Alexz Johnson) and Ian (Kris Lemche) to try and cheat death. Will they succeed or will they learn a lesson that you just can&amp;#039;t cheat death?","torrent":{"xt":"urn:btih:98e853a8deb3c059803b4884d66948a85b0fb6a2","amp;dn":"Final+Destination+Trilogy+%28Multisubs+PAL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98e853a8deb3c059803b4884d66948a85b0fb6a2","infoHashBuffer":{"type":"Buffer","data":[152,232,83,168,222,179,192,89,128,59,72,132,214,105,72,168,91,15,182,162]},"announce":[],"urlList":[]}}