{"title":"Michael Moore, Dude, Where's My Country, mobi [dovah]","uid":8902907,"size":1050805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:990ac2024d3a0313ccf79ae4297e247e7fdcd4b5&amp;dn=Michael+Moore%2C+Dude%2C+Where%27s+My+Country%2C+mobi+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dovah12","files":3,"time":1378845562,"description":"The people of the United States, according to author and filmmaker Michael Moore (Bowling for Columbine, Stupid White Men), have been hoodwinked. Tricked, he says, by Republican lawmakers and their wealthy corporate pals who use a combination of concocted bogeymen and lies to stay rich and in control. But while plenty of liberal scholars, entertainers, and pundits have made similar arguments in book form, Moore's Dude, Where's My Country? stands out for its thoroughly positive perspective. Granted, Moore is angry and has harsh words for George W. Bush and his fellow conservatives concerning the reasoning behind going to war in Iraq, the collapse of Enron and other companies, and the relationship between the Bushes, the Saudi Arabian government, and Osama bin Laden. But his book is intended to serve as a handbook for how people with liberal opinions (which is most of America, Moore contends, whether they call themselves &quot;liberals&quot; or not) can take back their country from the conservative forces in power. Moore uses his trademark brand of confrontational, exasperated humor skillfully as he offers a primer on how to change the worldview of one's annoying conservative blowhard brother-in-law, and he crafts a surprisingly thorough &quot;Draft Oprah for President&quot; movement. Refreshingly, Dude, Where's My Country? avoids being completely one-sided, offering up areas where Moore believes Republicans get it right as well as some cutting criticisms of his fellow lefties. Such allowances, brief though they may be, make one long for a political climate where the shouting polemicists on both sides would see a few more shades of gray. Dude, Where's My Country? is a little bit scattered, as Moore tries to cram opinions on Iraq, tax cuts, corporate welfare, Wesley Clark, and the Patriot Act into one slim volume--and the penchant to go for a laugh sometimes gets in the way of clear arguments. But such variety also gives the reader more Moore, providing a broader range of his bewildered, enraged, yet stalwartly upbeat point of view. --John Moe\n\nISBN13: 9780446693790\nISBN10: 0446693790","torrent":{"xt":"urn:btih:990ac2024d3a0313ccf79ae4297e247e7fdcd4b5","amp;dn":"Michael+Moore%2C+Dude%2C+Where%27s+My+Country%2C+mobi+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990ac2024d3a0313ccf79ae4297e247e7fdcd4b5","infoHashBuffer":{"type":"Buffer","data":[153,10,194,2,77,58,3,19,204,247,154,228,41,126,36,126,127,220,212,181]},"announce":[],"urlList":[]}}