{"title":"MistressT-----Fag boy for bbc  720p","uid":9396225,"size":307602730,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:99fdb89df27d195b321b8dfbe1289ee454faeafb&amp;dn=MistressT%5C-----Fag+boy+for+bbc++720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"merzedes","files":1,"time":1387988048,"description":"MistressT Fag boy for bbc\n\n\nThis is a custom vid (no name mentioned)... &quot;Son, we need to have a little chat. Last night I saw what you did. I saw you with that black man. I knew you would be humiliated if I interrupted...&amp; you're old enough to make your own choices. You were very clearly into it. You loved that big black cock. I saw everything, you kissing &amp; caressing. I saw you sucking his cock, him sucking yours, him fucking you in different positions...I saw him cum in your ass. I wanted you to know that I saw it &amp; that I'm aware of your obsession with big black cock. I looked at the history on your computer &amp; I see all the BBC porn you've been watching. I know you're embarrassed, having this conversation with your own M0THER but I also see that you have a woody. I think you should stroke off &amp; cum for me now. I saw how you came last night, on your back with that thick black meat in your ass...I saw what happened next too. I saw him pull his cock out of your gaping, cum-filled ass &amp; he told you to lick it clean. I saw you do it, you sucked that black dick after it had been in your ass...remembering it &amp; your own MILF talking about it...you can't help yourself from cumming again, as taboo as it is...&quot; ~~~ This is a MILF/BOY JOI/MASTUBATION INSTRUCTION with INTERRACIAL GAY visuals &amp; verbals...light HUMILIATION. I am neither overly sweet &amp; loving or mean, just matter-of-fact. If you're into humiliation you might find just the situation humiliating enough without me rubbing it in. If you're into the 'loving M0MMY' thing you might find me loving enough in that I don't pass any judgement or communicate disappointment or disgust..I'm just letting you know that I saw what happened. One might think that I find it all arousing, but again, I don't make that obvious so you can go either way on that depending on what you're into.\n\n\n\nScreens                                                                         \n                                                     &lt;a href=&quot;\nhttp://image.bayimg.com/9ecabbecfed3d7f9e6f25a7e59de21b2e6e2a032.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/9ecabbecfed3d7f9e6f25a7e59de21b2e6e2a032.jpg&lt;/a&gt;\n\n\n12 000 uploads and counting, 13k here we come, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\n\nCheers  :-)\t","torrent":{"xt":"urn:btih:99fdb89df27d195b321b8dfbe1289ee454faeafb","amp;dn":"MistressT%5C-----Fag+boy+for+bbc++720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fdb89df27d195b321b8dfbe1289ee454faeafb","infoHashBuffer":{"type":"Buffer","data":[153,253,184,157,242,125,25,91,50,27,141,251,225,40,158,228,84,250,234,251]},"announce":[],"urlList":[]}}