{"title":"Chris Bathgate - Salt Year [2011][EAC.Log,Cue.FLAC]","uid":9325824,"size":228703632,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b4f6f44cbcd43d3e97eff137ea92a7f9405c164&amp;dn=Chris+Bathgate+-+Salt+Year+%5B2011%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":15,"time":1386629483,"description":"Artist: Chris BathgateRelease: Salt Year\nReleased: 2011\nLabel: Quite Scientific Records \nCatalog#:QSR-021\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\nimage\n\n\n01. Eliza (Hue) (4:51)\n02. No Silver (2:53)\n03. Poor Eliza (4:04)\n04. Levee (2:34)\n05. Fur Curled On The Sad Road (4:20)\n06. Borders (3:44)\n07. In The City (2:44)\n08. Own Design (3:10)\n09. Salt Year (4:39)\n10. Time (2:44)\n11. Everything (Overture) (6:15)\n\n\n\n\nWill Oldham wrote &quot;I See a Darkness,&quot; but on his album Salt Year, Chris Bathgate doesn't just see those shadows, he lives in them. Michigan-based songwriter Bathgate doesn't wallow in depression or bad times for their own sake on Salt Year, but this is a set of songs that clearly reflects a difficult period in one man's life, one of personal and romantic disappointment, and the dour beauty of the melodies and the spare, haunted, open spaces of the performances communicate the downbeat nature of this music just as well as Bathgate's strong, carefully nuanced lyrics, and vocals. As Bathgate says in the title tune, &quot;I'm just choking down a salt year, when sugar's all I've longed for,&quot; and this is music that expresses loss and longing with clarity and emotional honesty, and without sentimentality. Bathgate already demonstrated he was a gifted singer and songwriter on 2007's fine A Cork Tale Wake, but here his material is, if anything, stronger and better crafted, and as a piece of record making, Salt Year is particularly impressive. Working with producers Chris Koltay and Jim Roll, Bathgate has made an album that uses dynamics with imagination and intelligence, allowing various instruments to float in and out of the mix to impressive effect, and allowing hard bursts of electric guitar and horns to punctuate the songs so they can cut even deeper. The result is an album that feels like a peer of Wilco's Yankee Hotel Foxtrot or Richard Buckner's Since, a work where fine individual songs cohere into a powerful whole, and an intelligent and thoughtful production takes what could have been a standard-issue contemporary folk recording and turns it into something truly remarkable. Salt Year isn't a happy album, but it's a work of genuine power and beauty from a musician who is becoming one of the most impressive talents the Midwest has to offer...\n","torrent":{"xt":"urn:btih:9b4f6f44cbcd43d3e97eff137ea92a7f9405c164","amp;dn":"Chris+Bathgate+-+Salt+Year+%5B2011%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4f6f44cbcd43d3e97eff137ea92a7f9405c164","infoHashBuffer":{"type":"Buffer","data":[155,79,111,68,203,205,67,211,233,126,255,19,126,169,42,127,148,5,193,100]},"announce":[],"urlList":[]}}