{"title":"Pissed Jeans - Hope For Men [2007] VBR MP3 ~200kbps","uid":4003068,"size":62510640,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b6a2fd236f23e62b73617f474e41ac03950ab99&amp;dn=Pissed+Jeans+-+Hope+For+Men+%5B2007%5D+VBR+MP3+%7E200kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dkords","files":10,"time":1201671586,"description":"Review\tby Thom Jurek\n\nThere is a great deal of irony in the Pissed Jeans&amp;#039; album title Hope for Men, though it may be unintentional. This Allentown, PA quartet (who are all members of the Gatecrashers as well) may have set small parts of the underground on fire with their &quot;Don&amp;#039;t Need Smoke to Make Myself Disappear&quot; single and their debut album Shallow, but given their graduation to Seattle&amp;#039;s Sub Pop label with this sophomore effort, the music biz playing field -- both aural and visual -- gets wider and deeper. These young men present the kind of aggressive sonic attack that references acts ranging from Flipper to Mount Shasta to Stick Men with Rayguns to No Trend and Drunks with Guns, but the kind of a young man&amp;#039;s version of small town alienation they express is simply a less artfully done version of the same emotions expressed on Elvis Costello&amp;#039;s debut album. Yeah, that&amp;#039;s right: The King Is Dead. Long Live The King. Meaning, of course, that as things change and become less and less tuneful, the drive of the ego and id behind them hasn&amp;#039;t changed a bit since the beginning of the invention of the &quot;teenager.&quot; There&amp;#039;s the sort of post-hardcore feedback and ear shattering noise that is Bradley Fry&amp;#039;s guitar, but how is vocalist Matt Kosloff (here known as Matt Korvette -- clever) any different than a latter day David Yow who simply didn&amp;#039;t give a damn what the world made of his sleaze and gross-out lyrics and yowl? Both previous incarnations attempted to articulate, however iconoclastically, that they were losers and that they celebrated it. Yow was a genuine misanthrope and Costello rode his confessed outsider weirdness toward a money pile so big it has him doing commercials for a particular brand of luxury automobile.\n\nA big deal gets made of the fact that the majority of this quartet draw their requisite paychecks in the straight world in their bio. So what? The noisy attack in the sound and genuine adolescence expressed in Korvette&amp;#039;s lyrics: &quot;I&amp;#039;ve still got you, ice cream/&amp;#039;Cause sometimes life is less than a dream/And all my other friends turn away/I need to be with something I can relate/Just a taste and my troubles fall behind&quot; from &quot;I&amp;#039;ve Still Got You (Ice Cream),&quot; or &quot;I&amp;#039;m Right here, in my fantasy world/Setting up all my toys/And making movies and songs/In my fantasy world/It&amp;#039;s Friday night and Saturday morning/In my fantasy world/Sitting near piles of books and drinking a soda/With a slice of pizza in my fantasy world...&quot; from &quot;Fantasy World.&quot; There&amp;#039;s the noise and squall of Fry&amp;#039;s guitar, the throbbing, busted vein of Dave Rosenstrauss&amp;#039; bass; fuzzed out, low slung and filthy, it drives almost every song here. Anger, isolation, and the indictment of anything that exists with any level of acceptance on the surface of the world, outside the fantasy universe of the protagonist, is what&amp;#039;s under sonic attack here. We have to guess that music is a healthier outlet than drug abuse or an obsession with guns , but is that enough to recommend a recording? Perhaps to some. It&amp;#039;s not simply that all this has been said and done before, that&amp;#039;s fine, too; but it&amp;#039;s been said and done so much better, so much scarier and so much crazier than this, which merely sounds as if it&amp;#039;s the post-hardcore mirror dweller&amp;#039;s version of John Mellencamp&amp;#039;s collectivist anthems. It doesn&amp;#039;t rock. It squeals. It doesn&amp;#039;t roll and it&amp;#039;s not particularly sick, either. It&amp;#039;s just there, to take and leave as you please. That these men are now in their twenties and still whining about the grotesqueries of adolescence isn&amp;#039;t new either, but it is what they have to offer, creating not &quot;hope for men,&quot; but reinforcing the kind of anthemic &quot;anti-cool&quot; as somehow authentic vibe that&amp;#039;s been plaguing underground rock for decades. These guys have their underground cred for now, but where do they go next? One more question. whatever happened to Tad anyway; weren&amp;#039;t they on Sub Pop, too? ","torrent":{"xt":"urn:btih:9b6a2fd236f23e62b73617f474e41ac03950ab99","amp;dn":"Pissed+Jeans+-+Hope+For+Men+%5B2007%5D+VBR+MP3+%7E200kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b6a2fd236f23e62b73617f474e41ac03950ab99","infoHashBuffer":{"type":"Buffer","data":[155,106,47,210,54,242,62,98,183,54,23,244,116,228,26,192,57,80,171,153]},"announce":[],"urlList":[]}}