{"title":"Obama's REAL Father (summary) 15-minute YouTube backup version","uid":7423232,"size":108400622,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9b80a84455981641b205be6fc7563cd0c1fe986b&amp;dn=Obama%27s+REAL+Father+%28summary%29+15-minute+YouTube+backup+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1341730912,"description":"OBAMA'S REAL FATHER (summary) \n\nThis is the 15-minute YouTube backup of the summary version of...\n\nDreams From My Real Father: A Story of Reds and Deception (2012) by Joel Gilbert \n\nThe story of Communism in America and the part that Frank Marshall Davis played in forming President Obama's ideological thinking. Based upon actual events, interviews, and archives. Perhaps this is the story that Barack Obama SHOULD have told right from the beginning revealing his true political foundations and his agenda for fundamentally transforming America. \n\nObama's mom's family joined the Unitarian Universalist Church while Obama's grandfather worked for the CIA. The Unitarian Universalist Church figured out a way to temporarily convert their group to what ever religion had a church in a particular area and when they eventually became the majority they would vote the church out of business and take the assets and reopen it as a Unitarian Universalist Church. They understood the concept of leverage to force their will upon the greater number. They take the wolf-in-sheep's-clothing approach to peaceably dominate the greater society. This is the Collectivist approach, also known as Fabianism, to instal Communism world-wide (New-World Order). Yes, the Democrats as well as the Republicans have Global Communism as their goal as do the religions: Catholics (Universalists), Christian Zionists, Jewish Zionists, Mormon Zionists, Unitarian Universalists, etc. Talk about &quot;Controlled Opposition&quot;!!! :o/\n\n","torrent":{"xt":"urn:btih:9b80a84455981641b205be6fc7563cd0c1fe986b","amp;dn":"Obama%27s+REAL+Father+%28summary%29+15-minute+YouTube+backup+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b80a84455981641b205be6fc7563cd0c1fe986b","infoHashBuffer":{"type":"Buffer","data":[155,128,168,68,85,152,22,65,178,5,190,111,199,86,60,208,193,254,152,107]},"announce":[],"urlList":[]}}