{"title":"Eurythmics - Savage Video Album (1988) [384p VHS Rip]","uid":9949948,"size":1119691352,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9ccc2e2441bf4f293163fd20b76a3350a2df8706&amp;dn=Eurythmics+-+Savage+Video+Album+%281988%29+%5B384p+VHS+Rip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1397385475,"description":"This video was a companion for the Eurythmics album of the same name. The studio never released it on DVD for some reason. Might it be they don't care about art, artists or fans?\n\nI ripped this one from my VHS tape and it looks better than you might fear when you try to remember that format. The audio is ac3 (standard) and flac (optional). The flac track sounds less harsh than the ac3 one, I think. If the flac track gives you any grief, just get &quot;mkvmerge GUI&quot; from the web and resave the file without it.\n &lt;a href=&quot;\nhttp://bayimg.com/NanCbaAfI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/NanCbaAfI&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/naNCeaAFi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/naNCeaAFi&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/nancfAafI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/nancfAafI&lt;/a&gt;\n\n\nWIKIPEDIA:\n\nSavage is the title of a video album by the British pop duo Eurythmics, released in 1988 on VHS tape format. It is a companion video to their 1987 music album of the same name.\n\nBackground\n\nThe decision to create a video album to accompany the record was based upon the fact that the band did not want to embark on another full length tour that year (having completed the worldwide &quot;Revenge Tour&quot; some months earlier). Another factor influencing the project may have been the band Blondie (of whom Lennox was a huge fan), who made a similar video album for their 1979 LP Eat to the Beat, which also featured a combination of straight performance as well as more conceptual clips.\n\nDave Stewart's only prominent appearances on the video album are limited to three tracks (and some archive concert footage in a fourth) though these particular clips do not appear to be directly related to the recurring theme. The running order of the tracks on the video album differ from that of the original album, making for a more cohesive concept piece.\n\nConcept\n\nThe majority of the video album was directed by Sophie Muller, and the individual video clips largely (but not exclusively) focus upon Annie Lennox interpreting the madonna-whore complex in the form of a neurotic mousey housewife and an extroverted blonde vamp, and are steeped in metaphorical imagery and subtext. The only tracks not directed by Muller were &quot;Shame&quot; which was directed by Steve Graham (with animation directed by artist Eric Scott and animator Emma Calder), and &quot;I've Got a Lover (Back in Japan)&quot; which was directed by Chester Dent and John Stewart. Lennox would go on to make another thematic video album for her 1992 solo album Diva, again directed by Muller.","torrent":{"xt":"urn:btih:9ccc2e2441bf4f293163fd20b76a3350a2df8706","amp;dn":"Eurythmics+-+Savage+Video+Album+%281988%29+%5B384p+VHS+Rip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ccc2e2441bf4f293163fd20b76a3350a2df8706","infoHashBuffer":{"type":"Buffer","data":[156,204,46,36,65,191,79,41,49,99,253,32,183,106,51,80,162,223,135,6]},"announce":[],"urlList":[]}}