{"title":"Iskyss.2008.NORWEGIAN.PAL.DVDR-AFFECTION","uid":4802560,"size":4781590683,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9dabbbf1450ed2434eb05922731a0f644980a6ec&amp;dn=Iskyss.2008.NORWEGIAN.PAL.DVDR-AFFECTION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lfc_4Ever","files":-1,"time":1238089747,"description":"Iskyss (2008) NORWEGIAN\n6.1/10   21 votes\nNorwegian DD5.1\nno,eng subs\nSource dvd9\n7248 bitrate - 5 passes\n\nstripped warnings, extras and 2.0 audio\n\n\nNorwegian Plot: Iskyss er et sterkt og poetisk drama om kjÃƒÂ¦rlighet og spionasje under den kalde krigen. Den russiske krigsfangen Vladimir og den norske sykepleieren Vera mÃƒÂ¸tes i BodÃƒÂ¸ under andre verdenskrig. Norge og Sovjet er allierte i kampen mot nazistene, men i den kalde krigen som fÃƒÂ¸lger blir landene fiender. Dette skaper problemer for Vladimir og Vera nÃƒÂ¥r de mÃƒÂ¸tes igjen i Moskva.\n\nFilmen er basert pÃƒÂ¥ den sanne historien om Gunvor Galtung Haavik, som i tre tiÃƒÂ¥r levde et dobbeltliv. Under den kalde krigen var hun ansatt i det norske utenriksdepartementet og arbeidet ved ambassaden i Moskva. I rollen som russisk agent matet hun jevnlig KGB med hemmeligstemplet informasjon hun hadde tilgang til gjennom sitt arbeid som tolk og sekretÃƒÂ¦r. Knut Erik Jensen har laget denne spillefilmen med inspirasjon fra Alf R. Jacobsens bok Iskyss og Gunvor Galtung Haaviks brev til sin hemmelige russiske kjÃƒÂ¦reste Vladimir Kozlov. \nHaavik var utdannet sykepleier og hadde arbeidet med russiske krigsfanger pÃƒÂ¥ sykehuset i BodÃƒÂ¸ fÃƒÂ¸r hun fikk jobb i UD. Det var slik de to mÃƒÂ¸ttes, ble allierte i kampen mot nazismen og ikke minst - hodestups forelsket i hverandre. Forholdet skulle vise seg ÃƒÂ¥ bli svÃƒÂ¦rt problematisk; forhold mellom norske ambassadeansatte og russere var forbudt.\nMen som kjent kan ikke kjÃƒÂ¦rligheten styres av politisk makt, og Haavik og Kozlov fortsatte sitt forhold ogsÃƒÂ¥ etter at Haavik ble ansatt ved den norske ambassaden i Moskva. Da KGB ble oppmerksom pÃƒÂ¥ forholdet deres brukte de nettopp dette for ÃƒÂ¥ presse Haavik til ÃƒÂ¥ spionere for dem. Bare hun samarbeidet skulle de ikke skade hennes kjÃƒÂ¦re Volodsjik - Haaviks kjÃƒÂ¦lenavn pÃƒÂ¥ Vladimir. \n&quot;Iskyss&quot; handler om en kvinne som ofrer alt for ÃƒÂ¥ beskytte den hun elsker, og er en film som viser hvor stor kraft kjÃƒÂ¦rligheten kan ha. \n\nKilde: www.Filmweb.no\n\nENJOY                                  Please Seed...","torrent":{"xt":"urn:btih:9dabbbf1450ed2434eb05922731a0f644980a6ec","amp;dn":"Iskyss.2008.NORWEGIAN.PAL.DVDR-AFFECTION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dabbbf1450ed2434eb05922731a0f644980a6ec","infoHashBuffer":{"type":"Buffer","data":[157,171,187,241,69,14,210,67,78,176,89,34,115,26,15,100,73,128,166,236]},"announce":[],"urlList":[]}}