{"title":"Adele - Hometown Glory","uid":4970496,"size":117608452,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9dfe2f083d78eb00fdc6f066d7ff4b843e455b06&amp;dn=Adele+-+Hometown+Glory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1245747582,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Hometown Glory&quot; is the first single from Adele's debut album 19, released on October 22, 2007 in the United Kingdom. In 2008, the song was re-released as her fourth single.\n\nIn 2007, &quot;Hometown Glory&quot; was released on singer Jamie T's Pacemaker Recordings label as a limited edition 7&quot; vinyl single, of which only 500 copies were made. The song failed to chart primarily, however, due to high downloads of the song during the release week of her 19 album, the song managed to chart inside the UK Singles Chart Top 40 for the first time.\n\nThe song was later released in 2008 as Adele's debut single for the U.S. market. Due to the popularity of the song in the UK, which resulted in the song charting inside the UK Top 40 twice on download sales alone, the song was (re-)released as the third single (fourth including the original single release) from the album on July 21, 2008. As of July, 2008, the track has become Adele's third consecutive UK Top 20 hit single.\n\n19 is Adele's debut album. It was released on 28 January 2008, the week after the lead single, &quot;Chasing Pavements&quot;, was physically released. It debuted at number one on the UK charts on its first week. Included is a cover of the Bob Dylan song &quot;Make You Feel My Love&quot; from his 1997 album, Time Out Of Mind.\n\nThe album was nominated for the 2008 Mercury Prize in the category of Best Album. . On December 3, 2008, the album spawned four Grammy Award nominations: Best New Artist, and Record of the Year, Song of the Year, and Best Female Pop Vocal Performance for &quot;Chasing Pavements&quot;.\n\nThe Taiwanese edition was released on March 5. As well as the standard tracklist, the album features three bonus tracks: &quot;That's It I Quit I'm Movin' On&quot; (&quot;Chasing Pavements&quot; B-side), &quot;Now and Then&quot; (&quot;Cold Shoulder&quot; B-side) and &quot;Painting Pictures&quot; (&quot;Make You Feel My Love&quot; B-side). The Indonesian special edition was released on March 3. As well as the standard tracklist, the album features a bonus video for &quot;Chasing Pavements&quot;.\n\nThe song &quot;Hometown Glory&quot; has been featured in the British and American television shows Skins, Grey's Anatomy, One Tree Hill, Hollyoaks, Secret Diary of a Call Girl, and most recently danced by Katee Shean and eventual winner, Joshua Allen on So You Think You Can Dance. Adele recently joked in an interview with GMTV that the album was named &quot;19&quot; after her weight in stone, but in actual fact it was her age at the time of release.\n\nIn the U.S 19 debuted at #56 and remained in the lower ends of the Billboard 200 for many proceding weeks. After a performance on the U.S show &quot;Saturday Night Live&quot; it rose to #46 and a week later to #11 with sales of 25,000+ copies sold.\n\nIn 2009, after winning 2 Grammy Awards, the album rose to a new peak of #10 on the Billboard 200 with over 651,900 copies sold in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9dfe2f083d78eb00fdc6f066d7ff4b843e455b06","amp;dn":"Adele+-+Hometown+Glory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dfe2f083d78eb00fdc6f066d7ff4b843e455b06","infoHashBuffer":{"type":"Buffer","data":[157,254,47,8,61,120,235,0,253,198,240,102,215,255,75,132,62,69,91,6]},"announce":[],"urlList":[]}}