{"title":"One.Night.in.Mongkok.Engsubs.BoNed.","uid":4430593,"size":1466608638,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ed6b8bac24a4991641ef8421c9bb8d6dcd44c61&amp;dn=One.Night.in.Mongkok.Engsubs.BoNed.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Elcode","files":4,"time":1223267110,"description":"One Night in Mongkok, amazing HK movie I found some years back and figured it was worth sharing. However, all versions of this movie that come with English subs have all sorts of spelling and grammar errors. In the case of this copy of One Night in Mongkok, I've used Subtitle Creator to edit the subtitles and free them of annoying errors and whatnot. I'm new at this but I promise there are no viruses or virii or w/e. \n\nPlot Summary:\n\n\nCharacters Mung and Randy are patriarchs in two rival gangs set in Hong Kong three days before Christmas. Mung's foolish and over-the-top son Tiger engages Randy's son Franky in a gang fight that results in war between the gang patriarchs. A hitman gets called in by Mung to find Randy and end the whole thing, and all the while the story follows a handful of police officers trying to resolve the gang war. Badass Kung Fu scenes, a lot of racist, rude, raw Chinese humor that they do their best to hide from the rest of the world.\n\nStars:\n\n11 of 4\n\nSubtitles: To use the subtitles, just make sure the subtitle files have the same name as the video files, and place them in the same folder as the video files. If your media player doesn't activate the subtitles once the movie is played, you may need to tinker with your options or download subtitle like VobSub or whatever. Good luck and America wins everything regardless of what the rest of the world thinks, even Americans. BoNed.","torrent":{"xt":"urn:btih:9ed6b8bac24a4991641ef8421c9bb8d6dcd44c61","amp;dn":"One.Night.in.Mongkok.Engsubs.BoNed.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed6b8bac24a4991641ef8421c9bb8d6dcd44c61","infoHashBuffer":{"type":"Buffer","data":[158,214,184,186,194,74,73,145,100,30,248,66,28,155,184,214,220,212,76,97]},"announce":[],"urlList":[]}}