{"title":"The Dangerous Davies Mystery Collection","uid":7276286,"size":476362182,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f0f08825951fef98a76c5439d890d0f3d3e9a72&amp;dn=The+Dangerous+Davies+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":34,"time":1337292749,"description":"All from Cassettes. (32 kbps / 22 kHz Hz Mono Fraunhofer CBR MP3)\n\n\n\n#1. Dangerous Davies - The Last Detective [8 hours 43 mins] Read by Alexander John\nDavies is a low-ranked CID officer in the London borough of Willesden. He is nicknamed &quot;Dangerous&quot; ironically because he is the member of the department least likely to get into a dangerous situation.\nHe is called &quot;The Last Detective&quot; from his superior's assessment of him as &quot;the last detective you'd ever send out on a case&quot;. Despite this, Davies is by no means a poor detective,\nand although he can take longer than his colleagues, and is dogged by bad luck, he does usually &quot;get his man&quot; in the end.\nIn the first book we find him drifting into the 25 year-old unsolved case of the disappearance of young Celia Norris, a local girl with a dark side.\nWith his friend, the perpetually unemployed and well-read Welshman Mod Lewis (he spends all his time at the library to save on heating) he tracks down the culprit, collecting plenty of cuts, bumps and bruises along the way at the hands of the local villains.\n\n#2. Dangerous In Love [7 hours] Read by Bernard Cribbins\nDetective Constable Davies has two things on his mind: Jemma Duval, the beautiful, black social worker, and 'Lofty' Brock, the harmless old eccentric who drowned in the canal.\nTo prove that Lofty's death was no accident, our hero sets out to do some undercover detective work. He soon discovers that something sinister is going on.\nSomething that requires intuition, dedication, brilliant deduction - and a timely blow with a blunt instrument!\n\n#3. Dangerous By Moonlight [8 hours] Read by Gregory Yorke\nLeslie Thomas's third novel featuring Dangerous Davies, who this time pursues a gang of petty cheque-thieves and is injured in a case of mistaken identity.\nWhile recuperating, he's hired to investigate a murder 15 years before, and this moonlighting is the start of a series of outlandish adventures.\n\n#4. Dangerous And The Lonely Heart [9 hours 24 mins] Read by Gregory Yorke\nDangerous Davies has retired from the Metropolitan Police and set up an office in North London in order to carry on as a private eye.\nThe murder of a woman who answers lonely hearts advertisements,and the disappearance of a young girl student, bring him as just about much work as he can handle.\n\nI uploaded this set previously in 2009 and since have had many requests to seed, so here it is again. This time I have improved the sound quality of books 3 and 4.\nPlease be aware that these transcriptions I made are all from rare old cassette tapes, thus the sound quality is definitely not pristine, but still, they are reasonably hiss free and clear. ","torrent":{"xt":"urn:btih:9f0f08825951fef98a76c5439d890d0f3d3e9a72","amp;dn":"The+Dangerous+Davies+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f0f08825951fef98a76c5439d890d0f3d3e9a72","infoHashBuffer":{"type":"Buffer","data":[159,15,8,130,89,81,254,249,138,118,197,67,157,137,13,15,61,62,154,114]},"announce":[],"urlList":[]}}