{"title":"Graycat - Lonely Bee Dance Club","uid":6462721,"size":94375555,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f4ce382a4b8214136d721954297864aa9872c64&amp;dn=Graycat+-+Lonely+Bee+Dance+Club&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dragonystic","files":12,"time":1307835384,"description":"Every artform has a golden age, a time ripe for experimentation when pioneers test what works in their new media. There's nothing like living through a golden age. Imagine how it felt to be a hip-hop fan in the 80s and 90s, when a potpourri of rap styles flourished under the same banner.\n\n You might know how that felt if you payed attention to the mashup scene for the last few years. The last decade saw the first mashup celebrities, widespread press coverage of the genre, and thousands of websites dedicated to the mashup scene. But lately, I can't help but notice a formula to every new mashup hit: The lyrics and instrumentals of two instantly recognizable songs, usually two pop hits, get spliced together, never mashing more than two songs per track.\n\n Most won't call it a mashup, but Lonely Bee Dance Club by Graycat roughly follows the A+B mashup formula: a capella rap track set to a new beat. But where as most mashups exploit your familiarity with the source material, this album digs up musical artifacts. Most wont recognize a single song getting mashed, contrary to conventional mashups that reward listeners for identifying the samples. Graycat trades in tricks for a broader selection of untapped sound sources to mash.\n\n Lonely Bee Dance Club matches up a syncretic pantheon of rap all stars, plucked from every corner of hip hop's history, showing off the producer's extensive knowledge of music history. And for those who believe the politically charged, socially concious rhymes of Common would never blend along side the festive braggadocio of the late Pimp C., Graycat offers a convincing rebuttal. This juxtaposition of lyrics resembles a long conversation spanning decades.\n\n Lonely Bee Dance Club flaunts its trip hop influences early on, with emphasis on the &quot;trip.&quot; Listeners will leave their bodies as track one crescendos into a psychedelic panorama of auditory bliss. Fans of Massive Attack will feel at home amongst the musty beats and soaring strings. But absent are the typical tropes adorning trip hop: &quot;jazzy&quot; female vocals, tempos so slow they warp time, etc.\n\n But before long, the calm grooves give way to coarser sounds. The gasps of wobble bass in track five gradually mutate into a dense collage of synths by track eight. The impatient may lose interest before they reach the end of the album, but seasoned listeners will follow the flow to its end; The album's most memorable hooks occupy the last three tracks. \n\nAll in all, Lonely Bee Dance Club does what a mashup should - make new songs from the best parts of old songs. It doesn't matter if you recognize any of the samples. The goal is good music without gimmicks, and it succeeds. \n\n- Benjamin McHugh, May 2011\n\n \n1. Nothing to Mash - 5:25\n 2. Props Forever - 3:37\n 3. A Thousand a Pop - 4:50\n 4. What Would Big Say - 3:34\n 5. Set it Off - 3:10\n 6. Georgetown Hoyas - 3:56\n 7. Slow Down the Rhyme - 4:12\n 8. Rewind Time - 4:14\n 9. Lemon Head Delight - 3:26\n 10. Match Numbers - 4:44\n 11. Architect Music - 4.53\n 12. Life Aint a Sitcom - 4.01\n \nTotal Playing Time 50:02 (Continuously Mixed)\n \nMastered at The Hatch Recording Studio in Chicago, IL.\n &lt;a href=&quot; http://thehatchrecording.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thehatchrecording.com/&lt;/a&gt;\n \nAll credit to the producers of these amazing tracks. I merely pieced them together.","torrent":{"xt":"urn:btih:9f4ce382a4b8214136d721954297864aa9872c64","amp;dn":"Graycat+-+Lonely+Bee+Dance+Club","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f4ce382a4b8214136d721954297864aa9872c64","infoHashBuffer":{"type":"Buffer","data":[159,76,227,130,164,184,33,65,54,215,33,149,66,151,134,74,169,135,44,100]},"announce":[],"urlList":[]}}