{"title":"The Murmuring (AVI)","uid":3715329,"size":850481996,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a02a3a7a2a48085cde395b7f8139073c20da7ab1&amp;dn=The+Murmuring+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"quixote73","files":1,"time":1181972523,"description":"&lt;The Murmuring (Nateunmoksori)&gt; (1995)\n\nDirector : Byun Young-joo\nYear of Production : 1995\nGenre : Documentary\nFormat : 16mm/Color\nRunning Time : 98 minutes\n\nEvery Wednesday at noon, the women who were forcibly taken by the Japanese government during World War 2 to serve as sex slaves for the Japanese army, and their supporters, gather to demand that the Japanese government issue a formal apology to the affected women and give them just compensation. These brave women who are in their golden years, have broken their silence, which they had kept thus far from a sense of shame, and are one by one coming forth with their stories.\nSix women who were victimized during the atrocities are living in a house they call ?Nanum,? in Seoul. They aren?t bothered by the scorching summer heat or the freezing winters as they learn to read and write and paint. They are struggling to overcome the scars that have not healed in all the years that have passed.\n\nDirector Bio : Byun Young-joo (1966- )\n\nShe graduated from the Law Department at Ehwa Womans University and did her graduate studies at the Department of Theater and Film at Chung-ang University. Currently, she is the most well-known of all women documentary film makers in Korea. She is a founding member of the women?s film collective, Bariteo, shooting many films and directing A Woman Being In Asia (1993), a film about the sex tourism of Jeju Island. Afterward, she founded a film group called Boim, and made Murmuring, A Woman Being In Asia (1995), a film about former ?comfort women.? Murmuring, A Woman Being In Asia was the first documentary in the history of Korean cinema to open in theaters and was the first of a trilogy that includes Murmuring 2 and Respiration (Sum kyeol). Afterward, she made two commercial films, Ardor (Milae) (2000) and Flying Boys (Ballegyoseupso) (2004).","torrent":{"xt":"urn:btih:a02a3a7a2a48085cde395b7f8139073c20da7ab1","amp;dn":"The+Murmuring+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a02a3a7a2a48085cde395b7f8139073c20da7ab1","infoHashBuffer":{"type":"Buffer","data":[160,42,58,122,42,72,8,92,222,57,91,127,129,57,7,60,32,218,122,177]},"announce":[],"urlList":[]}}