{"title":"(Blues) Blind Boy Fuller (1935-38) [4 CDs Boxset]","uid":6036735,"size":725630282,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a086f38fa4892dd270882d66c08981bd3ecfcaa1&amp;dn=%28Blues%29+Blind+Boy+Fuller+%281935-38%29+%5B4+CDs+Boxset%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"nightissuchproximity","files":-1,"time":1292254191,"description":"Blind Boy Fuller - 1935-1938 Remastered \nStyles: Prewar Country Blues, Piedmont Blues, East Coast Blues\nReleased: 2004\nLabel: Jsp Records\n\n\nFollowing Blind Blake, Blind Boy Fuller is probably the best known of the so-called Piedmont blues guitarists, a loose group of players from the Appalachian foothills of North Carolina, South Carolina, and upper Georgia who specialized in a ... Full Descriptionflashy two- and three-finger picking style. Fuller was hardly in Blake's league, but his simple, crisp playing and easy singing style made him immensely popular, and he sold thousands of records for ARC (and a handful for Decca) until his death in 1941. This four-disc set from Britain's JSP Records collects everything Fuller did, 100 tracks in all, recorded in just a three-year span between 1935 and 1938, and features Fuller solo and with accompanists like guitarists Gary Davis (Fuller's guitar teacher, who may have been the greatest Piedmont picker of them all, but he steadfastly refused to do secular material) and Floyd Council, washboardist Bull City Red, and harmonica players Sonny Terry and Charlie Austin. Fuller worked off of a couple of well-used templates, generally fairly generic tunes with floating blues verses like &quot;Tom Cat Blues,&quot; &quot;Bulldog Blues,&quot; and &quot;Weeping Willow,&quot; along with good-time rag pieces like &quot;Rag, Mama, Rag&quot; and &quot;Piccolo Rag&quot; (piccolo was seaboard slang for a jukebox), and hybrids between the two, like his signature piece, &quot;Truckin' My Blues Away&quot; (which is represented here in three versions, along with several variations on the theme under different titles). Truthfully, this is probably way more Blind Boy Fuller than most people will need, and a single-disc comp will work for most folks, but for serious collectors, having everything in one set may be just the ticket. \n\n\nPersonnel:\nBlind Boy Fuller (vocals, guitar)\nFloyd &quot;Dipper Boy&quot; Council (guitar)\nRev. Gary Davis (guitar)\nCharlie Austin (harmonica)\nSonny Terry (harmonica)\nGeorge &quot;Bull City Red&quot; Washington (washboard).\n\nRemastered 1935-1938 ","torrent":{"xt":"urn:btih:a086f38fa4892dd270882d66c08981bd3ecfcaa1","amp;dn":"%28Blues%29+Blind+Boy+Fuller+%281935-38%29+%5B4+CDs+Boxset%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a086f38fa4892dd270882d66c08981bd3ecfcaa1","infoHashBuffer":{"type":"Buffer","data":[160,134,243,143,164,137,45,210,112,136,45,102,192,137,129,189,62,207,202,161]},"announce":[],"urlList":[]}}