{"title":"Cher Lloyd Sticks &amp; Stones 2011","uid":6803966,"size":75948527,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0b370cdd904fb1c837277c7b602a0fd457d3814&amp;dn=Cher+Lloyd+Sticks+%26amp%3B+Stones+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"speedthunder","files":11,"time":1320787969,"description":"[img]http://www3.hmv.co.uk/hmv/Large_Images/HMV/88697861792.JPG[/img]\n\nForget Jedward, Chico, Wagner, or the several other novelty acts that The X Factor has foisted upon unsuspecting viewers across the years, fourth-place finalist Cher Lloyd appeared to polarize audiences like no one else in the show's short history. Where some saw a confident demeanor, others saw a brattish attitude; where some viewed her as a voice of the streets, others believed she encapsulated everything that was wrong about today's youth; and where some marveled at her rap/singing versatility, others argued she was a jack of all trades but a master of none. It was always unlikely, therefore, that her debut album, Sticks + Stones, was going to be a shy and retiring MOR affair designed to appeal to the masses ÃƒÂ  la series winner Matt Cardle. However, there are times throughout its ten tracks when Lloyd does appear to be testing the patience of even her most ardent fans, none more so than on &quot;Swagger Jagger,&quot; which may have hit the number one spot (albeit in a slow sales week) but is still a contrived mess, chaotically shifting from sub-Nicki Minaj hip-hop to nursery rhyme pop (its chorus samples &quot;Oh My Darling Clementine&quot;) to Swedish House Mafia-esque trance, while its social media-baiting lyrics suggest her &quot;haterz&quot; are just jealous, completely discounting the fact that perhaps she just might not be everyone's cup of tea. Elsewhere, &quot;Playa Boi&quot; is an obnoxious slice of industrial R&amp;B that should hang its head in shame for destroying the legacy of Neneh Cherry's &quot;Buffalo Stance&quot; (&quot;He got a lean in the gangsta stance/He needs to rock the sickest brands&quot;), while &quot;Dub on the Track,&quot; a collaboration with grime artists Mic Righteous, Dot Rotten, and Ghetts, is a rather unconvincing attempt to prove her street credentials, complete with the now ubiquitous gigantic dirty wobble bass drops. However, when Lloyd stops trying so hard, she's actually a pretty compelling pop star. &quot;Want You Back&quot; and &quot;End Up Here&quot; are both infectious examples of cutesy pure pop that recall Britney before she lost her innocence; &quot;Beautiful People,&quot; a duet with U.S. teen drama staples Carolina Liar, is a sweet Ryan Tedder-style ballad; and the closest the album gets to showcasing the impressive vocals she displayed on her famous &quot;Stay&quot; X Factor performance; while &quot;With Ur Love&quot; is a charming M.I.A.-inspired ditty that fuses a lolloping childlike bassline with bouncy beats and some surprisingly sugary-sweet melodies, although Mike Posner's guest rap is the pure definition of &quot;phoned-in.&quot; At times, Sticks + Stones sounds like such a calculated effort to copy everything that's hot in 2011 that it's likely to feel utterly irrelevant by the time the clock strikes 12 on New Year's Eve. But it's by no means the car crash its lead single suggested, and if Lloyd can tone down the whole &quot;in yer face&quot; schtick, she might begin to win over some of those &quot;haterz&quot; who apparently can't stop &quot;clicking, writing, or tweeting&quot; about her. Ã‚Â¯ Jon O'Brien\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/img]\n\n    *   1. Grow Up-Feat. Busta Rhymes\n    * 2. Want U Back\n    * 3. With Ur Love-Feat. Mike Posner\n    * 4. Swagger Jagger\n    * 5. Beautiful People-Feat. Caroline Liar\n    * 6. Playa Boi\n    * 7. Superhero\n    * 8. Over The Moon\n    * 9. Dub On The Track-Feat. Mic Righteous, Dot Rotten, Ghetts\n    * 10. End Up Here\n\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/img]\n\n[img]http://www.pix2links.com/images/14826000806886868172.gif[/img] \n","torrent":{"xt":"urn:btih:a0b370cdd904fb1c837277c7b602a0fd457d3814","amp;dn":"Cher+Lloyd+Sticks+%26amp%3B+Stones+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0b370cdd904fb1c837277c7b602a0fd457d3814","infoHashBuffer":{"type":"Buffer","data":[160,179,112,205,217,4,251,28,131,114,119,199,182,2,160,253,69,125,56,20]},"announce":[],"urlList":[]}}