{"title":"Viper GTS- Complete AVI","uid":4698370,"size":662665216,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a0dd4f0f2dcded74a4591c12e20a5192b33cf13b&amp;dn=Viper+GTS-+Complete+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cristina0709","files":3,"time":1233635552,"description":"3 Episodes\n\nThe plot of the series centers around three succubi, Carrera, Mercedes and Rati, who are summoned to Earth to capture souls, which are then processed into brilliant gems.\n\nAs the story begins, a nerdy boy named Ogawa uses an ancient text in order to summon a devil to gain revenge against those who have mistreated him. When the devil turns out to be Carrera, however, he completely forgets the reason why he summoned her and instead has sex with her. He is unprepared for her hyperactive libido, though, and by the time morning comes he is too exhausted for the succubus to take his soul. After this, the upper demons punish Carrera for failing to get Ogawa's soul. This leads to five days of imprisonment in which Mercedes and Rati satisfy themselves with Carrera.\n\nMeanwhile, a group of angels have noticed a number of missing souls on Earth. Concerned that the laws of reincarnation are being violated, the angels concoct a plan to capture and &quot;purify&quot; the succubi who are stealing the souls.\n\nMeanwhile Ogawa misses Carrera and attempts to summon her, instead Mercedes answers the summons and Ogawa is very upset. Mercedes is also angry that Ogawa wants Carrera over herself. Ogawa takes out his frustrations by forcing Mercedes to have sex with him and she then returns to hell angry and embarrassed. Ogawa tries to summon Carrera again and succeeds. The angels, however, are prepared and manage to capture Carrera after Ogawa summons her. Ogawa then summons Rati, who flies off to heaven to rescue Carrera but is captured herself. Ogawa uses the summons a fourth time and gets Alphina, Ogawa begs Alphina to let him help rescue Carrera along with Mercedes. The climax is a battle in heaven between Carrera and Rati and their captors and Alphina, Ogawa, and Mercedes and the warrior angels. Later, we find out that the three succubi have moved in with Ogawa and they will have multitude of sex. Alpina's fate is unknown.\n\nIt has been often stated to be a perverse version of Ah! My Goddess, as certain concepts are held in the same light.","torrent":{"xt":"urn:btih:a0dd4f0f2dcded74a4591c12e20a5192b33cf13b","amp;dn":"Viper+GTS-+Complete+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0dd4f0f2dcded74a4591c12e20a5192b33cf13b","infoHashBuffer":{"type":"Buffer","data":[160,221,79,15,45,205,237,116,164,89,28,18,226,10,81,146,179,60,241,59]},"announce":[],"urlList":[]}}