{"title":"Pocketful of Miracles (1961) - Capra","uid":4678396,"size":1466622653,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1e55a4eb3dceb0d5057898514770d8cba4434d2&amp;dn=Pocketful+of+Miracles+%281961%29+-+Capra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mfccorrea","files":5,"time":1232982346,"description":"Director Frank Capra's last feature film, Pocketful of Miracles is a Technicolor remake of his 1933 film Lady for a Day. A barely recognizable Bette Davis plays Apple Annie, the besotted, unkempt, rag-clad street vendor who controls the activities of all the beggars on Broadway. Apple Annie is the pet of Dave the Dude (Glenn Ford), a tough but basically kind-hearted gangster who believes that Annie's apples bring him luck. One morning, Annie fails to show up at her usual corner. That's because she is sitting disconsolate in her squalid shack, contemplating suicide. The reason: Annie has received a letter from her daughter Louise (Ann-Margret, in her screen debut). Annie has been supporting Louise's high-priced European education, leading the girl to believe that she, Annie, is a high-society dowager. Now Louise is returning home with her wealthy fiance Carlos Romero (Peter Mann) in tow, and it looks as though Annie's cover will be blown to bits. Partly out of sympathy, but mostly because of his superstitious belief in the power of Annie's apples, Dave the Dude arranges with his Broadway cohorts to &quot;doll up&quot; Annie so that she can pass as a woman of means, then stage-manages a huge, expensive reception for Louise and her beau. The complications that ensued in the original 1933 version of Lady for a Day exercise their prerogative once more, with a few added plot twists to pad out Glenn Ford's screen time. Cutting through the sentimental goo like a machete is Peter Falk, who is hilarious as Dave the Dude's sarcastic bodyguard. Evidently, Falk was one of the few actors on the set of Pocketful of Miracles with which Capra remained sympatico throughout shooting. In his autobiography (a not altogether reliable tome), Capra insisted that Pocketful of Miracles was ruined by Glenn Ford's autocratic and self-serving on-set behavior, and by Ford's demand that his current lady friend Hope Lange be (mis)cast as brash nightclub chirp Queenie Martin. As usual, Capra was not telling the whole story: at 63, he was beginning to lose his grip on his movie-making skills, allowing every scene to run well past its value and concentrating on cute isolated &quot;bits&quot; rather than the story at hand. Way too long at 136 minutes (Lady for a Day ran but 90), Pocketful of Miracles still has a lot going for it, especially the glowing performance of Bette Davis and the basic, foolproof Damon Runyon story on which it is based. While it disappointed at the box office, Miracles has since its release become a Christmastime TV perennial, seldom failing to draw big ratings numbers.\n\n   General\n      Complete name : Pocketful Of Miracles.avi\n      Format : AVI\n      Format/Info : Audio Video Interleave\n      Format/Family : RIFF\n      File size : 1.37 GiB\n      PlayTime : 2h 11mn\n      Bit rate : 1484 Kbps\n      StreamSize : 12.1 MiB\n      Movie name : fenixclub.com\n      Writing application : VirtualDubMod 1.5.10.2 (build 2540/release)\n      Writing library : VirtualDubMod build 2540/release\n   Video #0\n      Codec : XviD\n      Codec/Family : MPEG-4\n      Codec/Info : XviD project\n      Codec profile : Unknown\n      Codec settings/PacketBitStream : No\n      Codec settings/BVOP : No\n      Codec settings/QPel : No\n      Codec settings/GMC : 0\n      Codec settings/Matrix : Default\n      PlayTime : 2h 11mn\n      Bit rate : 1319 Kbps\n      Width : 640 pixels\n      Height : 256 pixels\n      Display Aspect ratio : 2.500\n      Frame rate : 25.000 fps\n      Resolution : 8 bits\n      Chroma : 4:2:0\n      Interlacement : Progressive\n      Bits/(Pixel*Frame) : 0.320\n      StreamSize : 1.21 GiB\n   Audio #1\n      Codec : MPEG-1 Audio layer 3\n      Codec profile : Joint stereo\n      PlayTime : 2h 11mn\n      Bit rate : 158 Kbps\n      Bit rate mode : CBR\n      Channel(s) : 2 channels\n      Sampling rate : 48 KHz\n      Resolution : 16 bits\n      StreamSize : 149 MiB\n      Writing library : LAME3.98 \n      Encoding settings : CBR\n\nIMDB: tt0055312\n\nEnglish audio, English, French, Spanish and Portuguese subtitles","torrent":{"xt":"urn:btih:a1e55a4eb3dceb0d5057898514770d8cba4434d2","amp;dn":"Pocketful+of+Miracles+%281961%29+-+Capra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e55a4eb3dceb0d5057898514770d8cba4434d2","infoHashBuffer":{"type":"Buffer","data":[161,229,90,78,179,220,235,13,80,87,137,133,20,119,13,140,186,68,52,210]},"announce":[],"urlList":[]}}