{"title":"Sex,  Priests,  and Secredes: The Catholic Church's 2,000 Year","uid":6805243,"size":18731342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1f8daa38beaef1650da6047a53c60f6c329d316&amp;dn=+Sex%2C++Priests%2C++and+Secredes%3A+The+Catholic+Church%5C%27s+2%2C000+Year&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1320839939,"description":"Sex, Priests, and Secret Codes: The Catholic Church's 2,000 Year Paper Trail of Sexual Abuse .\n\n\nSexual abuse of minors and vulnerable adults by Catholic clergy burst onto the American scene in 1984. Revelations about such abuse since then have confirmed that this tragedy is not limited to the U.S. Catholic Church, nor is it a new phenomenon that grew out of so-called secularizing trends of the late twentieth century. The Doyle-Sipe-Wall report clearly demonstrates a deep-seated problem that spans the Church's history. This collection of documents from official and unofficial sources begins its survey in 60 CE and concludes with the contemporary scandal. It reveals an institution that has tried to come to grips with this devastating internal problem from its earliest years. At times circumspect and at other times open and direct, Church leaders tried a variety of means to rein in the various violations of clerical celibacy. The sexual abuse crisis is not isolated from the questions of the celibate practice of all Catholic clergy and the moral questions that involve marriage and all human sexual behaviors. These are the main, yet unspoken, reasons why sexual abuse has been such an inflammatory and dangerous issue for the hierarchy. The Church abuse scandal of the contemporary era, rather than seen as a new challenge, is actually the catalyst for a complex process that is forcing the official Church to redefine its ideology of sexuality, its responsibility to its members and its role in society. The three distinguished authors have served as experts and consultants in over 1,000 cases of sexual abuse of minors by Catholic clergy, and have collectively spent over 70 years of official service within the church.\n\n\n\n \t\nAuthor(s):\tThomas P. Doyle, A.W. Richard Sipe, Patrick J. Wall\nPublisher:\tBonus Books\nDate:\t        2006-03-29\nPages:\t        388\nFormat:\t        PDF\nISBN10: \t1566252652\nISBN13:\t        9781566252652","torrent":{"xt":"urn:btih:a1f8daa38beaef1650da6047a53c60f6c329d316","amp;dn":"+Sex%2C++Priests%2C++and+Secredes%3A+The+Catholic+Church%5C%27s+2%2C000+Year","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f8daa38beaef1650da6047a53c60f6c329d316","infoHashBuffer":{"type":"Buffer","data":[161,248,218,163,139,234,239,22,80,218,96,71,165,60,96,246,195,41,211,22]},"announce":[],"urlList":[]}}