{"title":"What People Wore - A Visual History of Dress From Ancient Times","uid":14655229,"size":80753313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2669110e4b2983c7c39c11367632d75210c69dd&amp;dn=What+People+Wore+-+A+Visual+History+of+Dress+From+Ancient+Times&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1463692796,"description":"What People Wore - A Visual History of Dress From Ancient Times to Twentieth-Century America\r\nBonanza Books | 1952 | English | 296 pages | PDF | 77 MB\r\n\r\nSpanning nearly 5,000 years of clothing styles, this splendid sourcebook presents a fascinating panorama of wearing apparel, beginning with the ancient Egyptians and continuing through the early decades of the twentieth century. Over 1,800 drawings  meticulously researched and accurately rendered by the author  depict garments ranging from diaphanous gowns of Egyptian royalty, ornate robes of Byzantine dignitaries, and elegant dresses worn by eighteenth-century Parisians, to picturesque outfits of American frontiersmen and the revolutionary 1930s wardrobe of the American flapper. Here also are informal portraits of Byzantine commoners and religious figures, Elizabethans in lace collars and ruffs, upper-class Venetians, English dandies, and French gentlemen of the mid-eighteenth century as well as detailed illustrations of nineteenth-century New York farmers, western fur trappers, cowboys, mountain men, and lumberjacks, Klondike prospectors, Mississippi rivermen, and many more. A brief historical survey precedes the chronologically grouped illustrations of each period, and an overall list supplies the source for each drawing. A comprehensive reference for artists, designers, and social historians, this invaluable treasury will also intrigue anyone interested in the evolution of wearing apparel","torrent":{"xt":"urn:btih:a2669110e4b2983c7c39c11367632d75210c69dd","amp;dn":"What+People+Wore+-+A+Visual+History+of+Dress+From+Ancient+Times","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2669110e4b2983c7c39c11367632d75210c69dd","infoHashBuffer":{"type":"Buffer","data":[162,102,145,16,228,178,152,60,124,57,193,19,103,99,45,117,33,12,105,221]},"announce":[],"urlList":[]}}