{"title":"Deus  X  Machina  -  X      mp3   320kbps      2014","uid":10849020,"size":132060516,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2f10b57a2c5346ab111eaff474395a3268616ae&amp;dn=Deus++X++Machina++-++X++++++mp3+++320kbps++++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":10,"time":1408799098,"description":"             Deus ex machina (Latin: from Latin, meaning &quot;god from the machine&quot;Deus Ex Machina (band) is an Italian progressive rock group. Members include Claudio Trotta (drums), Alessandro Porreca (bass) Maurino Collina (guitar), Alessandro Bonetti (violin) Fabrizio Puglisi (keyboards) and Alberto Piras (vocals).Deus Ex Machina is a Singaporean death metal/thrash metal band, and is one of the few extreme metal acts from Southeast Asia that has gained a following in Europe and the United States. They represent a rarity in the Southeast Asian Metal scenes in favouring a more melodic musical approach and concept-based poetic lyrics in contrast to the more aggressive and brutal stylings of the region. They are also a highly internationalized band, with a background of having band members from different parts of the world.Deus Ex Machina is a popular Greek hardcore punk band from Athens formed in 1989 by Dimitris Spyropoulos and Dimitris Manthos, with Spyropoulos and Yiannis Venardis (the group's drummer) having already been early Greek Punk scene's 'veterans' (they were members of Adiexodo).\n\nThe band's lyrics are often political having references to subjects such as the War on Iraq and the Mexican Zapatista Army of National Liberation movement.`And there you have it you kow what is what and who is who but do the trolls? Which band will be dmca hit                               Anyway It metal so get it this amusement brought to by .......Make it up as you go,,,,,,,,,,","torrent":{"xt":"urn:btih:a2f10b57a2c5346ab111eaff474395a3268616ae","amp;dn":"Deus++X++Machina++-++X++++++mp3+++320kbps++++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2f10b57a2c5346ab111eaff474395a3268616ae","infoHashBuffer":{"type":"Buffer","data":[162,241,11,87,162,197,52,106,177,17,234,255,71,67,149,163,38,134,22,174]},"announce":[],"urlList":[]}}