{"title":"Harbinson-Projekt Saucer 1-Inception(nazi flying saucers)","uid":4480766,"size":1853932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a45dd51750f8e7aa1c77854c5c2fd2d52805fc8a&amp;dn=Harbinson-Projekt+Saucer+1-Inception%28nazi+flying+saucers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1225558901,"description":"This is W.A. Harbinson&amp;#039;s mindblowing SF novel Projekt Saucer Book 1 - Inception (1994) which begins the epic SF series about American-Nazi secret flying saucer project and the gigantic effect this most forbidden science has on this world. The core idea of Projekt Saucer (spanning 5 books in total) revolves around an Earth-based source for flying saucers or UFOs. Rather than blaming them on aliens, the flying saucers are created by an awesome conspiracy, created by a doctor named Wilson - a fictional character based on the legendary &amp;#039;Wilson&amp;#039; of the UFO scare of 1895-96. Based on previously concealed, carefully documented evidence, Harbinson aims to expose cover-ups, conspiracies and terrible truths that have been hidden far too long. In Inception, Wilson takes his intrepid ideas to Nazi Germany where he hopes to find more interest for his bizzare flying machines which noone is America can understand. There he meets Himmler, a man obsessed with the crazy idea about a superman race which he intends to create on Antarctica after the war ends. With thousands of slave labourers at his disposal, Wilson helps the Nazis to create the famous Foo Fighters but carefully conceals plans for a far more advanced craft. With OSS behind his tail he slowly develops a sneaky plan to outmaneuver the insane Himmler with all his brutal generals included and flees to the frozen continent to continue his completely unethical scientific research. Although it never made into a movie, many readers picked up the book by chance and soon found themselves captivated from beginning to end as it uses a great blend of fact and fiction to give an intriguing hypothesis of what might have actually happened in history. Linking all the major UFO sightings over the past 100 years into a believable tale of conspiracy and deceit with the storyline travelling the globe - from Nazi Germany to the deserts of Arizona and New Mexico and beyond - Inception is a terrifying story based on documented historical fact that reveals what is really known about UFOs while it holds readers spellbound with a breathtaking thriller about organized evil, global conspiracy - and the secret future of our world. 475 pages. A must read for everyone. More info on the whole series: http://www.inkdigital.org/harbinson/project.htm\n","torrent":{"xt":"urn:btih:a45dd51750f8e7aa1c77854c5c2fd2d52805fc8a","amp;dn":"Harbinson-Projekt+Saucer+1-Inception%28nazi+flying+saucers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45dd51750f8e7aa1c77854c5c2fd2d52805fc8a","infoHashBuffer":{"type":"Buffer","data":[164,93,213,23,80,248,231,170,28,119,133,76,92,47,210,213,40,5,252,138]},"announce":[],"urlList":[]}}