{"title":"The Write-Brain Workbook : 366 Exercises to Liberate Your Writin","uid":6730492,"size":152962824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4a08f4024a012a323dc353c6b488d0ba9001988&amp;dn=The+Write-Brain+Workbook+%3A+366+Exercises+to+Liberate+Your+Writin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":5,"time":1318118977,"description":" &lt;a href=&quot;http://ec2.images-amazon.com/images/I/51yNnjD8ZaL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ec2.images-amazon.com/images/I/51yNnjD8ZaL._SS500_.jpg&lt;/a&gt;\n\n\nSpike Diet: A Lifestyle Guide to Indulgent Eating and Burning Fat\n\n\nBrio Press\nRussell Branjord\n2009 \nEnglish\nISBN: 0615328768 \n146 pages \nPDF \n7.99 MB\n\n\nAfter years of weighing over 300 pounds, Russell Branjord concluded that, despite his best efforts, eating less and exercising more was not the answer to his weight problem. Now a fitness instructor, he has created the Spike Diet to allow dieters to enjoy the food they love while still eating healthy. By indulging in an ice cream treat or a slice of pizza for one day (the Spike Day) out of the week, dieters learn to reward themselves with the foods they want most, instead of seeing them as everyday fare. Branjord includes recipes that will make eating well taste like every day is a Spike Day.\n\n\n[\n\n &lt;a href=&quot;\nhttp://www.secret-war.com/images/book.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.secret-war.com/images/book.png&lt;/a&gt;\n\n\n\nThe Secret War Between Downloading and Uploading\n\n\nThe M IT Pr ess \nPETER LUNENFELD\n2011 \nENGLISH\nISBN: 0262015471 \n239 pages \nPDF \n1.18 MB\n\n\nAs we hurtle into the twenty-first century, will we be passive downloaders of content or active uploaders of meaning?\n\nThe computer, writes Peter Lunenfeld, is the twenty-first century's culture machine. It is a dream device, serving as the mode of production, the means of distribution, and the site of reception. We haven't quite achieved the flying cars and robot butlers of futurist fantasies, but we do have a machine that can function as a typewriter and a printing press, a paintbrush and a gallery, a piano and a radio, the mail as well as the mail carier. But, warns Lunenfeld, we should temper our celebration with caution; we are engaged in a secret war between downloading and uploading--between passive consumption and active creation--and the outcome will shape our collective futures.In The Secret War Between Downloading and Uploading, Lunenfeld makes his case for using digital technologies to shift us from a consumption to a production model. He describes television as the &quot;the high fructose corn syrup of the imagination&quot; and worries that it can cause &quot;cultural diabetes&quot;; prescribes mindful downloading, meaningful uploading, and &quot;info-triage&quot; as cures; and offers tips for crafting &quot;bespoke futures&quot; in what he terms the era of &quot;Web n.0&quot; (interconnectivity to the nth power). He also offers a stand-alone genealogy of digital visionaries, distilling a history of the culture machine that runs from the Patriarchs (Vannevar Bush's WWII generation) to the Hustlers (Bill Gates and Steve Jobs) to the Searchers (Larry Page and Sergey Brin of Google fame). After half a century of television-conditioned consumption/downloading, Lunenfeld tells us, we now find ourselves with a vast new infrastructure for uploading. We simply need to find the will to make the best of it.\n\n\n[\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51HFT15RHEL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51HFT15RHEL._SS500_.jpg&lt;/a&gt;\n\n\n\nThe Write-Brain Workbook: 366 Exercises to Liberate Your Writing \n\n\nF+W Media \nBonnie Neubauer\nEnglish \n2006\nISBN: 1582973555 \n384 pages \nPDF \n136 MB\n\n\n\nWith The Write-Brain Workbook, writers will never have to face a blank page again. This one-of-a-kind guide provides a full year of writing exercises and games designed to get thoughts brewing and the pen moving across the page. It:\n\n*Provides 366 10-minute exercises to build momentum and turn off the left side of the brain\n*Helps readers generate work by painlessly leading them into new writing every day\n*Stimulates creativity with a stunning 4-color package and easy-to-approach prompts\n\nPeople of all ages and occupations can benefit from this book as they open up to new realms of creativity.\n\n\n","torrent":{"xt":"urn:btih:a4a08f4024a012a323dc353c6b488d0ba9001988","amp;dn":"The+Write-Brain+Workbook+%3A+366+Exercises+to+Liberate+Your+Writin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a08f4024a012a323dc353c6b488d0ba9001988","infoHashBuffer":{"type":"Buffer","data":[164,160,143,64,36,160,18,163,35,220,53,60,107,72,141,11,169,0,25,136]},"announce":[],"urlList":[]}}