{"title":"Double Load ( 1993 )","uid":15062783,"size":600770260,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a57c9657ea7ca301bd778f720555148c0f42418a&amp;dn=Double+Load+%28+1993+%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":2,"time":1466773027,"description":"Double Load ( 1993 )\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=8674955479\r\n \nhttp://imagedisco.net/?g=7365621091\r\n\r\n\r\nPlot:\r\n\r\nWith drug smugglers and double penetration in the South American jungle, the action is hotter than ever. Wendy Whoppers joins the erotic excitement to help divert a secret agent determined to catch the criminals. And the scorching scene on the plane will leave you breathless\r\n\r\nSecret agents, criminals, and big ass titties are the formula for this Heatwave classic! Wendy Whoppers joins the erotic excitement to help divert a secret agent from catching criminals. The action gets hotter than ever as everyone gets into the act – the sex act, that is! The ultimate fight?? It’s all over when she goes to wrap her lips or legs around ya!! Then there is only one thing to do submit!!\r\n\r\nRocco Siffredi is probably the first federal drug agent who sounds like a young Vito Corleone. Jessica Foxx. who gets star billing on the tape, is kingpin Tony Tedeschi's smuggler, who buys the drugs from Nick E. and Cal Jammer in South America. Why their car has California plates, I don't know, but Rocco manages to get Jessica to promise to doublecross Tony in return for leniency. Just before Tony skips the country, he gets a final good-bye from busty girlfriend Wendy Whoppers. Jessica's session with Rocco during which Tony has a chance to make his getaway is also one hot time. With Heather Hart also in the cast, this feature should definitely be directed towards your customers who usually go straight to the big boob section","torrent":{"xt":"urn:btih:a57c9657ea7ca301bd778f720555148c0f42418a","amp;dn":"Double+Load+%28+1993+%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a57c9657ea7ca301bd778f720555148c0f42418a","infoHashBuffer":{"type":"Buffer","data":[165,124,150,87,234,124,163,1,189,119,143,114,5,85,20,140,15,66,65,138]},"announce":[],"urlList":[]}}