{"title":"The Godfather Trilogy","uid":11703039,"size":9384412545,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a626fb8ae18cbcbad2f4f78ae12b97706e258848&amp;dn=The+Godfather+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MoofieMan","files":3,"time":1423997305,"description":"This collection is of the three Godfather movies, the classic mobster movies starring some of the best actors of the 20th Century, including Marlon Brando, Al Pacino, Robert DeNiro, Diane Keaton and James Caan. Francis Ford Coppola directed all three episodes, providing solid and continuous direction and development of the plot across the series.\n\nThe story focuses around the Corleone family and the growth of their crime empire in a burgeoning America, their competition with other crime families, the corruption of the system and the violence that encapsulated it all. The trilogy covers an almost 80 year period (from the early 1900's to the 1980's) and is superbly costumed, scripted and acted with extreme detail being paid to all of the time periods it involves.\n\nWith this collection, full credit must go to YIFY for the original encodes. The vision is HD resolution, but typical of YIFY, quite conservative on size. These are the digitally remastered Blu-Ray versions released by Paramount, so the vision is beautiful and clear as a bell.\n\nI have remastered the stereo soundtracks using Audacity so as to compress the vocals up, so all dialogue can be heard clearly, but not detract from the sound effects or music. The soundtracks have been levelled and increased to -2dB to ensure good, strong playback on all systems. Additionally, I sourced out all of the subtitles (English) and edited them so they only cover the Sicilian/Italian speaking parts.\n\nFinally, I remuxed the Video, Audio and Subtitle components using MKV Merge (Nouages) which seems to produce error-free MKV files. I have watched these versions numerous times and all 3 films have played back flawlessly, with clear audio and well synced subs. They have passed my tests, so I hope you download and enjoy The Godfather Trilogy - Remastered!\n\nCheers,\nMoofieMan","torrent":{"xt":"urn:btih:a626fb8ae18cbcbad2f4f78ae12b97706e258848","amp;dn":"The+Godfather+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a626fb8ae18cbcbad2f4f78ae12b97706e258848","infoHashBuffer":{"type":"Buffer","data":[166,38,251,138,225,140,188,186,210,244,247,138,225,43,151,112,110,37,136,72]},"announce":[],"urlList":[]}}