{"title":"Scorpions - We'll Burn the Sky  [Musikladen 1977].VOB","uid":6207485,"size":133419008,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a665477fcc3d12c1e50aee9872aeb220517c2e56&amp;dn=Scorpions+-+We%5C%27ll+Burn+the+Sky++%5BMusikladen+1977%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1298862814,"description":"Scorpions - We'll Burn the Sky  [Musikladen 1977].VOB\n\n\nVery HQ rare &quot;Musikladen&quot; tv show promo performance music video. &quot;Der Musikladen&quot; (German: the music shop) was a West German music television program that ran from December 13, 1972 to November 29, 1984. The show continued the 1960s Beat-Club under a new name, and in turn was replaced by Extratour.\n\nA normal episode of Musikladen usually featured several live performances by guest musicians, and ran around 45 minutes. Some episodes were longer, and a few were shorter. In the 1980s, music videos were shown along with live performances.\n\n&quot;We'll Burn the Sky&quot; is a song from Taken By Force, the fifth studio album by German heavy metal band Scorpions, released in 1978. This was the final Scorpions album to feature guitarist Ulrich Jon Roth. Roth left the band in 1978 following the end of the album's tour, and was eventually replaced by Matthias Jabs.\n\nThe album cover photography was taken by Michael von Gimbut, returning for his third Scorpions album cover commission. Like their previous two albums, Taken By Force caused controversy with its cover art which again resulted in the artwork being replaced in most markets with an alternative cover using photographs of the band members. The band's former lead guitarist Uli Jon Roth defended the original artwork in a 2008 interview, stating: \n\n&quot;I think the original idea was children playing with guns at a military cemetary in France and some people found that offensive. I don't think it's offensive because I think it was actually a quite a good image because it puts war totally into perspective, very often it is young people, eighteen, ninenteen, going to war that don't fully understand life. When you're fifty you don't fully understand life, but these guys then have to shoot other people simply because someone tells them to do it for their country. Politicians are sometimes also children with guns, in all periods of time a lot of politicians are far too trigger happy and war too easily becomes an &quot;easy solution&quot;, whereas for me it should never a solution, there should be no war in the first place. Maybe every once in a while a country may need to defend itself, I understand that, but in general if you consider that there are over a hundred wars raging in the present day on this planet alone then it's just sheer lunacy and always the tool of the Dark Side. Usually bad things come from war, very few good things, but sometimes good things come from bad things, that's true, nothing's that black and white. It's always the wrong solution to kill people.&quot;\n(video has a semi-transparent white &quot;festival&quot; logo at the top right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Taken_by_Force&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Taken_by_Force&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PAENMAAdb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAENMAAdb&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 8192kbps\n   Audio: MPEG Layer 2 Audio 48000Hz stereo 256kbps\n   Duration: 00:03:19\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011!\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:a665477fcc3d12c1e50aee9872aeb220517c2e56","amp;dn":"Scorpions+-+We%5C%27ll+Burn+the+Sky++%5BMusikladen+1977%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a665477fcc3d12c1e50aee9872aeb220517c2e56","infoHashBuffer":{"type":"Buffer","data":[166,101,71,127,204,61,18,193,229,10,238,152,114,174,178,32,81,124,46,86]},"announce":[],"urlList":[]}}