{"title":"(Blues) Big Pete Pearson - The Screamer","uid":6650876,"size":105478194,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a66855172716deff3f419935b6c2a202e2e59a43&amp;dn=%28Blues%29+Big+Pete+Pearson+-+The+Screamer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1315143012,"description":"mp3   320kbps\n\n\nLabel: Modesto Blues\nStyles: Electric Chicago blues\nArt: Front\n\n\nAlthough he has been singing the blues, by his count, for 60 years, Big Pete Pearson did not start making records under his own name until the year he became eligible for Medicare.\n\nSince then, however, he seems to have been making up for lost time. And, when you're 72, why wait? On The Screamer, he is accompanied by his regular blues band, led by bassist and songwriter Terry Davis. The band churns out familiar blues tunes, with a full horn section blasting away and Joey DeFrancesco sitting in on Hammond B-3 organ on some tracks. But even when Pearson is only being accompanied by an acoustic guitar, as he is on &quot;Trustworthy Woman,&quot; he proves to be a terrific traditional blues singer. &quot;When it comes to the blues, I know just what to do,&quot; he proclaims in &quot;Come and Get It,&quot; and he demonstrates that throughout. For the most part, these songs could have been performed any time in the post-World War II era, one exception being &quot;Blues Bailout,&quot; a timely reference to the economic troubles of the late 2000s. And some of them may not be as current as they seem. (Although Pearson claims the writing credit for the track &quot;Pledging My Love,&quot; it's really the 1955 Johnny Ace hit, written by Pearson's old employer, Don Robey, and Ferdinand Washington.) But the blues is timeless, and Pearson seems to be, too. ","torrent":{"xt":"urn:btih:a66855172716deff3f419935b6c2a202e2e59a43","amp;dn":"%28Blues%29+Big+Pete+Pearson+-+The+Screamer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66855172716deff3f419935b6c2a202e2e59a43","infoHashBuffer":{"type":"Buffer","data":[166,104,85,23,39,22,222,255,63,65,153,53,182,194,162,2,226,229,154,67]},"announce":[],"urlList":[]}}