{"title":"Photon-based Nanoscience and Nanobiotechnology","uid":15513598,"size":7548080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab223746be923196c3291ddac01b4293a13d3014&amp;dn=Photon-based+Nanoscience+and+Nanobiotechnology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1470680362,"description":"Photon-based Nanoscience and Nanobiotechnology - Jan J. Dubowski, Stoyan Tanev (Springer, 2006).pdf\r\n\r\nLight has always played a significant role in the synthesis of materials and formation of small-scale solid structures. The invention of holographic and phase mask projection has enabled engineers to fabricate devices with characteristic features much smaller than the wavelength of the light used for processing. A further reduction of device dimensions has been achieved by implementing the processes that rely strongly on the non-linear effects of light-matter interaction. The intention of this book was to provide the Reader, primarily graduate students and young researchers in materials engineering, bio(chem)physics, medical physics and biophysics, with a set of articles reviewing state-of-the art research and recent advancements in the field of photon-matter interaction for micro/nanomaterials synthesis and manipulation of properties of biological and inorganic materials at the atomic level. Photon-based nanoscience and related technologies have created exciting opportunities for the fabrication and characterization of nano(bio)material devices and systems, and it is expected to significantly contribute to the development of Nanobiophotonics and Nanomedicine","torrent":{"xt":"urn:btih:ab223746be923196c3291ddac01b4293a13d3014","amp;dn":"Photon-based+Nanoscience+and+Nanobiotechnology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab223746be923196c3291ddac01b4293a13d3014","infoHashBuffer":{"type":"Buffer","data":[171,34,55,70,190,146,49,150,195,41,29,218,192,27,66,147,161,61,48,20]},"announce":[],"urlList":[]}}