{"title":"24/7 in Love","uid":8215039,"size":1566138368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ab4be530ca8188fd0d8326aaed43030d2ceb969a&amp;dn=24%2F7+in+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akoexmo","files":1,"time":1362325825,"description":"&quot;What do you want to do before the world ends?&quot; This is Jane's (Kathryn Bernardo) idea for the video project she wants to submit to win a VIP ticket to watch her ultimate crush Billy's (Daniel Padilla) concert.\n\nHowever, her family decides to set their family reunion at the date of the concert. Despite the conflict, Jane pursues to go around the city to shoot and gathered different answers to her question which ultimately helps her learn about what love really is and what really matters at the end of the world. She interviews a 40-year old virgin named Virgie (Pokwang) who meets a gigolo named Charles (Sam Milby); a hopeless romantic secretary, Barbara (Maja Salvador) who is helping her boss, Ken (Diether Ocampo) with &quot;personal issues&quot;; Verna (Angelica Panganiban) who falls in love with a waiter named Elvis (John Lloyd Cruz) in Vietnam; Belle (Bea Alonzo) who is in love with her gay best-friend, Butch (Zanjoe Marudo), an active-executive; Jomar (Zaijan Jaranilla) who is trying to court Ayie (Xyriel Manabat) with the help of a 35 year old mentally-challenged man named Pipoy (Piolo Pascual); Patty (Kim Chiu) who traces her first love, Alvin (Gerald Anderson) to become a model for her company.\n\nMinutes before the deadline of submission, Jane is still undecided. Will she be able to make it to the once-in-a-lifetime concert, or to the long-awaited family reunion? If the world should end, what will Jane do? ","torrent":{"xt":"urn:btih:ab4be530ca8188fd0d8326aaed43030d2ceb969a","amp;dn":"24%2F7+in+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab4be530ca8188fd0d8326aaed43030d2ceb969a","infoHashBuffer":{"type":"Buffer","data":[171,75,229,48,202,129,136,253,13,131,38,170,237,67,3,13,44,235,150,154]},"announce":[],"urlList":[]}}