{"title":"A History of the English Speaking Peoples - Volume 3","uid":6495229,"size":274622309,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:abb124f542b7f9291d6ea4d7b720bef32326dc7e&amp;dn=A+History+of+the+English+Speaking+Peoples+-+Volume+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":11,"time":1309040227,"description":"Winston Churchill - A History of the English-speaking Peoples Vol 3 The Age of Revolution (Unabridged) - Read by Christian Rodska\n\nSource CD\nDuration approx 12:41 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nDuring the period of this volume, from 1688 to 1815, three revolutions profoundly influenced mankind and all occurred within the space of a 100 years and all led to war between the British and the French: the English Revolution of 1688, the American Revolution of 1775 and the French Revolution of 1789. Beneath these political upheavals other revolutions in science and manufacture were laying the foundations of the Industrial Age in which we live today. All this time the expansion of British overseas possessions grew: the New World, India and discoveries by Cook in the Southern Hemisphere. This was the time of Marlborough, Wolfe, Clive, Nelson and Wellington, plus the great statesmen Walpole, Chatham and Pitt. ENGLAND'S ADVANCE TO WORLD POWER William of Orange; Continental War; Spanish Succession; Marlborough: Blenheim and Ramillies; Oudenarde and Malplaquet;Treaty of Utrecht THE FIRST BRITISH EMPIRE House of Hanover; Robert Walpole; Austrian Succession and 'Forty-Five'; American Colonies;1st World War; War of Independence; United States; Indian Empire NAPOLEON Younger Pitt; American Constitution; French Revolution; Trafalgar; Emperor of the French; Peninsular War and Fall of Napoleon; Washington, Adams and Jefferson; War of 1812; Elba and Waterloo\n\n\nThe author\n\nSir Winston Churchill (1874-1965) was prime minister of Great Britain during World War II. Throughout his long and distinguished political career his writing was prolific.\n\n\nThe reader\n\nChristian Rodska (born 5 September 1945 in Northumberland) is a versatile English actor who has appeared in many television and radio series and narrated a number of audiobooks. His role in Follyfoot as Ron Stryker is well-remembered. More recently known for his narration of Ice Road Truckers and &quot; on Discovery Channel, as well as MegaStructures for United Kingdom channel five.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:abb124f542b7f9291d6ea4d7b720bef32326dc7e","amp;dn":"A+History+of+the+English+Speaking+Peoples+-+Volume+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abb124f542b7f9291d6ea4d7b720bef32326dc7e","infoHashBuffer":{"type":"Buffer","data":[171,177,36,245,66,183,249,41,29,110,164,215,183,32,190,243,35,38,220,126]},"announce":[],"urlList":[]}}