{"title":"VSO ConvertXtoDVD V4.0.12.327 + Keys {blaze69}","uid":5784321,"size":18179168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad3e5068296a3e35842afa427e1b23781fb094bd&amp;dn=VSO+ConvertXtoDVD+V4.0.12.327+%2B+Keys+%7Bblaze69%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blaze69","files":-1,"time":1282540832,"description":"\nInstall And Use Any Of The Keys Provided.\n\nIf You Already Have An Older Version Of ConvertxtoDVD Installed And The New Keys Provided Does Not Overwrite Your Old Key. Simply Run &quot;Remove Old Key.Reg&quot; File. Then Input Any Of The New Keys.\n\nHave Fun.\n\n\nEnjoy !!!!!!!!\n\nBrought To You By ........blaze69\n\n######################################\nConvertXtoDVD video converter, burn DVD\n######################################\n\nConvertXtoDVD - top-choice video conversion software - convert and burn any videos such as Avi to DVD, WMV to DVD, MKV to DVD,ogm, mpeg, quicktime mov !\n\nThis award-winning divx to dvd video converter software burn video and audio formats to DVD, video conversion supports avi, divx, wmv, mkv, xvid, vcd, vob, dvd...\n\nAll in one video conversion and burning software.\n\n\nKey Features\n\n* Video formats supported: avi, divx, xvid, mov, mkv, flv , mpeg1, mpeg2, mpeg-, nsv, dvr-ms, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec.\n* Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n* Conversion advisor wizard, control of the conversion speed vs. quality\n* Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n* Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n* Custom and or automatic chapter creation with markers and preview window\n* Advanced file merging possibilities\n* Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more... Select audio output format.\n* Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA, opensubtitles, dvbsub with color and font selection, and supports tags like italic, bold, turn on/off with DVD player remote control\n* Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Broadcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n* Video post processing settings like video resize-pad/cropping and de-interlacing options\n* Multilingual support.\n* Works with 32 and 64bits edition of Windows XP, Vista, 7\n\n\nMinimum requirement:\n\nHardware\n\n* Processor Intel Pentium III / AMD Athlon\n(Intel Pentium 4 / AMD Athlon XP or equivalent recommended)\n* 512 MB RAM with Windows 2000 or XP\n1 GB RAM with Windows Vista\n* Hard disk drive with at least 4.3 Gbytes free\n* DVD Burner\n\nSoftware\n\n* WindowsÃ‚Â® 2000 SP4, Windows XP SP2, Windows Vista, Windows 7\n\n","torrent":{"xt":"urn:btih:ad3e5068296a3e35842afa427e1b23781fb094bd","amp;dn":"VSO+ConvertXtoDVD+V4.0.12.327+%2B+Keys+%7Bblaze69%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad3e5068296a3e35842afa427e1b23781fb094bd","infoHashBuffer":{"type":"Buffer","data":[173,62,80,104,41,106,62,53,132,42,250,66,126,27,35,120,31,176,148,189]},"announce":[],"urlList":[]}}