{"title":"Cold Sweat - Let's Make Love Tonight  (2nafish)","uid":5483010,"size":190449668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:adad75f6ef57978a32a06055600e86f8654ab591&amp;dn=Cold+Sweat+-+Let%5C%27s+Make+Love+Tonight++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1270550956,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nThe Fifth is a hard rock band from Fayetteville, North Carolina. The current members are singer Roy Cathey, guitarist Icky Jim, Bassist Bernie &quot;B-Man&quot; Mangiboyat and drummer Marc Anthony. The Fifth signed to EMG/Universal Records on July 28, 2009, with Monster Energy sponsoring the band.\n\nThe Fifth started in 2001 out of Fayetteville, North Carolina by Roy Cathey who started out in the early 90s with a band called Cold Sweat with former Keel Lead and Rhythm guitarist Marc Ferrari. Roy Cathey co-wrote on &quot;Long Way Down&quot; and &quot;Killing Floor&quot; from Cold Sweat's debut album Break Out. Cold Sweat released &quot;Lets Make Love Tonight&quot; video to MTV  and on that day, Cold Sweat was dropped from MCA records. The breakup of Cold Sweat came when Grunge took over MTV  and radio, just like many other bands of that genre and during that era.\n\nRoy Cathey did not perform with any other band after Cold Sweat until he started The Fifth in 2001. This is Roy Cathey's second time being signed with a Major Record Label.\n\nRoy Cathey is quoted in an interview with The Fayetteville Feed as saying: &quot;you know what the cool thing about all this is? We never set out to be famous, not originally. We were just having fun.&quot; This just shows that these guys are all about making people happy and about giving their fans a great night of music and fun then it is for the money.\n\nThe Fifth play a lot of free shows, giving audiences that otherwise would not be able to see them a night that they will remember and tell others about. Not too many bands do this anymore.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:adad75f6ef57978a32a06055600e86f8654ab591","amp;dn":"Cold+Sweat+-+Let%5C%27s+Make+Love+Tonight++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adad75f6ef57978a32a06055600e86f8654ab591","infoHashBuffer":{"type":"Buffer","data":[173,173,117,246,239,87,151,138,50,160,96,85,96,14,134,248,101,74,181,145]},"announce":[],"urlList":[]}}