{"title":"Barack Obama.2008 (Docu Biografico).(DVDRip.Spanish).","uid":4786688,"size":518602752,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af4ea1edc8595929d4a1aec786e97434ef06e07a&amp;dn=Barack+Obama.2008+%28Docu+Biografico%29.%28DVDRip.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":1,"time":1237575301,"description":"Barack Obama \n\nEn el documental, se conocerÃƒÂ¡ la procedencia del originario de Hawai, que en 2008 fue denominado como la Persona del AÃƒÂ±o, segÃƒÂºn la prestigiosa revista Time por su efecto mayor en las noticias nacionales e internacionales. \nSe revelarÃƒÂ¡ cÃƒÂ³mo iniciÃƒÂ³ su carrera polÃƒÂ­tica, la cual marcarÃƒÂ¡ un hito histÃƒÂ³rico el 20 de enero prÃƒÂ³ximo. AdemÃƒÂ¡s, cÃƒÂ³mo fue que sus raÃƒÂ­ces multirraciales cultivaron su esencia, cÃƒÂ³mo lo ven sus familiares, asÃƒÂ­ como los analistas polÃƒÂ­ticos. \nEl documental sobre Barack Obama se traslada a distintos escenarios que signaron su vida, desde la ancestral Kenia, en Africa, tierra natal de su padre Barack H. Obama, a Honolulu en la isla de Hawai, donde naciÃƒÂ³ el 4 de agosto de 1961. \nTambiÃƒÂ©n llega hasta Chicago, Illinois, estado que lo cobijÃƒÂ³ durante un buen trecho de su carrera polÃƒÂ­tica y al que retribuyÃƒÂ³ como representante del senado estadunidense. \nSe darÃƒÂ¡ cuenta de testimonios claves como los de su esposa Michelle, su cuÃƒÂ±ado Craig Robinson, su hermana Maya Soetoro-Ng, y de su mejor amigo Marty Nesbitt, que dejan en evidencia el lado humano del &quot;Barry&quot; Obama, como le llaman sus seres queridos. \nSe mostrarÃƒÂ¡n asimismo, reflexiones como las del comentarista de la cadena de noticias ABC, Cokie Roberts; el director del medio digital Slate.com, David Plotz; su asesor de medios, David Axelrod; y su compaÃƒÂ±ero del senado Emil Jones. \nEl programa describe cÃƒÂ³mo fue ascendiendo la figura del autor del bestseller &quot;La audacia de la esperanza&quot;, asÃƒÂ­ como su formaciÃƒÂ³n profesional como jurista en materia de derecho civil y constitucional en la prestigiosa escuela de leyes de la Universidad de Harvard. \nLos ÃƒÂºltimos minutos de trabajo estÃƒÂ¡n dedicados a mostrar los detalles de su aguerrida lucha por la presidencia de Estados Unidos, primero como precandidato y carismÃƒÂ¡tico contendor de Hillary Clinton, y luego como el abanderado demÃƒÂ³crata del mensaje: &quot;Si podemos&quot;.\n","torrent":{"xt":"urn:btih:af4ea1edc8595929d4a1aec786e97434ef06e07a","amp;dn":"Barack+Obama.2008+%28Docu+Biografico%29.%28DVDRip.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4ea1edc8595929d4a1aec786e97434ef06e07a","infoHashBuffer":{"type":"Buffer","data":[175,78,161,237,200,89,89,41,212,161,174,199,134,233,116,52,239,6,224,122]},"announce":[],"urlList":[]}}