{"title":"Happy Thank You More Please [DVDScreener][Spanish].avi","uid":6306818,"size":1356832768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af9a24f61a5989c58b98033b78cfc36b761b140f&amp;dn=Happy+Thank+You+More+Please+%5BDVDScreener%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1302365650,"description":"Happy Thank You More Please [DVDScreener]\n\nDirecciÃƒÂ³n: Josh Radnor\nPaÃƒÂ­s: USA\nAÃƒÂ±o: (2010)\nGÃƒÂ©nero: Comedia RomÃƒÂ¡ntica\nGuiÃƒÂ³n: Josh Radnor\nProducciÃƒÂ³n: Jesse Hara, Austin Stark, Chris Papavasiliou y Benji Kohn\nMÃƒÂºsica: Jaymay\nFotografÃƒÂ­a: Seasmus Tierney\nMontaje: Michael R. Miller\nVestuario: Sarah Beer\nEstreno en EspaÃƒÂ±a: 08-04-2011\n\nReparto: Josh Radnor, Malin Ackerman, Kate Mara, Zoe Kazan, Pablo Schreiber, Tony Hale, Michael Algieri, Richard Jenkins\n\nSinopsis\n\nEl joven escritor Sam Wexler (Josh Radnor) no estÃƒÂ¡ teniendo uno de los mejores dÃƒÂ­as de su vida. Se despierta tarde, y con resaca, para asistir a una importante reuniÃƒÂ³n con el director de una de las editoriales mÃƒÂ¡s prestigiosas de Nueva York. De camino a su cita, se encuentra con un niÃƒÂ±o que ha perdido a su madre en el metro y se debate entre continuar su camino, como si nunca hubiera visto al niÃƒÂ±o, o hacerse cargo de ÃƒÂ©l mientras encuentra a su familia. Tras intentar, infructuosamente, localizar a la familia del pequeÃƒÂ±o Rasheen, Sam decide llevarlo a su cita en la editorial, que supone un estrepitoso fracaso. La vida de Sam gira en torno a la de sus amigos, un grupo de neoyorquinos que, a punto de entrar en la edad adulta, tratan de resolver sus dudas sobre el amor y la amistad. Annie, su mejor amiga (Malin Ackerman) padece una enfermedad alimenticia que le ha hecho perder el pelo, y segÃƒÂºn ella piensa, todo su atractivo fÃƒÂ­sico. Sam 2 (Tony Hale) es un compaÃƒÂ±ero de trabajo que se siente muy atraÃƒÂ­do por ella, pero a quien ella rehuye a toda costa. Charlie (Pablo Schrieber) y su novia Mary Catherine (Zoe Kazan) atraviesan un momento difÃƒÂ­cil en su relaciÃƒÂ³n cuando, tras recibir una oferta de trabajo en Los Angeles, Charlie empieza a plantearse muy seriamente el traslado. La vida sentimental de Sam no va mucho mejor que su carrera, pasa de una relaciÃƒÂ³n a otra, evitando cualquier tipo de compromiso, hasta que encuentra a Mississippi (Kate Mara), una hermosa camarera y cantante. Queda tan impactado con ella que le propone un curioso trato que harÃƒÂ¡ tambalearse su vida y la de sus amigos. ","torrent":{"xt":"urn:btih:af9a24f61a5989c58b98033b78cfc36b761b140f","amp;dn":"Happy+Thank+You+More+Please+%5BDVDScreener%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9a24f61a5989c58b98033b78cfc36b761b140f","infoHashBuffer":{"type":"Buffer","data":[175,154,36,246,26,89,137,197,139,152,3,59,120,207,195,107,118,27,20,15]},"announce":[],"urlList":[]}}