{"title":"Juicy Lucy...Who Do You Love; The Anthology(2002)[FLAC]","uid":5723647,"size":552016619,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:afd128bb9e9b6d0dbac37e040951cc10869e9a50&amp;dn=Juicy+Lucy...Who+Do+You+Love%3B+The+Anthology%282002%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":24,"time":1280382489,"description":"Product Details CMRCD 564\nAudio CD (August 26, 2002) \nNumber of Discs: 1 \nFormat: Import \nLabel: Castle Music UK \n \n\n\nJuicy Lucy are a blues-rock band formed in 1969. After the demise of garage band, The Misunderstood, vocalist Ray Owen, steel guitarist Glenn Ross Campbell, and saxophone player Chris Mercer formed Juicy Lucy. The group later recruited guitarist Neil Hubbard, bassist Keith Ellis, and drummer Pete Dobson\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley perennial &quot;Who Do You Love?&quot;\n\nTheir self-titled debut album then fell just shy of the Top 40 in the UK Albums Chart. The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.\n\nLine-up changes were quickly afoot as ex-Zoot Money singer Paul Williams, guitarist Micky Moody, and drummer Rod Coombes replaced Owen (who exited for a solo career), Hubbard, and Dobson for 1970's Lie Back and Enjoy It (#53 - UK Albums Chart). In May 1970, the band appeared at the annual NME poll-winners concert. Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This. In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.\n\nThe constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces. This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter.\n\nMicky Moody (born 30 August 1950, in Middlesbrough), later joined the inaugural Whitesnake line-up in 1978. Before then he was a member of another rock outfit Snafu between 1973 and 1976. Moody also released the bluesy solo album I Eat Them For Breakfast in 2001. Plus, Juicy Lucy's version of the song &quot;Who Do You Love?&quot; was featured in Shellshock: Nam '67.\n\nFounder member Ray Owen revived the name in 1995 for the album Here She Comes Again which found Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums) rounding out the band. A couple of years later this version of the band broke up but Owen wanted to keep on going, especially when he formed a musical partnership with a guitarist known as Mr. Fish. Legal problems kept the new band from using the Juicy Lucy name, so they gigged as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\nBy 2004 bassist Fudge and drummer Fletch had joined the band and the legal issue was settled. The new Juicy Lucy spent 2006 working on a new album (subsequently titled Do That And You'll Lose It), and touring the UK with fellow rock veterans Nazareth.\n\nThey played the Cambridge Rock Festival (2007) and have a formidable live reputation. The link with the past though is not forgotten, and the modern day Juicy Lucy still plays &quot;Mississippi Woman&quot;, &quot;Who Do You Love?&quot; and more from their first album. In 2009 a new line up formed as, due to health problems, Owen was unable to continue. The band is now fronted by singer/ guitarist Mr Fish, Fletch (drums) and James (bass), and is still touring the UK.\n\n1. Mississippi Woman  \n2. Pretty Woman  \n3. Who Do You Love  \n4. Whisky In My Jar  \n5. Built For Comfort  \n6. Midnight Sun  \n7. Changed My Mind, Changed My Sign  \n8. Walking Down The Highway  \n9. That Woman's Got Something  \n10. Chicago North Western  \n11. Thinking Of My Life  \n12. Jessica  \n13. Harvest  \n14. Just One Time  \n15. Midnight Rider  \n16. Future Days  \n17. Nadine  \n18. She's MIne  \n19. Willie The Pimp/ Lie Back And Enjoy It","torrent":{"xt":"urn:btih:afd128bb9e9b6d0dbac37e040951cc10869e9a50","amp;dn":"Juicy+Lucy...Who+Do+You+Love%3B+The+Anthology%282002%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd128bb9e9b6d0dbac37e040951cc10869e9a50","infoHashBuffer":{"type":"Buffer","data":[175,209,40,187,158,155,109,13,186,195,126,4,9,81,204,16,134,158,154,80]},"announce":[],"urlList":[]}}