{"title":"Starman FullDVD","uid":3605247,"size":4632784943,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b0024ecfe4e924752d2fda8772fdbff1fcf57390&amp;dn=Starman+FullDVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"silvia-","files":32,"time":1169985185,"description":"STARMAN\n\n[img]http://www.dvdedice.cz/data/1129475418_big.jpg[/img]\n\nYear 1984\nDirector John Carpenter \nCast Jeff Bridges, Karen Allen, Charles Martin Smith, John Walter Davis, Richard Jaeckel, Robert Phalen, Tony Edwards, Ted White \nLength 110 min \nVideo Pal\n2.35:1\n\nLanguages Dolby Digital 5.1: English, French . Dolby Surround: Spanish, German, Italian \nSubtitles Spanish, English, French, German, Polish, Czech, Hungarian, Hindu, Turkish, Danish, Arabic, Bulgarian, Swedish, Finnish, Icelandic, Dutch, Norwegian, Portuguese, Greek, Hebrew, Italian \n\nOther features\nInteractive Menus, Scene Access, Commentaries Deleted: Making of and Videoclip,\n\nDVD9 to DVD5\nDVDDecrypter. DVDRemake. DBDRebuider + CCE(7pass) \n\nSynopsis\nFrom All Movie Guide: Having crashed to Earth, an extraterrestrial space traveller must assume a human identity lest he be captured by the authorities. The alien (Jeff Bridges) chooses the likeness of the recently deceased husband of Jenny Hayden (Karen Allen). At first dumbstruck, Jenny becomes both hostile toward and frightened of her guest. He gradually wins her confidence, learning a few vital English-language phrases so that he can explain his presence. The \\&quot;starman\\&quot; has come to Earth with a message of peace, in response to the similar message sent out on Voyager One. He asks for Jenny\\&amp;#039;s help in transporting him to the Nevada desert, where his fellow aliens are to pick him up and take him to his home planet. Soon he and Jenny form a united front against a mean-spirited National Security Council agent (Richard Jaeckel), who intends to seize the starman and turn him over for scientific scrutiny (and possible extermination). While en route to Nevada, Jenny grows closer to the gentle-natured Starman, eventually making love with him. By the time he is poised to leave, she is carrying his child, leaving the field wide open for a sequel--which was never produced, though a weekly TV version surfaced in 1986. ~ Hal Erickson, All Movie Guide \n\nmore details: www.solodvd.org","torrent":{"xt":"urn:btih:b0024ecfe4e924752d2fda8772fdbff1fcf57390","amp;dn":"Starman+FullDVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0024ecfe4e924752d2fda8772fdbff1fcf57390","infoHashBuffer":{"type":"Buffer","data":[176,2,78,207,228,233,36,117,45,47,218,135,114,253,191,241,252,245,115,144]},"announce":[],"urlList":[]}}