{"title":"Le Wood Anal Hazing Crew vol. 3 (2013) [DvdRip].mp4","uid":9189887,"size":1820013297,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b1701208270108d6c1577c4f0b4c82add285eee2&amp;dn=Le+Wood+Anal+Hazing+Crew+vol.+3+%282013%29+%5BDvdRip%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FluxXxu","files":-1,"time":1384369079,"description":"\nLe Wood Anal Hazing Crew vol. 3 (2013) [DvdRip].mp4\n\n\nScreens\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=37076482153017374874.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=37076482153017374874.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=08425603270599750335.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=08425603270599750335.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=35398288768211879151.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=35398288768211879151.jpg&lt;/a&gt;\n\n\nCast\n\nBailey Blue, Binky Bangs, Casey Calvert, Francesca Le, Mark Wood, Remy Lacroix\n\n\nDescription\n\n&quot;Francesca Le, the pretty, American-Latina MILF with the awesome ass, is up for the fiercest, nastiest anal action; well-hung porn stud Mark Wood is her husband and directing partner. These hard-core swingers, known collectively as LeWood Productions, present their latest collection of crazy rectal vignettes. In The LeWood Anal Hazing Crew #3, they teach deserving young ladies brutal lessons about proper behavior ... through the use of perverse face fucking and ruthless ass reaming! Francesca and Mark love ganging up on cute young things, making sexual encounters into vicious, two-against-one matches. In the first scene, they learn that stuck-up, popular girl Remy LeCroix has been bullying their daughter. So Mark and Francesca give the gorgeous brat a stern talking-to, and something more to help her remember: Mark's big, sphincter-widening prick. After a session of hair pulling, face slapping, breath control and ass-to-mouth cocksucking, little Remy admits defeat, her pretty face slathered in semen. Next, the team lures beautiful, new porn starlet Casey Calvert under the pretense of helping her prepare for an awards ceremony. Instead, they give the all-natural beauty a rough anal threesome and a sloppy cum facial. Mark discovers Binky Bangs, his maid's hot daughter, hanging around the house. He takes advantage of the situation, letting the slender Latina spitfire kneel and gag on his massive prick. Suddenly, Mrs. Wood (Francesca) discovers the infidelity, but instead of chastising him, she turns her anger into raw lust. The twisted pair punishes Binky's transgression with anal domination, lewd rimming and a messy load in her pretty mouth. Lastly, the LeWood household's freeloading tenant, Bailey Blue, gets assigned some filthy, new chores. When the wild three-way sodomy session is finished, Francesca spreads the young blonde's mouth as Bailey receives a messy cum facial. Including 20 minutes of revealing interviews and behind-the-scenes footage, The LeWood Anal Hazing Crew #3 shows no mercy. Anal sex for these girls will never be the same!&quot;\n\n\nTags\n\nHardcore, XxX, Hot, Cumshot, Threesome, Feature, Porn Star, Anal\n\n\nResolution\n\n720x404\n  \n\nDuration\n\n02:31:05\n   \n\t\nSize\n\n1.70 GB\n      \n\n\n","torrent":{"xt":"urn:btih:b1701208270108d6c1577c4f0b4c82add285eee2","amp;dn":"Le+Wood+Anal+Hazing+Crew+vol.+3+%282013%29+%5BDvdRip%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1701208270108d6c1577c4f0b4c82add285eee2","infoHashBuffer":{"type":"Buffer","data":[177,112,18,8,39,1,8,214,193,87,124,79,11,76,130,173,210,133,238,226]},"announce":[],"urlList":[]}}