{"title":"Fs2004 - Just Flight Flyiong Club","uid":4238078,"size":363880599,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b235ca78d535240d2f3b87500130446bda70ce65&amp;dn=Fs2004+-+Just+Flight+Flyiong+Club&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Papazoff","files":1,"time":1213392962,"description":"The definitive General Aviation collection for Flight Simulator all in one pack! Flying Club features the four most popular GA training aircraft in the World - the PA28-161 Warrior, PA38-112 Tomahawk, C152 and the twin engined PA34-200T Seneca II - and all aircraft have authentic and realistic avionics suites and an additional set of three liveries as well as the default specimens. All aircraft come with UK, American, German and French registrations and there are a total of 65 aircraft variations to fly in Flying Club!\n\nFlying Club features the four most popular general aviation training aircraft in the world as well as authentic Shoreham airport scenery and you can even take FS2004&amp;#039;s flying lessons in Flying Club aircraft!\n\n\nFeatures include:\n\n* 4 highly accurate and detailed General Aviation aircraft based on extensive research; PA28-161 Warrior, PA38-112 Tomahawk, C152 and the twin engine PA34-200T Seneca II\n* Authentic looking and operating avionics as fitted to the real aircraft\n* A total of 65 aircraft to fly\n* Four liveries per aircraft type. Each aircraft is available to fly in UK, American, German and French registrations\n* Authentic custom sound sets built from the real aircraft sounds in and out\n* Highly realistic custom flight models created by an industry leader in this field\n* High-quality authentic aircraft textures inside and out giving you that &amp;#039;real feel&amp;#039;\n* All models are based on extensive research on the actual real-world aircraft\n* Accurate Shoreham Airport scenery (DVD version only)\n* Immersive virtual cockpits with mouse clickable instruments and knobs\n* Authentic 2D instrument panels included\n* Works in FS2004\n* Authentic animations; Propellers, rotating wheels, moving flaps, elevators, rudders, ailerons, nose wheel steering, entry doors, engine inspection panels, undercarriage shock absorber movement, trim tabs and where applicable, variable pitch props and operating landing gear - even the door handles and sun visors work!\n* Details, details! Visually detailed engine compartments and small but important items like the brake fluid lines, pitot head, Comms and Nav radio antennas, sun visors, footsteps, tie down points, flap hinges, door hinges, temperature gauge probes, fuel tank caps, hand grab handles - even the door stops are modelled!\n* AeroLoad payload editor. Change the amount of fuel, baggage and the number of passengers you are carrying. You will even see the correct number of people in the cabin\n* AeroPaint texture utility. Create new custom liveries of the aircraft or edit the existing ones. (External painting program required such as MS Paint)\n* AeroFace. You want to be the pilot? Easy. Use AeroFace to place your or any other face image on pilot!\n* Operating navigation and landing lights\n* Cockpit night lighting\n* Printed manual\n* Ability to use the aircraft in conjunction with Flight Simulator Flying Lessons","torrent":{"xt":"urn:btih:b235ca78d535240d2f3b87500130446bda70ce65","amp;dn":"Fs2004+-+Just+Flight+Flyiong+Club","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b235ca78d535240d2f3b87500130446bda70ce65","infoHashBuffer":{"type":"Buffer","data":[178,53,202,120,213,53,36,13,47,59,135,80,1,48,68,107,218,112,206,101]},"announce":[],"urlList":[]}}