{"title":"Where In The World Is Osama Bin Laden - DvDRIP ENGSUBS","uid":4343554,"size":655236893,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b23cea8fa49d738f184fdfcc4d6b0408c2e83f1c&amp;dn=Where+In+The+World+Is+Osama+Bin+Laden+-+DvDRIP+ENGSUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":2,"time":1218746284,"description":"Morgan Spurlock searches for Osama bin Laden by visiting countries associated with the Al-Qaeda leader (Morocco, Saudi Arabia, Afganistan, and Pakistan), as well as others affected by Al-Qaeda (Greece, Egypt, and Israel). In each, he interviews individuals about their views of the United States and Islamic fundamentalism. He also constantly asks people he meets, &quot;Where is Osama bin Laden?&quot; Intercut with Spurlock&amp;#039;s search are the late stages of his wife&amp;#039;s pregnancy and the birth of their son after he returns. Much of Spurlock&amp;#039;s commentary is based on the concerns of a new father. (The film is dedicated to the newborn.) \n\nA highly entertaining and culturally informative view of both Islam and Christianity, filmed in his inimitable style Morgan travels around the planet and talks to everyday people and solicits their views on problems that face us all. This is a real pleasure to watch as the candid nature of the interviews and the plain honesty of the film shine through. \n\nFYI: This is the &quot;scene&quot; release from Arrow with the English subtitles hard-coded into the film, this means that no subtitle files are needed. \n\nPlease help by seeding this torrent \n\n.c0H","torrent":{"xt":"urn:btih:b23cea8fa49d738f184fdfcc4d6b0408c2e83f1c","amp;dn":"Where+In+The+World+Is+Osama+Bin+Laden+-+DvDRIP+ENGSUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b23cea8fa49d738f184fdfcc4d6b0408c2e83f1c","infoHashBuffer":{"type":"Buffer","data":[178,60,234,143,164,157,115,143,24,79,223,204,77,107,4,8,194,232,63,28]},"announce":[],"urlList":[]}}