{"title":"Family Guy Seizoen 1 dvd 1 (ENG)(NL SUBS) 2Lions-Team","uid":5220605,"size":2638070863,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b40f2448fcd59515b4ca678153a35746867eb91a&amp;dn=Family+Guy+Seizoen+1+dvd+1+%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1260913518,"description":"Family Guy Seizoen 1 dvd1 (complete)\n\n\n\nDe animatieserie over een gestoorde familie met een vader die het wel probeert maar er niet in slaagt om enige stuctuur en regelmaat in zijn eigen leven en dat van zijn familie te scheppen.\n\nNiets is te gek!\nEr gebeurt altijd van alles in de familie van vader Peter Griffin. Maar het is voornamelijk chaos en wanorde die heersen. De jongste van de drie kinderen in de familie, Stewie, is een duivels mannetje die een moordaanslag niet uit de weg gaat als ie zijn zin niet krijgt. De hond Brian mengt zich in de conversaties want hij kan praten, rookt sigaretjes en drinkt een martini op zijn tijd. En moeder is de enige stabiele factor in het gezin en daarom vaak het middelpunt van spot en grappen. Eigenlijk heeft Family Guy geen vaste verhaallijn behalve dat er altijd bizarre en enorm lachwekkende situaties zijn. Die doorgaans beginnen met een mooi plan van vader Peter wat bijna altijd desastreus uitpakt voor hem en zijn familie. Family Guy is inmiddels een klassieke comedy serie die elke keer weer verrast met bizarre wendingen en de meest originele grappen.\n\n\n\n\n\nEnglish\n\nThe Griffin household includes two teenagers, a cynical dog who is smarter than everyone else, and a mutant baby who makes numerous attempts to eradicate his parents and siblings. Heading up this eclectic household is Peter Griffin. Peter does his best to do what's right for the family, but along the way, he makes mistakes that are the stuff of legends.\n\n* Death Has a Shadow\n* I Never Met the Dead Man\n* Chitty Chitty Death Bang\n* Mind Over Murder\n* A Hero Sits Next Door\n* The Son Also Draws\n* Brian: Portrait of a Dog\n\n\nBron : TV (PAL)\nAudio : English 3.2\nSubs : Dutch (LOSSLES) \nMenu : Yes Make by tkillaahh\n\n\n\nWeblink : http://www.imdb.com/title/tt0182576\n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:b40f2448fcd59515b4ca678153a35746867eb91a","amp;dn":"Family+Guy+Seizoen+1+dvd+1+%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b40f2448fcd59515b4ca678153a35746867eb91a","infoHashBuffer":{"type":"Buffer","data":[180,15,36,72,252,213,149,21,180,202,103,129,83,163,87,70,134,126,185,26]},"announce":[],"urlList":[]}}