{"title":"INXS - Suicide Blonde","uid":4845819,"size":141420548,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b4400c1548d2d38ba6d9e852c1c5537f04680fb2&amp;dn=INXS+-+Suicide+Blonde&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1239677577,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Suicide Blonde&quot; was the name of the first single from the INXS album X. It reached the top 10 on the US Hot 100 (#9) and Australia in 1990 and reached a peak of #11 in the UK.\n\nThe song was written by Michael Hutchence and Andrew Farriss of the group INXS, after the band had gotten back together after a year-long sabbatical during 1989. The title track (a term not originating with this song) was named after a woman who had bleached her own hair because she had &quot;dyed&quot; by her own hand and who was &quot;love devastation.&quot; It is rumoured that Hutchence's then-girlfriend, Kylie Minogue, gave him the inspiration for the title whilst working on her 1989 film &quot;The Delinquents&quot;. Minogue was required to dye her hair platinum blonde for the role and was quoted by Hutchence in an interview in '89 as saying &quot;I'm going suicide blonde today&quot;.\n\nThe recording of &quot;Suicide Blonde&quot; showed some new influences on INXS. Jon Farriss' drums show the influence of dance music especially the acid house sounds popular in the UK. Similarly, the blues harp intro on the track, performed by Charlie Musselwhite, was sampled rather than recorded live.\n\nThe track became poignant after Hutchence committed suicide on November 22, 1997 and his lover Paula Yates died of an overdose on September 17, 2000 after attempting suicide in 1998. The lyrics of the song do not refer to Yates who did not enter a relationship with Hutchence until the mid 1990s, but (as above) in reference to Kylie Minogue, whom he was dating at that time.\n\nKym Wilson (with her then boyfriend Andrew Reyment the last people to see Michael alive) also became known as the &quot;Suicide Blonde&quot; in the tabloids.\n\nGarry Gary Beers's ex-wife Jodie can be heard laughing on the track.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b4400c1548d2d38ba6d9e852c1c5537f04680fb2","amp;dn":"INXS+-+Suicide+Blonde","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4400c1548d2d38ba6d9e852c1c5537f04680fb2","infoHashBuffer":{"type":"Buffer","data":[180,64,12,21,72,210,211,139,166,217,232,82,193,197,83,127,4,104,15,178]},"announce":[],"urlList":[]}}