{"title":"(2016) Moon Bros. - These Stars [FLAC,Tracks] {100.XY}","uid":15647484,"size":221943964,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b59e652db305339649e321051d916b5291e071c0&amp;dn=%282016%29+Moon+Bros.+-+These+Stars+%5BFLAC%2CTracks%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":11,"time":1472063070,"description":"[center][b](2016) Moon Bros. - These Stars[/b][/center]\r\n\r\n\r\n[b]Review:[/b]\r\nThe appeal of this lo-fi folk-influenced Americana album by Moon Bros lies predominantly on the dextrous skill of carpenter/musician Matt Schneider’s guitar playing. Whether it’s providing the foundation for his voice, or indulging on lengthy instrumental wig outs, it’s the main calling card. There’s shades of Gustavo Santalallo at times, and Nick Drake at others – he’s an intimidatingly accomplished player. This explains the top-notch musicians who were drawn to recorded These Stars with him. There’s members of Iron and Wine, Tortoise, and Cairo Gang on the record adding bass, lap steel and drums.\r\nSchneider is no stranger to the lives the above collaborators have led as touring musicians. Before recording as Moon Bros, he was a part of the Chicago post rock underground, and toured Europe. But, after that he sought solace in the Illinois countryside in order to sharpen his playing, originally only intending a short hiatus. But a complete abandonment of touring altogether happened and he became a carpenter and recorded, in the shadows of the industry, under the name Moon Bros with constantly shifting line ups. It’s a drastic change in style that wouldn’t be achieved in an urban setting.\r\n\r\nThe release of These Stars, however, represents the boldest step into the limelight since his early days on the road. It’s the first Moon Bros album first to get international release. Contrast that with the outcome of his first three albums, which the press release claims are lost forever as the cd-r’s have crushed in a tool box. The two LPs before this, meanwhile, didn’t get a label and outside of small in-the-know circles are pretty unknown.\r\n\r\nDespite this current label support, the recording comes across in unflinchingly as Schneider co-ordinating his own thing – there’s no fancy production here, no pandering to international expectations of what an album should achieve. It simply conveys what it would be like to stumble these four musicians playing the deepest, most meditative live set they can manage. It’s the sound of musicians huddled around a campfire bawling their hearts out under the stars with a bottle of straight bourbon.\r\n\r\n\r\n[center]picture here…..[/center]\r\n\r\n\r\n[b]Tracklist:[/b]\r\n01 - These Stars.flac\r\n02 - Pitch.flac\r\n03 - El Conejo.flac\r\n04 - Oh So Cold.flac\r\n05 - Corrido.flac\r\n06 - Wool Blankets.flac\r\n07 - Blues.flac\r\n08 - AC-DC.flac\r\n\r\n[b]Summary:[/b]\r\nCountry: USA\r\nGenre: Indie-Folk\r\n\r\n\r\n[b]Media Report:[/b]\r\nSource                           : CD\r\nFormat                           : FLAC\r\nFormat/Info                      : Free Lossless Audio Codec, 16-bit PCM\r\nBit rate mode                    : Variable\r\nBit rate                         : ~769-887 Kbps\r\nChannel(s)                       : 2 channels\r\nSampling rate                    : 44.1 KHz\r\nBit depth                        : 16 bits","torrent":{"xt":"urn:btih:b59e652db305339649e321051d916b5291e071c0","amp;dn":"%282016%29+Moon+Bros.+-+These+Stars+%5BFLAC%2CTracks%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b59e652db305339649e321051d916b5291e071c0","infoHashBuffer":{"type":"Buffer","data":[181,158,101,45,179,5,51,150,73,227,33,5,29,145,107,82,145,224,113,192]},"announce":[],"urlList":[]}}