{"title":"WinRAR x86 (32 bit) v3.91 Final + KeyReg By ChattChitto","uid":5220604,"size":4664378,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b6eda4b5ba45b068eef9fe49e76f68f5eee8dcca&amp;dn=WinRAR+x86+%2832+bit%29+v3.91+Final+%2B+KeyReg+By+ChattChitto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1260913483,"description":"WinRAR x86 (32 bit) v3.91 Final + KeyReg [Requested]\n\n.exe File Format (Setup File - KeyReg - Instructions)\n\n***********************************************************************************\n\nWinRAR x86 (32 bit) v3.91 Final\n\nHomepage: http://www.rarlab.com/rar_archiver.htm\n\n\nWinRAR benefits:\n==================\n-Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n-WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n-WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n-When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included. One price, one payment, once.\n-You also receive the benefit of a life-time use of the WinRAR archiver. No upgrade fee to pay. When a new release is made, simply download and install, your license is valid for life.\n-WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n-WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n-WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n-WinRAR offers the ability to create selfextracting and multivolume archives.\n-Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n-WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n\n[Please Leave A Comment Confirming This Pack]\n\n-----------------------------------------------------------------------------------\n\nFor Torrent Request: ChattChitto(AT)ChattChitto(DOT)com\n[Put The Request Name In The SUBJECT Box &amp; Also Provide It's Webpage, Or Your Request Will Be Ignored Automatically]","torrent":{"xt":"urn:btih:b6eda4b5ba45b068eef9fe49e76f68f5eee8dcca","amp;dn":"WinRAR+x86+%2832+bit%29+v3.91+Final+%2B+KeyReg+By+ChattChitto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6eda4b5ba45b068eef9fe49e76f68f5eee8dcca","infoHashBuffer":{"type":"Buffer","data":[182,237,164,181,186,69,176,104,238,249,254,73,231,111,104,245,238,232,220,202]},"announce":[],"urlList":[]}}