{"title":"Forest Related Perspectives for Regional Development in Europe","uid":6496252,"size":965257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7fe044b1ff366c718b6264416791c65313b378d&amp;dn=Forest+Related+Perspectives+for+Regional+Development+in+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309082806,"description":"Forest Related Perspectives for Regional Development in Europe\nBrill Academic Publishers | October 1, 2002 | ISBN-10: 9004123113 | 130 pages | PDF | 1.5 MB\n\nMost of the less-favoured regions in Europe feature large areas of forestland. The location of these areas - often far from political and economic centres, and in many cases in adverse climatic or terrain conditions - have been problematic for agriculture as well as for many other economic activities. Because of this unfavourable relationship between forest cover and the regional development opportunities of non-forest sectors, forest resources are an important factor for regional employment and income in many less-favoured regions. Higher utilization of existing wood and non-wood forest resources and services is expected to contribute to regional development by increasing the employment opportunities and welfare. The FORWARD (Forest Resources for Work Opportunities and Regional Development) project at the European Forest Institute was initiated to generate employment and income based on forest resources. The four-year study concentrated mainly on 11 case areas located in the border regions of Europe. In addition, analyses on the overall situation of the potential of forestry to contribute to regional development in Europe were conducted. The findings of the project are presented in this report. ","torrent":{"xt":"urn:btih:b7fe044b1ff366c718b6264416791c65313b378d","amp;dn":"Forest+Related+Perspectives+for+Regional+Development+in+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7fe044b1ff366c718b6264416791c65313b378d","infoHashBuffer":{"type":"Buffer","data":[183,254,4,75,31,243,102,199,24,182,38,68,22,121,28,101,49,59,55,141]},"announce":[],"urlList":[]}}