{"title":"The Beach Boys - An American Family -  disc 2 Originally aired -","uid":3973375,"size":757796691,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9ad8b180fde92ab2e5dc2791c2514a5170b97f1&amp;dn=The+Beach+Boys+-+An+American+Family+-++disc+2+Originally+aired+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"st2580smile","files":1,"time":1200121440,"description":"The Beach Boys: An American Family\n\n2nd week\n\nTV Miniseries\n\n\n\nPlot Synopsis by Hal Erickson \nThough not the first TV dramatization of the lives and careers of the popular 1960s singing group the Beach Boys, this two-part miniseries was the first that did not concentrate exclusively on Brian Wilson, arguably the most brilliant and troubled member of the quintet. Instead, the production details the triumph and heartbreaks of all five Beach Boys: Brian (here played by Frederick Weller), his brothers Carl and Dennis Wilson, and non-related members Mike Love and Al Jardine. Played by Kevin Dunn, the Wilson brothers&amp;#039; father Murray Wilson is cast as a complete monster, shown to be both verbally and physically abusive to his grown sons, as well as a money-grubbing dictator while managing The Beach Boys during their most prolific period. The miniseries also delves into the darker side of the singers themselves, especially when Dennis Wilson (played by Nick Stabile) begins carousing with a would-be tunesmith named Charles Manson (Erik Passoja). Producer John Stamos had originally wanted to appear in the production as Dennis (who died in a surfing mishap in 1983), but the ABC network decided that Stamos was too old for the part. Many (including, reportedly, Brian Wilson himself) complained loudly about the gross liberties taken with actual events in this picture. The Beach Boys: An American Family was originally telecast on February 27 and 28, 2000.\n\n","torrent":{"xt":"urn:btih:b9ad8b180fde92ab2e5dc2791c2514a5170b97f1","amp;dn":"The+Beach+Boys+-+An+American+Family+-++disc+2+Originally+aired+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9ad8b180fde92ab2e5dc2791c2514a5170b97f1","infoHashBuffer":{"type":"Buffer","data":[185,173,139,24,15,222,146,171,46,93,194,121,28,37,20,165,23,11,151,241]},"announce":[],"urlList":[]}}