{"title":"Power-Switching Converters: Medium and High Power","uid":6675967,"size":20341378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc1febcc1591a6d88c6317b4a38a8a47f0429982&amp;dn=Power-Switching+Converters%3A+Medium+and+High+Power&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tirantsh","files":13,"time":1316027809,"description":"Author(s): Dorin O. Neacsu\nPublisher: CRC Press\nDate: 2006-05-25\nFormat: pdf\nLanguage: English\nISBN10: 0824726251\nPages: 384\nISBN13: 9780824726256\n\nProduct Description: Power converters are at the heart of modern power electronics. From automotive power systems to propulsion for large ships, their use permeates through industrial, commercial, military, and aerospace applications of various scales. Having reached a point of saturation where we are unlikely to see many new and revolutionary technologies, industry now seeks to optimize and standardize the performance of these devices. Power-Switching Converters: Medium and High Power examines the characteristics and operating principles of these systems in terms of how to increase their efficiency and produce them at lower cost.\n\nThis book begins with an introduction to the field, placing the technology in its business context to highlight the current trends and issues facing the modern power engineer. The remainder of the book provides a detailed examination of three-phase power switching converters, including the various problems and solutions involved in different applications. It discusses high-power semiconductor devices, pulse-width modulation (PWM) principles and algorithms for various implementations, closed-loop current control, component-minimized topologies, power grid interface, parallel and interleaved power converters, and practical aspects such as protection and thermal management.\n\nFilling the gap between textbooks and technical papers, Power-Switching Converters: Medium and High Power offers practical solutions to current industrial demands with a focus on the particular business needs of performance quality and cost efficiency. It also serves as an excellent textbook for graduate study.","torrent":{"xt":"urn:btih:bc1febcc1591a6d88c6317b4a38a8a47f0429982","amp;dn":"Power-Switching+Converters%3A+Medium+and+High+Power","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1febcc1591a6d88c6317b4a38a8a47f0429982","infoHashBuffer":{"type":"Buffer","data":[188,31,235,204,21,145,166,216,140,99,23,180,163,138,138,71,240,66,153,130]},"announce":[],"urlList":[]}}