{"title":"MEFMedia Suite 2011 Portable","uid":6429184,"size":49836077,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc3f18ff77811e3e5f2696c002a3d9d039c59516&amp;dn=MEFMedia+Suite+2011+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306583902,"description":"MEFMedia Suite 2011 Portable\n\nSoundTaste Audio Converter v2.8.1\nVidMate Video Converter v6.5.1\nDisc Create Express v4.1.2.1\nHotDisc DVD Copy v4.2.1\nMusic Editor Free v8.2.5\nSoundTaste Audio Converter\n\nHave many audio files that need to be converted to other usable audio formats? SoundTaste Audio Converter is what you are looking for! This program is a professional, fast and easy-to-use audio conversion utility to help you convert many audio files in batches with high speed and excellent quality. It also enables you to merge multiple audio files together into a bigger one only within just a few clicks.\n\nVidMate Video Converter\nVidMate Video Converter is the most renowned video converter for converting video files between various formats, with fast converting speed and excellent video quality. It bridges the gap between your various video files and media players, portable devices or video editing software. With user-friendly interface, you can easily convert videos to a format compatible with your multimedia devices like iPod, iPhone, iPad, PSP and so on.\n\nDisc Create Express\nThe Disc Create Express is an ideal, simple and feature-rich program to burn CDs and DVDs, including Blu-ray and HD-DVDs. It includes the feature to directly burn &amp; create standard audio CDs from existing audio files to play in the CD player, as well as burn data CD/DVD to backup important files' data. You can also create a high-quality VCD/SVCD/DVD-Video from your video files. Additionally, it also supports the creation of bootable CD/DVD/Blu-Ray/HD-DVD discs. What's more, you can erase rewritable discs for reuse.\n\nHotDisc DVD Copy\nHotDisc DVD Copy is a very easy, fast and powerful DVD ripping tool, which can help you rip and convert your favorite DVD movies to almost all popular video &amp; audio formats with amazing speed and quality. Then you can enjoy them anytime &amp; anywhere on your iPod, iPhone, iPad, PSP, or other devices on the go. With HotDisc DVD Copy, you can precisely rip your videos by customizing titles, chapters, audio tracks &amp; subtitle you want and applying the preset parameters for each format or device.\n\nMusic Editor Free\nThe program is designed to be very easy and intuitive to use for audio editing. Within minutes you will be able to open or record music and edit it. But if you take time to explore the other features you will find many powerful tools for editing audio designed with the professional sound engineer in mind.\n\nHome Page - http://www.music-editor.net/download.html\n\n\n\n","torrent":{"xt":"urn:btih:bc3f18ff77811e3e5f2696c002a3d9d039c59516","amp;dn":"MEFMedia+Suite+2011+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3f18ff77811e3e5f2696c002a3d9d039c59516","infoHashBuffer":{"type":"Buffer","data":[188,63,24,255,119,129,30,62,95,38,150,192,2,163,217,208,57,197,149,22]},"announce":[],"urlList":[]}}