{"title":"DriverMax 4.9","uid":4689154,"size":3058392,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bdeb1eaa6ff32f00efce89201c0b5a11c74f3958&amp;dn=DriverMax+4.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1233335509,"description":"Copied from Innovative Solutions:\n\n\nDriverMax is a new tool that allows you to download the latest driver updates for your computer. No more searching for rare drivers on discs or on the web or inserting one installation CD after the other. \nJust create a free account, log in, and start downloading the updates that you need. \n\nYou can also export all your current drivers (or just the ones that work ok) to a folder or a compressed file. After reinstalling Windows you will have everything in one place!\n\nMost of the situations when Windows is running slower are caused by faulty driver installations. Windows stores all versions of older drivers just in case you want to go back; sometimes it messes up older versions with more recent ones. \nThe Export Wizard will only export the drivers you select by copying the needed files to a folder or a compressed ZIP file.\n\n\nNote: DriverMax only works on Windows Vista, Windows XP and Windows 2003 (all service packs). Driver downloads are *only* available for Windows Vista and Windows XP users.\n \n\nAfter reinstalling Windows all drivers will be back in place in less than 5 minutes - sparing you of searching, inserting disc after disk and losing precious time. The Import Drivers wizard allows you to install all the drivers that you exported earlier. The entire operation might take up to 5-10 minutes. \n\nJust one single computer restart will be required after all drivers are reinstalled!\n\nDriverMax is able to display a complete report of all drivers (versions, release dates) installed on your system. This feature can also be very useful when you want to analyze the differences between the drivers installed on different machines.\n\n\nComments from the uploader (olofolleola4):\nThis is my new favorite freeware program!\nIt works really good. It was founding 3 old drivers on my computer instantly, and updated them within five minutes. :D","torrent":{"xt":"urn:btih:bdeb1eaa6ff32f00efce89201c0b5a11c74f3958","amp;dn":"DriverMax+4.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdeb1eaa6ff32f00efce89201c0b5a11c74f3958","infoHashBuffer":{"type":"Buffer","data":[189,235,30,170,111,243,47,0,239,206,137,32,28,11,90,17,199,79,57,88]},"announce":[],"urlList":[]}}