{"title":"Angry Video Game Nerd Disc 1 DVDRip XviD-DEViSE [2007]","uid":5042941,"size":734310542,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bedff41e988432c364f0205225cd8d532e9059c7&amp;dn=Angry+Video+Game+Nerd+Disc+1+DVDRip+XviD-DEViSE+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XxRaVeNxX","files":19,"time":1249480988,"description":"The Angry Video Game Nerd (abbreviated as AVGN, occasionally shortened to The Nerd) is the titular character of a series of farcical retrogaming video reviews by James D. Rolfe.The show generally revolves around retro game reviews that involve bitter rants against particularly low-quality or poorly designed video games. The series began as a feature onand later joined ScrewAttack Entertainment, which would later have three of its features, including the AVGN, transferred to GameTrailers exclusively. The show was formerly known as The Angry Nintendo Nerd, a title that was abandoned to avoid legal issues due to the Nintendo trademark, and because the show started reviewing games on other consoles.\n\nThe titular Nerd character is an ill-tempered and foul-mouthed video game fanatic. He derives comic appeal from excessive and inventive use of profanity, frequent displays of explicit gestures, and heavy consumption of beer, particularly Rolling Rock or Yuengling, to &quot;soothe the pain&quot;. A particular characteristic, which has become something of a trademark of his character, is for him to describe, in great detail, extremely repulsive and painful, usually firmly scatological acts, and to claim that he would rather endure them than to play the game that he's reviewing. Varying amounts of physical comedy are mixed into the verbal abuse\n\n---------------------------------------------------------------------------------------\n\nThis best selling DVD is perfect for any Nerd fan. Over 3 hours of footage including an hour of bonus footage never seen before.","torrent":{"xt":"urn:btih:bedff41e988432c364f0205225cd8d532e9059c7","amp;dn":"Angry+Video+Game+Nerd+Disc+1+DVDRip+XviD-DEViSE+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedff41e988432c364f0205225cd8d532e9059c7","infoHashBuffer":{"type":"Buffer","data":[190,223,244,30,152,132,50,195,100,240,32,82,37,205,141,83,46,144,89,199]},"announce":[],"urlList":[]}}