{"title":"El templo de Istar.[ebook].","uid":6207998,"size":18227422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c02b1784b9977a398aac01e358b784c4543d3b2a&amp;dn=El+templo+de+Istar.%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zurera","files":-1,"time":1298881884,"description":"La Guerra de la Lanza ha terminado, y la Oscuridad ha desaparecido. Ã‚Â¿O tal vez no? Porque hay quien ansÃƒÂ­a reinstaurarla en Krynn. Raistlin, el mago de los ojos como relojes de arena, quiere ser mÃƒÂ¡s poderoso que su Reina de la Oscuridad y propagar el Mal en el mundo. El hechicero goza de un desmesurado poder porque Fistandantilus, el archimago mÃƒÂ¡s perverso del orbe, se ha encarnado en ÃƒÂ©l.\n\nSÃƒÂ³lo dos personas pueden detener a Raistlin. Una es Crysania, una bella sacerdotisa, Hija venerable de Paladine, que no tiene en cuenta la flaqueza de sus sentimientos al enfrentarse al hechicero. La otra es Caramon, quien todavÃƒÂ­a sufre por no poder proteger ya a su hermano. El guerrero debe, ante todo, aceptarse a sÃƒÂ­ mismo para luego redimir a su gemelo.\n\n\nCrysania y Caramon junto al impetuoso kender, Tas, son catapultados al pasado gracias a la magia, para que vivan la reencarnaciÃƒÂ³n de Raistlin, y contemplen el agÃƒÂ³nico acontecimiento del Cataclismo, que hundirÃƒÂ¡ la orgullosa ciudad de Istar en el fondo del Mar Sangriento.","torrent":{"xt":"urn:btih:c02b1784b9977a398aac01e358b784c4543d3b2a","amp;dn":"El+templo+de+Istar.%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c02b1784b9977a398aac01e358b784c4543d3b2a","infoHashBuffer":{"type":"Buffer","data":[192,43,23,132,185,151,122,57,138,172,1,227,88,183,132,196,84,61,59,42]},"announce":[],"urlList":[]}}