{"title":"The Book Of Woe - The DSM And The Unmaking Of Psychiatry (Epub,M","uid":9636349,"size":1234689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c09c2d7f7cf03c7b1f5e10cd31955668e8985428&amp;dn=The+Book+Of+Woe+-+The+DSM+And+The+Unmaking+Of+Psychiatry+%28Epub%2CM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1392850554,"description":"Format: mobi/epub\nGenre: Medical/Mental Health\nPrint Length: 416 pages\nRelease Date: 2 May 2013\n\nA riveting expose of the psychiatric profession's bible from leading psychotherapist Gary Greenberg, The Book of Woe reveals the deeply flawed process by which mental disorders are invented and uninvented - and how suffering has been turned into a commodity.\n\nFor more than two years, author and psychotherapist Gary Greenberg has embedded himself in the war that broke out over the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders - the DSM - the American Psychiatric Association's compendium of mental illnesses and what Greenberg calls 'the book of woe'.\n\nSince its debut in 1952, the book has been frequently revised, and with each revision, the 'official' view on which psychological problems constitute mental illness. Homosexuality, for instance, was a mental illness until 1973, and Asperger's gained recognition in 1994 only to see its status challenged nearly twenty years later. Each revision has created controversy, but the DSM-5, the newest iteration, has shaken psychiatry to its foundations. The APA has taken fire from patients, mental health practitioners, and former members for extending the reach of psychiatry into daily life by encouraging doctors to diagnose more illnesses and prescribe more therapies - often medications whose efficacy is unknown and whose side effects are severe. \n\nGreenberg's account of the history behind the DSM, which has grown from pamphlet-sized to encyclopedic since it was first published, and his behind-the-scenes reporting of the deeply flawed process by which the DSM-5 has been revised, is both riveting and disturbing. \n\nAuthor:\n\nGary Greenberg is a practicing psychotherapist and author of Manufacturing Depression and The Noble Lie. He has written about the intersection of science, politics, and ethics for many publications, including The New Yorker, Wired, Discover, and Rolling Stone. He is a contributor at Mother Jones, and a contributing editor at Harper's. Dr. Greenberg lives with his family in Connecticut.","torrent":{"xt":"urn:btih:c09c2d7f7cf03c7b1f5e10cd31955668e8985428","amp;dn":"The+Book+Of+Woe+-+The+DSM+And+The+Unmaking+Of+Psychiatry+%28Epub%2CM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c09c2d7f7cf03c7b1f5e10cd31955668e8985428","infoHashBuffer":{"type":"Buffer","data":[192,156,45,127,124,240,60,123,31,94,16,205,49,149,86,104,232,152,84,40]},"announce":[],"urlList":[]}}