{"title":"Spyware Doctor + AntiVirus 2010 7.0.0.545 -TrT","uid":5510399,"size":36057252,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c200d2c67cb0fd71d13f19a8f3e0138d4faecf6d&amp;dn=Spyware+Doctor+%2B+AntiVirus+2010+7.0.0.545+-TrT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigwimpie","files":-1,"time":1271982442,"description":"Spyware Doctor + AntiVirus 2010 7.0.0.545\nFull Version with Serial\n\nExpiry Date: October, 2010\nO/S: Windows 2000, XP, Vista (32/64-bits), Win7 (32/64-bits)\nMultiLanguage\n\nSpyware Doctor provides three-way spyware protection for your PC through real-time \nthreat blocking, advanced system scanning and immunization against known browser infections. \nSpyware Doctor is a multi-award winning spyware removal utility that detects, \nremoves and protects your PC from thousands of potential spyware, adware, Trojans, \nkeyloggers, spybots and tracking thrats. Protect your privacy and computing habits \nfrom prying eyes and virtual trespassers with the help of Spyware Doctor.\n\nAnti-virus software and firewalls do not fully protect your system against the majority \nof spyware and privacy threats. Because spyware is commonly bundled with software downloads, \nattached to e-mails, or transmitted through networks it can appear to be legitimate software, \nbut once installed it can be\nnearly impossible to detect and remove without the help of a dedicated spyware removal \ntool like Spyware Doctor.\n All current versions of Spyware Doctor have won Editors' Choice awards from \n PC Magazine in United States. In addition, after leading the market in 2005, \n Spyware Doctor was awarded the prestigious Best of the Year at the end of 2005.\n\nSpyware Doctor Tools:\n- Spyware &amp; Adware Scanner Keylogger\n- Guard Popup\n- Blocker Phishing\n- Protector Real Time\n- Protection Browser\n- Guard Spyware Cookie\n- Guard Malware\n- Immunizer\n\n-Constant real-time IntelliGuard protection prevents known and new malware threats \nbefore they can install and cause any harm to your PC. IntelliGuard monitors for \nmalicious activity involving spyware processes, viral activity, tracking cookies, \nsuspicious ActiveX objects, browser hijackers, keyloggers, trojans and more.\n-Intelli-Scan swiftly hunts and kills active spyware threats - utilizes patent-pending \nspider scanning technology to quickly identify and remove threats.\n-Behavior Guard, built on ThreatFire's patent-pending ActiveDefense technology \nintelligently scans and analyzes computer processes to accurately detect and block \nany malicious activity.\n-Smart Updates silently and automatically install protection updates and product \nupgrades to ensure powerful protection against the latest threat outbreaks.\n-24/7 Global Malware Research Centre constantly tackles the latest threat types and \nimplements new innovations and technologies to quickly combat cybercrime.\n-Game Mode automatically detects your PC switching into full-screen mode for games,\n-Power Saving Mode postpones power-intensive tasks until your laptop is plugged in, \nextending battery life.\n\nInstall Notes:\n==============\n\n1) Run: sdasetup.exe\n2) when asked enter name &amp; serial (see serial.txt)\n3) Done,","torrent":{"xt":"urn:btih:c200d2c67cb0fd71d13f19a8f3e0138d4faecf6d","amp;dn":"Spyware+Doctor+%2B+AntiVirus+2010+7.0.0.545+-TrT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c200d2c67cb0fd71d13f19a8f3e0138d4faecf6d","infoHashBuffer":{"type":"Buffer","data":[194,0,210,198,124,176,253,113,209,63,25,168,243,224,19,141,79,174,207,109]},"announce":[],"urlList":[]}}