{"title":"System of a Down - Toxicity - 2001 + Hipnotize - 2005","uid":4290306,"size":182595205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c22cf4cd258280d6e5905c55cc3a344c2288291e&amp;dn=System+of+a+Down+-+Toxicity+-+2001+%2B+Hipnotize+-+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kolomi","files":29,"time":1215877561,"description":"Toxicity\n\nReview\tby Ed Rivadavia\n\nSystem of a Down&amp;#039;s 1998 debut was initially overlooked by the mainstream hard rock audience, as well as the specialized press. But heavy metal cognoscenti in both camps quickly realized that in their hands was a potentially crucial stepping stone for the future development of heavy metal. Sure enough, so challenging and groundbreaking were its contents that the album soared over most everyone&amp;#039;s unsuspecting heads, its eventual gold sales status only achieved via Columbia Records&amp;#039; massive promotional muscle and nearly three years of intensive touring on the band&amp;#039;s part. Consequently, early believers were pleasantly surprised when 2001&amp;#039;s long awaited follow-up, Toxicity met with instant popular acceptance, skyrocketing up the charts toward multi-platinum success. Yet, for the most part, it also managed to retained SOAD&amp;#039;s unorthodox signature sound: so-called &quot;nu-metal&quot; uniquely infused with remarkable originality, including angular riffs, jagged rhythms, and oblique lyrics splattered all over the place. Like its predecessor, Toxicity seems utterly chaotic upon first listen, but things quickly begin falling into place, thanks to a number of small refinements, not least of which is a more generous melody, obviously pre-meditated, but rarely overdone. In turn, this immediacy greatly improved the album&amp;#039;s chances at radio -- case in point, first single &quot;Chop Suey!,&quot; a track so potent not even September 11, nor mainstream radio&amp;#039;s ensuing self-imposed, politically correct attempt at self-censorship, could tear from the airwaves (despite its none-too-discreet lyrics about suicide), the song&amp;#039;s surprising success was reminiscent of another left-field hit from a decade earlier, Faith No More&amp;#039;s &quot;Epic&quot; (hear its piano-led outro for proof). And sure enough, from the unexpected false starts of &quot;Prison Song&quot; to the relatively mellow conclusion of &quot;Aerials,&quot; the band&amp;#039;s heightened commercial sensibility continues to joust with their inherently quirky songwriting. The excellent title track, &quot;Forest,&quot; and &quot;Science&quot; are among the most accessible standouts from an incredibly diverse set, the likes of which SOAD&amp;#039;s inferior nu-metal peers could only hope to emulate. Lyrically, it&amp;#039;s simply no contest. Whether tackling typical rock subject matter like drug abuse (&quot;Needles&quot;) and groupies (&quot;Psycho&quot;), or embarking on inscrutable Dadaist gems like &quot;Jet Pilot&quot; and &quot;Shimmy,&quot; co-songwriters Daron Malakian and Serj Tankain sound like are the bastard children of Frank Zappa and Slayer. And while sub-Rage Against the Machine political invective (unfairly attributed to their Armenian heritage) remains an integral part of the band&amp;#039;s creative makeup (e.g. &quot;Deer Dance,&quot; &quot;Atwa&quot;), Toxicity&amp;#039;s approach is much more cautious in this regard than that of their incendiary debut. In conclusion, when a band takes this many left turns, you&amp;#039;d expect them to start going in circles sooner rather than later, but this is not the case with System of a Down. Hands down one of 2001&amp;#039;s top metal releases, Toxicity may well prove to be a lasting heavy metal classic to boot. \n\nHipnotize\n\nReview\tby Johnny Loftus\n\nIt wasn&amp;#039;t a lie when System of a Down said the packaging for Mezmerize and Hypnotize would slot together. Released in November 2005, roughly six months after its counterpart, Hypnotize does indeed feature a tri-fold design. But the extra cardboard slotting&amp;#039;s a little extraneous, as are some of the sonic parts on both albums. Truth is the motor for System&amp;#039;s spazzy, modernist thrash. It drives the boiling rage in Hypnotize&amp;#039;s &quot;Attack,&quot; &quot;Stealing Society,&quot; and &quot;U-Fig&quot;; on &quot;Holy Mountain,&quot; it inspires SOAD to transform the sad facts of genocide into the album&amp;#039;s most vicious, powerful, and arresting moment. Of course, truth also drives SOAD to make passionate, if slightly screwy, decisions: Serj Tankian&amp;#039;s ADD sputter of &quot;eat &amp;#039;em eat &amp;#039;em eat &amp;#039;em eat &amp;#039;em&quot; and &quot;banana banana banana terracotta&quot; on Hypnotize; Mezmerize&amp;#039;s detour into celebrity baseball game outtakes on &quot;Old School Hollywood.&quot; These moments are head-scratchers, no doubt, but they&amp;#039;re integral to the experience -- System of a Down confound and irritate even as they rock. And it&amp;#039;s precisely because of that weird aggression/aggravation dynamic that Mezmerize/Hypnotize is as strong a concept/double album as metal can offer in 2005. ","torrent":{"xt":"urn:btih:c22cf4cd258280d6e5905c55cc3a344c2288291e","amp;dn":"System+of+a+Down+-+Toxicity+-+2001+%2B+Hipnotize+-+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c22cf4cd258280d6e5905c55cc3a344c2288291e","infoHashBuffer":{"type":"Buffer","data":[194,44,244,205,37,130,128,214,229,144,92,85,204,58,52,76,34,136,41,30]},"announce":[],"urlList":[]}}