{"title":"20130606-Stossel-[The War on...]-Fox Business.CF.avi","uid":8549117,"size":279817076,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c24fe83666dbdc3b3e51519bea80b5e3f526c5f7&amp;dn=20130606-Stossel-%5BThe+War+on...%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1370601742,"description":"[NOTICE: The listing for the June 13 show will be delayed until approximately June 18 UTC due to offline commitments.]\n\n----------\n\nSTOSSEL - [The War on...] - Fox Business Network\n2013, June 6, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nThe American government is at war. We have the War on Terror, the War on Drugs, and also wars against business, &quot;hate&quot; and food.\n\nWAR ON TERROR We now spend almost $800 billion on defense, about 1/5th of our budget. Former CIA Director James Woolsey says we should bankrupt terrorists by mandating that cars be flex-fuel vehicles . Chris Preble, Cato Institute's vice president for defense and foreign policy, says the U.S. military is so large, our allies free-ride off American taxpayers--instead of making their own militaries stronger.\n\nWAR ON BUSINESS When senators went to war against Apple for their efforts to avoid taxes, Senator Rand Paul told them, &quot;you should have brought in a giant mirror, so we could look at the reflection of Congress because this problem is solely and completely created by the awful tax code.&quot; Good for Senator Paul.\n\nWAR ON &quot;HATE&quot; Jimmy LaSalvia, the co-founder of Go Proud-- a republican gay advocacy group, and Paul LeGendre, director of the Fighting Discrimination&quot; Program at Human Rights First debate whether &quot;hate crime&quot; laws work. Kyle from South Park weighs in too.\n\nWAR ON DRUGS Dr. Carl Hart, the author of &quot;High Price&quot; says drugs are not as addictive or as dangerous as government and anti-drug groups make them out to be.\n\nWAR ON FOOD GMO stands for genetically modified food, and that does sound scary. What you might not know is that you already eat genetically modified foods. You think today's corn is natural?:\n\nNo, this is a product of years of selective breeding. Corn used to be much smaller and much less juicy says Jayson Lusk, author of &quot;The Food Police.&quot; Lusk debates Jeffrey Smith, who runs the Institute for Responsible Technology and says GMOs need to be banned.\n\nWe have big government because when there's a problem, people instinctively say &quot;yes, we can!&quot;\n\nThat's why I wrote, &quot;No, They Can't.&quot;\n\nGovernment cannot and it shouldn't try. The more things it goes to war against, the more it grows and the worse off we are.","torrent":{"xt":"urn:btih:c24fe83666dbdc3b3e51519bea80b5e3f526c5f7","amp;dn":"20130606-Stossel-%5BThe+War+on...%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c24fe83666dbdc3b3e51519bea80b5e3f526c5f7","infoHashBuffer":{"type":"Buffer","data":[194,79,232,54,102,219,220,59,62,81,81,155,234,128,181,227,245,38,197,247]},"announce":[],"urlList":[]}}