{"title":"Dennis Coffey - Big City Funk","uid":10397182,"size":296792133,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c330bbcc3aa1512eae5694f979d868ae26ef701a&amp;dn=Dennis+Coffey+-+Big+City+Funk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eugene_Debs","files":-1,"time":1403280791,"description":"Tracklist :\n\n1. Son of Scorpio (3:07)\n\n2. Guitar big band (3:26)\n\n3. Theme from Enter the Dragon (3:08)\n\n4. Chicano (5:07)\n\n5. Lonely moon child (3:17)\n\n6. Impressions of (4:37)\n\n7. Ride Sally ride (3:02)\n\n8. Taurus (2:54)\n\n9. Scorpio (4:10)\n\n10. Getting it on (2:24)\n\n11. Big city funk (2:50)\n\n12. Whole lot of love (2:26)\n\n13. Garden of the moon (3:15)\n\n14. Capricon's thing (2:09)\n\n15. Outrageous (7:27)\n\n\n\nIt's about time. Guitarist and second generation Motown Funk Brother Dennis Coffey was a serious cornerstone of the Motown sound in the latter half of the 1960s and early '70s. That distorted, raw, compressed wah wah freaky funk thang you hear on the Temptations' &quot;Cloud Nine&quot; is his. The 15 sides that make up this comp on the venerable Vampi-Soul imprint are culled from the Sussex recordings he cut between 1971 and 1974 when he left to record the soundtrack to the Blackbelt Jones blaxploitation flick. Before all this, Coffey had cut an early-'60s single produced by Berry Gordy with rockabilly singer Durwood Hutto. It remains in the vault. Coffey was also a member of Rare Earth before getting things started on his own in 1969 with the now legendary Hair &amp; Thangs for Maverick. He paid his bills by day with Motown session work, playing on records by Marvin Gaye and the Jackson Five, and made this brilliant music at night. This is killer breakbeat material, big, raw, funky, tight, and nasty. Tunes on this set have been sampled by everyone from Public Enemy and the Beasties to Mos Def and LL Cool J. James Maycock's liner notes make a pretty convincing case that this is urban soundtrack music, and it's every bit as engaging -- actually way more so than the Brit library scene of the same period, but Coffey was interested in scoring actual films, and the four album samples here -- Evolution, Getting It On, Electric Coffey, and Instant Coffey -- reflect this from front street. It's true from the pumped up bassline, hand percussion, and fuzzed out high-string guitar overdubs on &quot;Son of Scorpio,&quot; and into his amazing cover of Lalo Schifrin's theme from the Bruce Lee flick Enter the Dragon: the low-end funk, wah wah, compressed horns, and spacy effects make the tune so much meaner than the original. The near-constant breaks nearly play counterpoint against the other rhythm guitars, keyboards, and a low-down growling finger popping bassline. And while it's true that the tune &quot;Scorpio,&quot; (which is included here) was Coffey's biggest single, skating into the Top Ten, it still pales in comparison to the funky rave-up &quot;Ride Sally Ride.&quot; (You all heard the intro on LL's &quot;Big Ole Butt.&quot;) Nonetheless, classics like the title track of this comp, the strangely spaced out, highly textured, moody psych-funk interlude &quot;Lonely Moon Child,&quot; and the burning &quot;Big Band Guitar&quot; offer proof that he is no one-trick pony. The Latin-tinged funk of &quot;Chicano,&quot; reflects La Raza spirit and groove of Southwest Detroit during the era -- as well as offering an early version of disco in the Motor City in its middle eight -- and his cover of Led Zep's &quot;Whole Lotta Love&quot; is over the rail. These 15 cuts do showcase the cinematic qualities of Coffey's composition, arrangement, production, and sense dynamic, and why he was invaluable to Motown. But they do more than that, as well: they work as tunes, they are memorable, hummable, and driven. Here's hoping that this is merely a research salvo and that if this baby sells -- and it ought to because not only is it a brilliant selection, it sounds great -- Vampi, or some other enterprising independent label, will actually consider releasing these LPs as CDs Stateside.\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/big-city-funk-original-old-school-breaks-heavy-guitar-soul-mw0001076373&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/big-city-funk-original-old-school-breaks-heavy-guitar-soul-mw0001076373&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.discogs.com/viewimages?release=1080810&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/viewimages?release=1080810&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c330bbcc3aa1512eae5694f979d868ae26ef701a","amp;dn":"Dennis+Coffey+-+Big+City+Funk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c330bbcc3aa1512eae5694f979d868ae26ef701a","infoHashBuffer":{"type":"Buffer","data":[195,48,187,204,58,161,81,46,174,86,148,249,121,216,104,174,38,239,112,26]},"announce":[],"urlList":[]}}