{"title":"Sheriff - Sheriff (1982)","uid":5166591,"size":89825200,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3d4d56b6c6f4c27751af507ea3bee18c3757458&amp;dn=Sheriff+-+Sheriff+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duchessnukem","files":11,"time":1258438363,"description":"You Remind Me\nCalifornia\nMakin' My Way\nWhen I'm With You\nKept Me Coming\nMama's Baby\nCrazy Without You\nElisa\nLiving For A Dream\nGive Me Rock 'N' Roll\n\nNot my rip @ 320\nEnjoy!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nfrom Wikipedia:\n\nThe band was formed in 1979 in Toronto and consisted of vocalist Freddy Curci, guitarist Steve DeMarchi, keyboardist Arnold Lanni, bassist Wolf Hassel and drummer Rob Elliott.\n\nThe band's only release was a self-titled 1982 album that featured a Canadian Top 40 hit, &quot;You Remind Me&quot; as well as their most famous song, &quot;When I'm with You&quot;, which reached #1 in Canada and #61 in the USA in 1983.\n\nThe band split up in 1985, citing internal tensions. Lanni and Hassel went on to form Frozen Ghost and racked up several hits in Canada, the biggest of which was &quot;Should I See&quot;, which reached #69 in the USA becoming their only U.S. hit.\n\nSix years after &quot;When I'm with You&quot; had been a chart hit in Canada, a DJ in New York began playing the song. It subsequently became #1 in the United States in 1988. This success eventually led to Curci and DeMarchi returning to the music scene in a band called Alias, who in the early 1990s had two very popular singles, with &quot;Waiting For Love&quot; and their #2 smash &quot;More Than Words Can Say&quot;.\n\n\nfrom freddycurci.com:\n\nSheriff has one of the most unique stories in rock history, among the many high energy rock bands of the late 70's and early 80's.  \n\nSheriff formed in 1979 in Toronto, Canada. Their popularity in the club circuit garnered the attention of Capital records, which led to their self-titled release Sheriff. Sheriff's singles received a large amount of air play and reached the #1 spot in Canada, due to the success of &quot;When I'm with You.&quot; But south of the border, promotion and distribution problems stalled the records initial American momentum. Still, reached a respectable #61 on the Billboard spot.  \n\nReports of fans not being able to buy the record in their local shops plagued Sheriff's American tour. Rigorous touring, frustrations, and disappointments caused tensions that split the band in two. In 1985 Sheriff disbanded.  \n\nThree years after the demise, a disc jockey in Las Vegas named Jay Taylor, created a nationwide chain reaction when he &quot;When I'm With You&quot; from the vaults and aired it on his nightly show. The song was his personal favorite and quickly became the listeners favorite too. Requests piled up until the single hit their top 10.  \n\nStations began adding the track from a record that was no longer available. In January of 1989, Capitol re-released Sheriff in America. An unprecedented  move. Even without a band, without a video and without changing the album cover or artwork &quot;When I'm with You&quot; hit #1 on Billboard. During that time, Freddy and Steve were recording in the evenings what would later become the debut Alias album. \n\nTo pay their bills, the boys held jobs as couriers during the day. A Toronto reporter did a segment that went nationwide when he tracked down both Freddy and Steve on the job. With parcels in hand they were asked, &quot;What's it feel like, having the #1 single in America?&quot;  \n\nWith a startled look Freddy hesitated, stumbling,&quot;Uhhhhhh, ahhh ummm. Great?&quot; No one had bothered to tell them Sheriff had been re-released.\n\nFreddy is listed in the Guinness Book of Records for holding the longest note in a pop song, timed and submitted by a Houston university, at the ending line of &quot;When I'm with You.&quot; Some skeptics doubted Freddy's ability and accused electronic manipulation of the note. So Freddy recorded a new live version of &quot;When I'm With You&quot; for Then and Now.","torrent":{"xt":"urn:btih:c3d4d56b6c6f4c27751af507ea3bee18c3757458","amp;dn":"Sheriff+-+Sheriff+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d4d56b6c6f4c27751af507ea3bee18c3757458","infoHashBuffer":{"type":"Buffer","data":[195,212,213,107,108,111,76,39,117,26,245,7,234,59,238,24,195,117,116,88]},"announce":[],"urlList":[]}}