{"title":"Coast.to.Coast.AM.June.03.2009-komie","uid":4933378,"size":55163751,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c3e53a3e7d7e076019f54f4e420a9e7e18b72351&amp;dn=Coast.to.Coast.AM.June.03.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":6,"time":1244139908,"description":"Telepathy &amp; Technology\n\n\n\nDate:\n06-03-09\n\nHost:\nGeorge Noory\n\nGuests:\nNick Begich, Steve Alten\n\n\nLecturer and author Dr. Nick Begich discussed the latest research on telepathy in the battlefield, where brain waves alone can give commands. Today's science-fiction may be tomorrow science-fact, he commented. Begich described some of DARPA's far-out experiments which could allow military communication through analysis of neural signals rather than vocalized speech, using EEG to read the brain waves. A similar technique might be employed with &quot;mind reading binoculars&quot; which could pick up threats faster than the conscious mind can process them. Begich noted that other branches of the military such as the Air Force and Navy were also experimenting with mind/brain technologies.\n\nHe raised ethical concerns over the use of such neuro-technology, and the possible imposition of learning people's inner/private thoughts. People wrestle with their thoughts, which are later formalized into behavior, so analysis of the thought process may not yield accurate conclusions about a person's actions.\n\nDown the road, it may be possible to create or delete memory sets-- but how could one discern the truthfulness of testimony such as in a court of law?, he asked. We are now seeing the convergence of computer, biological, and electronic systems, allowing the unprecedented interface between humans and machines, he pointed out. Begich also touched on research into mind control, and how sound, light, or currents can cause changes in mental states. For more on his work in this area, check out this YouTube video clip that features excerpts from some of his lectures/demos as well as an appearance on the Canadian TV show, Undercurrents.\n\nSea Monsters\n\nFirst hour guest, author Steve Alten talked about his new novel, MEG: Hell's Aquarium, which deals with a devastating sea creature called the Megalodon which could weigh up to 100,000 lbs. Though thought to be extinct, it's possible such creatures could exist in the deepest ocean abyss underneath the Philippine Sea Plate, he suggested. Alten also discussed his research into the Loch Ness Monster.\nWebsite(s):\n# earthpulse.com\n# stevealten.com\nVideo(s):\n# Mind Control\nBook(s):\n# Controlling the Human Mind\n# Angels Don't Play This HAARP\n# Earth Rising II: The Betrayal of Science, Society and the Soul\n# Meg: Hell's Aquarium","torrent":{"xt":"urn:btih:c3e53a3e7d7e076019f54f4e420a9e7e18b72351","amp;dn":"Coast.to.Coast.AM.June.03.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e53a3e7d7e076019f54f4e420a9e7e18b72351","infoHashBuffer":{"type":"Buffer","data":[195,229,58,62,125,126,7,96,25,245,79,78,66,10,158,126,24,183,35,81]},"announce":[],"urlList":[]}}