{"title":"The Decline Of The West","uid":11551742,"size":38626175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c404e6d1f418dbca189a52ef7850b043bed0e840&amp;dn=The+Decline+Of+The+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416785945,"description":"Since its first publication in two volumes between 1918-1923, The Decline of the West has ranked as one of the most widely read and most talked about books of our time. In all its various editions, it has sold nearly 100,000 copies. A twentieth-century Cassandra, Oswald Spengler thoroughly probed the origin and &quot;fate&quot; of our civilization, and the result can be (and has been) read as a prophesy of the Nazi regime. His challenging views have led to harsh criticism over the years, but the knowledge and eloquence that went into his sweeping study of Western culture have kept The Decline of the West alive. As the face of Germany and Europe as a whole continues to change each day, The Decline of the West cannot be ignored. The abridgment, prepared by the German scholar Helmut Werner, with the blessing of the Spengler estate, consists of selections from the original (translated into English by Charles Francis Atkinson) linked by explanatory passages which have been put into English by Arthur Helps. H. Stuart Hughes has written a new introduction for this edition. In this engrossing and highly controversial philosophy of history, Spengler describes how we have entered into a centuries-long &quot;world-historical&quot; phase comparable to late antiquity. Guided by the philosophies of Goethe and Nietzsche, he rejects linear progression, and instead presents a world view based on the cyclical rise and decline of civilizations. He argues that a culture blossoms from the soil of a definable landscape and dies when it has exhausted all of its possibilities. Despite Spengler's reputation today as an extreme pessimist, The Decline of the West remains essential reading for anyone interested in the history of civilization","torrent":{"xt":"urn:btih:c404e6d1f418dbca189a52ef7850b043bed0e840","amp;dn":"The+Decline+Of+The+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c404e6d1f418dbca189a52ef7850b043bed0e840","infoHashBuffer":{"type":"Buffer","data":[196,4,230,209,244,24,219,202,24,154,82,239,120,80,176,67,190,208,232,64]},"announce":[],"urlList":[]}}