{"title":"Kevin P. Siena - Venereal Disease, Hospitals and the Urban Poor ","uid":9951228,"size":2140987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c491f36a6017f6424a258cb36c8a4c256e89c7da&amp;dn=Kevin+P.+Siena+-+Venereal+Disease%2C+Hospitals+and+the+Urban+Poor+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397404770,"description":"Description\nProduct Details\nBook Title: Venereal Disease, Hospitals and the Urban Poor: London's Foul Wards 1600-1800 (Rochester Studies in Medical History)\t\nBook Author: Kevin P. Siena (Author)\nSeries: Rochester Studies in Medical History (Book 4)\nHardcover: 375 pages\nPublisher: University of Rochester Press; 1 edition (March 30, 2004)\nLanguage: English\nISBN-10: 1580461484\nISBN-13: 978-1580461481\n\nThis book explores how London society responded to the dilemma of the rampant spread of the pox among the poor. Some have asserted that public authorities turned their backs on the &quot;foul&quot; and only began to offer care for venereal patients in the Enlightenment. An exploration of hospitals and workhouses shows a much more impressive public health response. London hospitals established &quot;foul wards&quot; at least as early as the mid-sixteenth century. Reconstruction of these wards shows that, far from banning paupers with the pox, hospitals made treating them one of their primary services. Not merely present in hospitals, venereal patients were omnipresent. Yet the &quot;foul&quot; comprised a unique category of patient. The sexual nature of their ailment guaranteed that they would be treated quite differently than all other patients. Class and gender informed patients' experiences in crucial ways. The shameful nature of the disease, and the gendered notion of shame itself, meant that men and women faced quite different circumstances. There emerged a gendered geography of London hospitals as men predominated in fee-charging hospitals, while sick women crowded into workhouses. Patients frequently desired to conceal their infection. This generated innovative services for elite patients who could buy medical privacy by hiring their own doctor. However, the public scrutiny that hospitalization demanded forced poor patients to be creative as they sought access to medical care that they could not afford. Thus, Venereal Disease, Hospitals and the Urban Poor offers new insights on patients' experiences of illness and on London's health care system itself. Kevin Siena is Assistant Professor of History at Trent University.\n\nReviews\nThis is a masterly study, based on meticulous archival research, which . . . provides an illuminating spotlight on many aspects of early modern urban life. The rich and detailed story Siena tells will be of interest to a wide range of historians . . . It significantly expands and nuances our hitherto over-simplistic picture of the extent of, and provisions for the treatment of, venereal disease in the metropolis. --Lesley A. Hall, Wellcome Library for the History and Understanding of Medicine, London\n\nVenereal Disease, Hospitals and the Urban Poor is a solid piece of research. Siena has clearly combed a range of archives, and he draws on institutional accounts, court records, medical journals, advertisements, and patient records to make a convincing case that the early modern period was a pivotal one in the treatment of venereal disease. JOURNAL OF THE HISTORY OF SEXUALITY (Alexandra M. Lord)\n\nThis is a well-researched, compelling book on a grim topic with some contemporary overtones. CHOICE\n\nSiena has delved into old sources in new ways, producing not only a superbly refined view of the care offered to the venereally diseased poor throughout early modern England, but also a model for future historical efforts directed towards a better understanding of the care sought for and received by this often overlooked, foundational segment of London society. AMERICAN HISTORICAL REVIEW\n\nIt is a pleasure to read a book so deeply grounded in archival work; Siena's extensive research offers new perspectives on health care in early modern England. First, he dispels any lingering ideas about the happy, unrepressed, pre-Victorian days of jolly sexuality in which venereal disease was just a minor inconvenience. . . . Second, like other scholars, he shows poor patients to be resourceful players in a jerry-built system that met their needs imperfectly at best. As always, ideas about morality and gender shaped health care for the poor, and especially for the poor with venereal diseases. JOURNAL OF THE HISTORY OF MEDICINE, 2006\n\nSiena's ambitions here extend to the attempt to recover patients' own experience of illness and healthcare; and he has succeeded to a remarkable extent in conveying the desperate human costs of the &quot;foul disease.&quot; This is a book then that is marked not only by erudition and sound scholarship but also by humanity and empathy. It is a major achievement. JOURNAL OF SOCIAL HISTORY (Philip Howell)\n\nAbout the Author\nKevin Siena is Assistant Professor of History at Trent University.\n","torrent":{"xt":"urn:btih:c491f36a6017f6424a258cb36c8a4c256e89c7da","amp;dn":"Kevin+P.+Siena+-+Venereal+Disease%2C+Hospitals+and+the+Urban+Poor+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c491f36a6017f6424a258cb36c8a4c256e89c7da","infoHashBuffer":{"type":"Buffer","data":[196,145,243,106,96,23,246,66,74,37,140,179,108,138,76,37,110,137,199,218]},"announce":[],"urlList":[]}}