{"title":"The Rolling Stones - Sticky Fingers (1971) [FLAC]","uid":6279679,"size":287179500,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c540a61b37d47c59732586f92ceb4672378d9aed&amp;dn=The+Rolling+Stones+-+Sticky+Fingers+%281971%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1301388066,"description":"The Rolling Stones\nSticky Fingers (1971)\n\n\n\nBy the time the Rolling Stones began calling themselves the World's Greatest Rock &amp; Roll Band in the late '60s, they had already staked out an impressive claim on the title. As the self-consciously dangerous alternative to the bouncy Merseybeat of the Beatles in the British Invasion, the Stones had pioneered the gritty, hard-driving blues-based rock &amp; roll that came to define hard rock. With his preening machismo and latent maliciousness, Mick Jagger became the prototypical rock frontman, tempering his macho showmanship with a detached, campy irony while Keith Richards and Brian Jones wrote the blueprint for sinewy, interlocking rhythm guitars. Backed by the strong yet subtly swinging rhythm section of bassist Bill Wyman and drummer Charlie Watts, the Stones became the breakout band of the British blues scene, eclipsing such contemporaries as the Animals and Them. Over the course of their career, the Stones never really abandoned blues, but as soon as they reached popularity in the U.K., they began experimenting musically, incorporating the British pop of contemporaries like the Beatles, Kinks, and Who into their sound. After a brief dalliance with psychedelia, the Stones re-emerged in the late '60s as a jaded, blues-soaked hard rock quintet. The Stones always flirted with the seedy side of rock &amp; roll, but as the hippie dream began to break apart, they exposed and reveled in the new rock culture. It wasn't without difficulty, of course. Shortly after he was fired from the group, Jones was found dead in a swimming pool, while at a 1969 free concert at Altamont, a concertgoer was brutally killed during the Stones' show. But the Stones never stopped going. For the next 30 years, they continued to record and perform, and while their records weren't always blockbusters, they were never less than the most visible band of their era -- certainly, none of their British peers continued to be as popular or productive as the Stones. And no band since has proven to have such a broad fan base or far-reaching popularity, and it is impossible to hear any of the groups that followed them without detecting some sort of influence, whether it was musical or aesthetic.\n\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nAudio Quality:\t\tPerfect (Lossless)\nContains:\t\tAlbum Art, CRC, ID Tag [Vorbis Comments]\nM3U File:\t\tYes\n\nFormat:\t\t\tFlac\nGenre:\t\t\tRock\t\t\nLabel:\t\t\tVirgin\t\n\n\nPieced together from outtakes and much-labored-over songs, Sticky Fingers manages to have a loose, ramshackle ambience that belies both its origins and the dark undercurrents of the songs. It's a weary, drug-laden album -- well over half the songs explicitly mention drug use, while the others merely allude to it -- that never fades away, but it barely keeps afloat. Apart from the classic opener, &quot;Brown Sugar&quot; (a gleeful tune about slavery, interracial sex, and lost virginity, not necessarily in that order), the long workout &quot;Can't You Hear Me Knocking&quot; and the mean-spirited &quot;Bitch,&quot; Sticky Fingers is a slow, bluesy affair, with a few country touches thrown in for good measure. The laid-back tone of the album gives ample room for new lead guitarist Mick Taylor to stretch out, particularly on the extended coda of &quot;Can't You Hear Me Knocking.&quot; But the key to the album isn't the instrumental interplay -- although that is terrific -- it's the utter weariness of the songs. &quot;Wild Horses&quot; is their first non-ironic stab at a country song, and it is a beautiful, heart-tugging masterpiece. Similarly, &quot;I Got the Blues&quot; is a ravished, late-night classic that ranks among their very best blues. &quot;Sister Morphine&quot; is a horrifying overdose tale, and &quot;Moonlight Mile,&quot; with Paul Buckmaster's grandiose strings, is a perfect closure: sad, yearning, drug-addled, and beautiful. With its offhand mixture of decadence, roots music, and outright malevolence, Sticky Fingers set the tone for the rest of the decade for the Stones. \t\n\n\nTrack List:\n\n01.Brown Sugar\n02.Sway\n03.Wild Horses\n04.Can't You Hear Me Knocking\n05.You Gotta Move\n06.Bitch\n07.I Got The Blues\n08.Sister Morphine\n09.Dead Flowers\n10.Moonlight Mile\n\n\n\n\n\n\n\n\n\n              ****Support the artists &amp; buy it if you like it.****\n\n                      ****Please don't forget to seed!****\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c540a61b37d47c59732586f92ceb4672378d9aed","amp;dn":"The+Rolling+Stones+-+Sticky+Fingers+%281971%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c540a61b37d47c59732586f92ceb4672378d9aed","infoHashBuffer":{"type":"Buffer","data":[197,64,166,27,55,212,124,89,115,37,134,249,44,235,70,114,55,141,154,237]},"announce":[],"urlList":[]}}