{"title":"Pressure by Jeff Strand","uid":7857406,"size":1492913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5d77560f3ec8e68bd3097a89c7cba80cf831250&amp;dn=Pressure+by+Jeff+Strand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy879","files":5,"time":1353807421,"description":"Murdering sociopaths make lousy friends but marvelously creepy reading, as shown in this wicked thriller from Strand (Mandibles). After stealing condoms on a dare, Alex Fletcher is shipped off to Branford Academy, a boarding school for misfits. Of his four roommates, Darren Rust seems the most peculiar, but Alex becomes uneasy buddies with the little monster-in-the-making after Darren introduces him to the joys of spying on strippers. Unfortunately, Darren also enjoys cutting up dead things, including their roommate's dog, Killer Fang. Although Alex and his friends try to get even with Darren by stringing him up for a good scare, Darren retaliates by going to the headmaster, protesting his innocence and getting two of the boys kicked out of Branford. Their lives diverge until Darren pops up at Alex's college campus. When Alex falls in love with a girl, Darren gets jealous and shows his truly insane colors-to violent effect. The horror in this tale of twisted friendship is relentless, and the choices Alex makes to rescue himself from Darren's web of depravity might be morbid, but Strand's wide-eyed narrator makes the implausible almost believable.\n\nepub, mobi and txt.\n\nplease rep me +1 if you enjoy my uploads. ","torrent":{"xt":"urn:btih:c5d77560f3ec8e68bd3097a89c7cba80cf831250","amp;dn":"Pressure+by+Jeff+Strand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d77560f3ec8e68bd3097a89c7cba80cf831250","infoHashBuffer":{"type":"Buffer","data":[197,215,117,96,243,236,142,104,189,48,151,168,156,124,186,128,207,131,18,80]},"announce":[],"urlList":[]}}