{"title":"Sexually Broken--Grand finale of Syren de Mer BaRS's show with p","uid":12822014,"size":1139329957,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c6d38737a2952f80939a02dbba781c9e09ed5d2d&amp;dn=Sexually+Broken--Grand+finale+of+Syren+de+Mer+BaRS%27s+show+with+p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":1,"time":1448300960,"description":"\nGrand finale of Syren de Mer BaRS's show with punishing BBC deepthroat and rough bondage sex! | Syren De Mer | Matt Williams | Jack Hammer \r\n\r\nNovember 23, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBusty MILF crucified down in belt bondage and throatboaded by BBC \r\n \r\nThis has probably been one of the most intense experiences of Syren De Mer’s cock filled life. This swinger says she loves the dick, but she is used to being able to be in control of the dishing out. When you are in bondage, it is a whole different ballgame. You are not in control of the dick, the dick is in control of you. This busty MILF has never been fucked like this before, not matter how many gang bangs she has done, and she would be the first to tell you so.\r\n\r\nSyren is drooling and dazed, her makeup destroyed and eyes glassed over. She has been hit by the cock truck. Repeatedly. And then run over some more. Her entire show has been fast paced and without mercy, flowing from one bondage position to the next without a break. This is more dick than our cougar is used to getting and she is sporting that classic sexually broken look all over her face.\r\n\r\nBound in an inverted crucifix throatboarding position that keeps her mouth hole open wide and fully exposed, Syren is facefucked into a messy puddle. All the while another cock takes the other end. Syren is a sex sandwich as the two dicks attempt to shake hands in the middle. Her moans are delightful, if not somewhat muffled by the huge cock wedged down her throat.\r\n\r\nWe do not stop until Syren is a wrecked shell of swinger. Our bubble butted MILF can not even recall her own name and is just twitching, a huge smile plastered across her face. Today is a day that she will never forget. If she could only remember it in the first place... \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_23smer9&amp;u=SexuallyBroken-Syren-De-Mer-Matt-Williams-Jack-Hammer-Grand-finale-of-Syren-de-Mer-BaRSs-show-with-punishing-BBC-deepthroat-and-rough-bondage-sex\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:c6d38737a2952f80939a02dbba781c9e09ed5d2d","amp;dn":"Sexually+Broken--Grand+finale+of+Syren+de+Mer+BaRS%27s+show+with+p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d38737a2952f80939a02dbba781c9e09ed5d2d","infoHashBuffer":{"type":"Buffer","data":[198,211,135,55,162,149,47,128,147,154,2,219,186,120,28,158,9,237,93,45]},"announce":[],"urlList":[]}}