{"title":"God Is Watching You: How the Fear of God (2015) pdf","uid":12959995,"size":3374881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c73d066b7d553d5803dbb40ce83eb5dd6d5a5e08&amp;dn=God+Is+Watching+You%3A+How+the+Fear+of+God+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1449837266,"description":"God Is Watching You: How the Fear of God Makes Us Human\r\n\r\nGod Is Watching You is an exploration of this belief as it has developed over time and how it has shaped the course of human evolution. Dominic Johnson explores such questions as: Was a belief in supernatural consequences instrumental in the origins of human societies? How has it affected the way human society has changed, how we live today, and how we will live in the future? Does it expand or limit the potential for local, regional and global cooperation? How will the current decline in religious belief (at least in many western countries) affect our ability to live together? And what, if anything, will temper self-interest and promote cooperation if religion declines? In short, do we still need God?\r\n\r\n Drawing on new research from anthropology, evolutionary biology, experimental psychology, and neuroscience, Johnson presents a new theory of supernatural punishment that offers fresh insight into the origins and evolution of not only religion, but also human cooperation and society. He shows that belief in supernatural reward and punishment is no quirk of western or Christian culture, but a ubiquitous part of human nature that spans geographical regions, cultures, and human history","torrent":{"xt":"urn:btih:c73d066b7d553d5803dbb40ce83eb5dd6d5a5e08","amp;dn":"God+Is+Watching+You%3A+How+the+Fear+of+God+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c73d066b7d553d5803dbb40ce83eb5dd6d5a5e08","infoHashBuffer":{"type":"Buffer","data":[199,61,6,107,125,85,61,88,3,219,180,12,232,62,181,221,109,90,94,8]},"announce":[],"urlList":[]}}