{"title":"Peppermint.Frappe.1967.DVDRip.XViD","uid":5785854,"size":747072927,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8883b4f573209469cffca02af9fdbb2abbb7a7a&amp;dn=Peppermint.Frappe.1967.DVDRip.XViD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ab-resende","files":2,"time":1282620773,"description":"In Carlos Saura's first commercial success, PEPPERMINT FRAPPE, he skirted the puritanical censors of Franco's Spain in this psychological thriller filled with homage's to the Spanish master BuÃƒÂ±uel as well as Hitchcock and Charbol. The VERTIGO-inspired story follows the obsessions of Julian (JosÃƒÂ© Luis Lopez Vazquez), a middle aged, conservative Doctor, who is aided in his practice by his plain, shy nurse, Ana (Geraldine Chaplain). When he was a young man he saw a woman beating a drum in the famous Good Friday procession at Calanda. Years later he is still obsessed with the memory of her flair and beauty. Now, when his childhood friend, Pablo (Alfredo Mayo), comes to visit with his new, sexy blonde wife, Elena (Geraldine Chaplin), Julian believes it is the woman from the parade. His obsession deepens as he watches Elena, in a scene reminiscent of Bertolucci, perform an orgiastic dance to a pounding rock song on an abandoned outdoor dance floor covered with fallen leaves. Saura's unique ability to render dance on film, which would blossom in CARMEN and TANGO, is evident even in this early work. Julian then embarks on an attempt to transform the pliant Ana into the image of Elena, all the while engaging his even darker motives.Saura infuses this story of jealousy and erotic obsession with a contemporary political feel as the men clash over what to do with Julian's old family estate. Julian wants to preserve the past, Pablo thinks he should sell to developers. Geraldine Chaplain gives two strong, clear and distinct performances as the sensuous Elena and the shy Ana in this modern version of the old story of two men in love with the same woman.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0062113/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0062113/&lt;/a&gt;","torrent":{"xt":"urn:btih:c8883b4f573209469cffca02af9fdbb2abbb7a7a","amp;dn":"Peppermint.Frappe.1967.DVDRip.XViD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8883b4f573209469cffca02af9fdbb2abbb7a7a","infoHashBuffer":{"type":"Buffer","data":[200,136,59,79,87,50,9,70,156,255,202,2,175,159,219,178,171,187,122,122]},"announce":[],"urlList":[]}}