{"title":"AVS Media Player 4.1.6.80 Multilanguage-MPT","uid":6512892,"size":91715704,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c8be5c9a83b5802c50d6ae7c699198baa29bb719&amp;dn=AVS+Media+Player+4.1.6.80+Multilanguage-MPT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1309705660,"description":"AVS Media Player 4.1.6.80 Multilanguage\n\nAVS Media Player is an easy-to-use application with a simple user-friendly interface allowing you to start watching movies with no additional software.The program combines rich functionality and a user-friendly interface in order to provide you with the best multimedia experience.\n\nSome Features:\nÃ‚Â· Universal video &amp; audio player\nÃ‚Â· Support for a very wide variety of video formats: the entire range of MPEG-4 (including DivX, Xvid, etc.), MPEG-1, MPEG-2, AVI, Real Media video, Quick Time files, WMV files (including WMV-HD), H.263, H.264, mobile video formats (3GP, 3GP2, MP4).\nÃ‚Â· This strong compatibility makes AVS Media Player a universal player.\nÃ‚Â· Stereo to surround transformation\nÃ‚Â· With the inbuilt Surround Effect, a unique development of our software engineers, regular stereo movies can be watched with enhanced audio quality and imitated Multichannel surround sound (3.1, 5.1, 7.1 speaker configurations are supported).\nÃ‚Â· Easy navigation between scenes\nÃ‚Â· Easy and fast navigation, interactive chapter interface, ability adjust access settings.\nÃ‚Â· Multilingual Support\nÃ‚Â· Ability to select between several audio tracks, support for multiple languages.\nÃ‚Â· Traditionally available set for comfortable viewing - support for various video sources (HDD, portable media, LAN), automatically adjusted Aspect Ratio, one-click switch to full-screen mode, menu options available at a single mouse click, skinable interface etc.\nÃ‚Â· Multilingual Support\nÃ‚Â· AVS Media Player interface and tech-support are available in English, French, German, Spanish and Italian.\n\nAll key formats are supported:\nAVI, IFV, DIV, DIVX, WMV, ASF, ASX, MPG, MPEG, MPE, M4V, MP4, MVV, M2V, M1V, MOD, QT, MOV, DV, DAT, 3GP, 3G2, 3GPP, 3GP2, MS-DVR, DVR-MS, GVI, OGM, OGG, OGV, MKV, FLV, F4V, F4P, TS, TP, TRP, M2TS, M2T, MTS, AMV, MTV, CDG, NSV, FLI, FLC, RM, RAM, RMVB, RV, IVR, WAV, MP3, MPEG3, CDA, MP2, M4A, WMA, OGG, AAC, MPC, MPP, MP+, AIF, AIFF, AIFC, AU, SND, AMR, AWB, FLAC, AC3, BMP, GIF, JPG, JPEG, JPE, JFIF, PNG, TIF, TIFF, PCX, RAS, PSD, TGA, WMF, EMF.\n\nHome page - http://www.avs4you.com\n\n","torrent":{"xt":"urn:btih:c8be5c9a83b5802c50d6ae7c699198baa29bb719","amp;dn":"AVS+Media+Player+4.1.6.80+Multilanguage-MPT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8be5c9a83b5802c50d6ae7c699198baa29bb719","infoHashBuffer":{"type":"Buffer","data":[200,190,92,154,131,181,128,44,80,214,174,124,105,145,152,186,162,155,183,25]},"announce":[],"urlList":[]}}