{"title":"Midtown - Discography (1999-2004) [FLAC]","uid":10385663,"size":1369150137,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca045ffca28053dd1970a256071bb102fd36b5da&amp;dn=Midtown+-+Discography+%281999-2004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1403130543,"description":"\n  Midtown - Discography (1999-2004) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Emo, Punk\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  1999 The Sacrifice of Life EP\n  2000 Save the World, Lose the Girl\n  2002 Living Well is the Best Revenge\n  2002 Living Well is the Best Revenge (Japan)\n  2004 Forget What You Know\n\n  Formed in November 1998 by three Rutgers students, Midtown soon became an energetic quartet comprised of Gabe Saporta (vocals/bass), Rob Hitt (drums), Tyler Rann (guitar/vocals), and Heath Saraceno (guitar/vocals). Taking advantage of the fertile New Jersey punk scene to develop a unique sound that combined elements of emo and hardcore, Midtown began recording shortly after their formation. Their debut EP, Sacrifice of Life, was issued by Pinball Records in 1999. Their first full-length, Save the World, Lose the Girl, was released in early 2000 by their friends at Drive-Thru Records and was soon picked up for distribution by MCA. Midtown spent five months starting in the fall of 2001 recording their follow-up album; Living Well Is the Best Revenge appeared in April 2002.\n\n  Nonstop touring followed, including a headlining tour throughout the U.S., Japan, and U.K. Midtown played a slew of European dates with the likeminded Jimmy Eat World as well. Back at home by January of 2003, tensions that had been growing between the band and Drive-Thru over feelings of unfair treatment came to a head. Unhappy throughout the drama, Midtown finally managed to extricate themselves from their contract with the label. Down but definitely not out, the guys got together with producer Butch Walker to record the songs that would become their next album, the moodier Forget What You Know, in November. After the band shopped it around to various labels, the record was picked up by Columbia and released in June 2004.","torrent":{"xt":"urn:btih:ca045ffca28053dd1970a256071bb102fd36b5da","amp;dn":"Midtown+-+Discography+%281999-2004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca045ffca28053dd1970a256071bb102fd36b5da","infoHashBuffer":{"type":"Buffer","data":[202,4,95,252,162,128,83,221,25,112,162,86,7,27,177,2,253,54,181,218]},"announce":[],"urlList":[]}}