{"title":"Advanced Origami: More than 60 Fascinating and Challenging","uid":8363774,"size":17934650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca48b062bad162e945bc71c8631746925cc17f3c&amp;dn=Advanced+Origami%3A+More+than+60+Fascinating+and+Challenging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365709280,"description":" Didier Boursin, &quot;Advanced Origami: More than 60 Fascinating and Challenging Projects for the Serious Folder&quot;\nFirefly Books | 2000 | ISBN: 1552095274 | 144 pages | PDF | 363 MB\n\nOriginal designs by origami artists from Europe and Japan.\n\nOrigami is an ancient art, yet modern paper folders continue to innovate and invent new and fascinating folds. The origami projects in this book are some of the best ever created and range from practical projects for everyday use to intricate art rooted in ceremony and tradition.\n\nAdvanced Origami features 60 designs using exotic folds not typically seen in North American origami. Each project is fully illustrated with line drawings and the finished piece is showcased in color photography. An introductory section explains basic folding techniques and terminology followed by five sections: - Boxes and containers - Animals - Cards, envelopes and wallets - Magic folds - Airplanes and helicopters.\n\nAdvanced Origami is an exceptional collection to challenge paper folders at all levels. Boursin excels in designing new folds and in finding the best new origami from around the world -- practical, durable objects of beauty to hone the talents of fans of this ancient art.","torrent":{"xt":"urn:btih:ca48b062bad162e945bc71c8631746925cc17f3c","amp;dn":"Advanced+Origami%3A+More+than+60+Fascinating+and+Challenging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca48b062bad162e945bc71c8631746925cc17f3c","infoHashBuffer":{"type":"Buffer","data":[202,72,176,98,186,209,98,233,69,188,113,200,99,23,70,146,92,193,127,60]},"announce":[],"urlList":[]}}