{"title":"Raging Bull Dvdrip H264 Bookerdog.mp4","uid":4997121,"size":978170345,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:caad88d2c8556e5e16af03a7afcf0372afc09209&amp;dn=Raging+Bull+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookerdog","files":-1,"time":1247338439,"description":"Category\tBlu-ray, Alternative-Lifestyle, Dramas, Recommended, Classic, Biography, Essential Cinema, True Story, Rags To Riches, AFI Top 100 Thrills, AFI Top 100 (1997), AFI Top 100, Classic Fight Scenes\nStarring\tRobert De Niro, Joe Pesci, Frank Vincent, Cathy Moriarty, Nicholas Colasanto, Frank Adonis, resa Saldana\nDirector\tMartin Scorsese\nCostume Designer\tRichard Bruno\nDirector of Photography\tMichael Chapman\nEditor\tlma Schoonmaker\nProducer\tIrwin Winkler, Robert Chartoff\nProduction Designer\tGene Rudolf\nScreenwriter\tPaul Schrader, Mardik Martin\nStory\tPeter Savage, Joseph Carter, Jake La Motta\nMartin Scorsese's Oscar-winning 1980 film stars Robert DeNiro as a boxer whose violence erupts in and out of the ring. Bonuses: commentaries, documentaries, featurettes, newsreel footage.\nConsidered by many critics to be the best film of the 1980s, this gritty docudrama about hardheaded prizefighter Jake La Motta is so astonishingly real it seems like the champ's black-and-white home-movie reels have been spliced together. Robert De Niro's Oscar-winning performance is intense and awe inspiring, and Martin Scorsese uses his regular bag of camera tricks to add to the proceedings. The film features a stellar supporting turn by Joe Pesci as La Motta's brother, Joey.\n\nWith RAGING BULL, Martin Scorsese's personal approach to filmmaking is taken to a whole new level. Shooting in a crisp black and white, Scorsese tells the story of middleweight boxer Jake La Motta, played with incredible intensity by Oscar winner Robert De Niro. As La Motta rises through the ranks to earn his first shot at the middleweight crown, he falls in love with Vickie (Cathy Moriarty), a gorgeous girl from his Bronx neighborhood. Jake's inability to express his feelings pours out in the ring and eventually takes over his life in his dealings with his brother, Joey (a brilliant Joe Pesci). Irrational jealousy over Vickie, as well as an insatiable appetite, sends him into a downward spiral that costs him his title, his wife, and his relationship with Joey. As the out-of-control fighter, De Niro delivers one of the screen's most unforgettable performances. Pesci is just as intense as Joey, who finally realizes that he is unable to tame his animalistic brother. Cinematographer Michael Chapman shoots the film with a stylish flair that fills the boxing scenes with boundless energy and adds immediacy to the arguments that erupt whenever Jake is outside the ring. Simply put, RAGING BULL is one of American cinema's masterworks.","torrent":{"xt":"urn:btih:caad88d2c8556e5e16af03a7afcf0372afc09209","amp;dn":"Raging+Bull+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caad88d2c8556e5e16af03a7afcf0372afc09209","infoHashBuffer":{"type":"Buffer","data":[202,173,136,210,200,85,110,94,22,175,3,167,175,207,3,114,175,192,146,9]},"announce":[],"urlList":[]}}