{"title":"La storia in giallo 001 - Joe Petrosino [Mp3 Ita] [TNTvillage]","uid":6247677,"size":24858076,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cb5a44dee080ee7dd2446442fbbfe63c0f166bf3&amp;dn=La+storia+in+giallo+001+-+Joe+Petrosino+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1300288539,"description":"La storia in giallo 001 - Joe Petrosino [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalita' borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\n\nLa storia in giallo - in onda il 07/04/2002\n\nJoe Petrosino\n\n\nLa sera del 12 marzo 1909, a Piazza Marina, Palermo, viene ucciso il poliziotto italo-americano Joe Petrosino, giunto in Sicilia per colpire alle radici l'organizzazione criminale della Mano Nera. ÃƒË† il primo grande delitto di mafia. Petrosino ÃƒÂ¨ giÃƒÂ , per il suo coraggio e la sua durezza, una figura mitica. Presto diventerÃƒÂ  un personaggio dei fumetti e negli anni '70, il regista Daniele D'Anza ne farÃƒÂ  un film di culto per la TV.\nLa versione radiofonica vede protagonista Enrico Lo Verso, giunto al successo con &quot;Il ladro di bambini&quot;, l'attore siciliano ÃƒÂ¨ al suo debutto radiofonico. Accanto a lui le voci di Paolo Ferrari, Cesare Barbetti, Ivo Garrani.\nNel dibattito che segue la ricostruzione sceneggiata, l'autrice Antonella Ferrera intervista Roberto Alajmo, esperto di antimafia, e Roberto Olla, autore di documentari storici.\n\n\nAVI File Details\n========================================\nName..........: La storia in giallo 001 - 07 04 2002 - Joe Petrosino.mp3\nFilesize......: 23Mb\n\nAudio Bitrate.: 92Kbps(VBR)\nAudio Freq....: 44KHz\nAudio Channels: Stereo \n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:cb5a44dee080ee7dd2446442fbbfe63c0f166bf3","amp;dn":"La+storia+in+giallo+001+-+Joe+Petrosino+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb5a44dee080ee7dd2446442fbbfe63c0f166bf3","infoHashBuffer":{"type":"Buffer","data":[203,90,68,222,224,128,238,125,210,68,100,66,251,191,230,60,15,22,107,243]},"announce":[],"urlList":[]}}