{"title":"HISTORY OF POP AND ROCK MUSIC - part 580","uid":11756795,"size":762579310,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cbcd25c7926a744e36b356cdbe1433787dfafad0&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+580&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":11,"time":1426417209,"description":"\n                      PART  580\n\n\n\n       2 Tone (or Two Tone) is a music genre created in England in the late 1970s by fusing elements of  punk rock, ska,  rocksteady, reggae and New Wave. Within the history of ska, 2 Tone is classified as its second wave, and is the precursor of the third wave ska scene of the 1980s and 1990s. Bands considered part of the genre include: The Specials, The Selecter, The Beat, Madness, Bad Manners, and The Bodysnatchers\n\n\n\n          THE SPECIALS  -  A Message to You, Rudy  (1979)\n          THE SPECIALS  -  Gangsters  (1979)\n          THE SPECIALS  -  Rat Race  (1980) \n          THE SPECIALS  -  Ghost Town  (1981)\n \n\n\n\n      &quot;A Message to You, Rudy&quot; is a 1967 rocksteady song by Dandy Livingstone. The song, originally entitled &quot;Rudy, A Message to You&quot; later achieved broader success when, in 1979, The Specials cover reached number 10 in the UK Singles Chart. Veteran trombone player Rico Rodriguez played on both Livingstone's and The Specials' versions.\n\n      &quot; Rat Race&quot; is a  song written and performed by he Specials,, released as a single in May 1980 and included in the album &quot;More Specials &quot; of the same year.On the charts, the album hit the Top Five in the UK, where &quot;Rat Race&quot;, &quot;Stereotype&quot; and &quot;Do Nothing&quot; hit the Top Ten. &quot;Rat Race&quot; hit #89 on Billboard Music Chart's (US) Club Play Singles chart, while the album as a whole hit #98 on Billboards Pop Albums chart.\n\n      &quot;Ghost Town&quot; is a 1981 song by the British 2 Tone band The Specials. The song spent three weeks at number one and 10 weeks in total in the top 40 of the UK Singles Chart. Addressing themes of urban decay, deindustrialisation, unemployment and violence in inner cities, the song is remembered for being a hit at the same time as riots were occurring in British cities. Internal tensions within the band were also coming to a head when the single was being recorded, resulting in the song being the last single recorded by the original seven members of the group before splitting up. However, the song was hailed by the contemporary UK music press as a major piece of popular social commentary, and all three of the major UK music magazines of the time awarded &quot;Ghost Town&quot; the accolade of &quot;Single of the Year&quot; for 1981","torrent":{"xt":"urn:btih:cbcd25c7926a744e36b356cdbe1433787dfafad0","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+580","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbcd25c7926a744e36b356cdbe1433787dfafad0","infoHashBuffer":{"type":"Buffer","data":[203,205,37,199,146,106,116,78,54,179,86,205,190,20,51,120,125,250,250,208]},"announce":[],"urlList":[]}}