{"title":"Child Bride [1938] Harry J Reiver","uid":5728507,"size":270246636,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cddbf70a6c359accd65b3d1a4edee8f34b368144&amp;dn=Child+Bride+%5B1938%5D+Harry+J+Reiver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":4,"time":1280555673,"description":" &lt;a href=&quot;http://bayimg.com/GAocCaACA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GAocCaACA&lt;/a&gt;\n\nChild Bride (1938) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0029989/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0029989/&lt;/a&gt;\n\nChild Bride, also known as Child Bride of the Ozarks, Child Brides (USA reissue title) and Dust to Dust (USA reissue title), is a 1938 film directed by Harry Revier. Set in a remote town in the Ozarks, it claims to be an attempt to draw attention to the lack of laws banning child marriage in many states. The film is very controversial both for its theme, and for showing twelve-year-old actress Shirley Mills nude during an infamous skinny dipping scene. Although the Hays Code prohibited onscreen nudity, the movie got around this by being produced and distributed independent of the studio system, and by claiming to be educational. Although it was banned in many areas, the movie's controversial nature gave it a certain infamy and it played on the so-called exploitation circuit for many years.\n\n Shirley Mills ...  Jennie \n Bob Bollinger ...  Freddie \n Warner Richmond ...  Jake Bolby \n Diana Durrell ...  Miss Carol \n Dorothy Carrol ...  Ma Colton \n George Humphreys ...  Ira Colton \n Frank Martin ...  Charles \n George Morrell ...  Mike Nulty (as Rex Baxter) \n Angelo Rossitto ...  Angelo (as Don Barrett) \n Al Bannon ...  Happy \n\nShirley Mills as Jennie Colton: This was Mills's first movie role. She went on to appear in many films over the next decade, mostly in supporting roles. \n\nBob Bollinger as Freddie Nulty: This was Bollinger's only film role. According to Mills's website, the two young actors became friends, and Bollinger later asked her to marry him, which she declined. \n\nAngelo Rossitto as Angelo the dwarf: Rossitto has a long career in movies, strectching from the 1920s to the 1990s. He is perhaps best known for his role as Master in Mad Max: Beyond Thunderdome. \n\nWarner Richmond as Jake Bolby: Along with Mills and Rossitto, Richmond was one of the few actors involved in this film who had any sort of film career. He appeared in films between 1912 and 1946, including the Gene Autry serial The Phantom Empire.\n\nThis was one of Revier's final films. He had previously made a series of low-budget, independent movies including The Lost City series and Lash of the Penitentes.\n\nThe film was produced by Kroger Babb. This was Babb's first film. He went on to produce other films, including the infamous exploitation film Mom and Dad.\n\nAccording to an interview with Michael J. Nelson and Kevin Murphy of Mystery Science Theater 3000 fame, this movie was screened for the show, but it was considered too awful and disturbing by the crew","torrent":{"xt":"urn:btih:cddbf70a6c359accd65b3d1a4edee8f34b368144","amp;dn":"Child+Bride+%5B1938%5D+Harry+J+Reiver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cddbf70a6c359accd65b3d1a4edee8f34b368144","infoHashBuffer":{"type":"Buffer","data":[205,219,247,10,108,53,154,204,214,91,61,26,78,222,232,243,75,54,129,68]},"announce":[],"urlList":[]}}