{"title":"[Grim Fandango]","uid":8414975,"size":1080955861,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cea39c1da20ddacb367d02417a5f9ce93d9a462f&amp;dn=%5BGrim+Fandango%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"[The-B1ight3r]","files":-1,"time":1367010107,"description":"[The-B1ight3r]:~Instant Play~\n\nSynopsis/Precis:\n\nGrim Fandango takes place in the Land of the Dead, where recently departed souls aim to make their way to the Ninth Underworld. Good deeds in life are rewarded by access to better travel packages to assist in making the journey of the soul. The best of which is the Number Nine; a train that takes four minutes to reach the gate to the Ninth Underworld. Souls who did not fulfil a kind life are left to travel through the Land of the Dead on foot, which would take around four years. Such souls often lose faith in the existence of the Ninth Underworld and instead find jobs in the Land of the Dead. The travel agents of the Department of Death act as the Grim Reaper to escort the souls from the mortal world to the Land of the Dead, and then determine which mode of transport the soul has merited. Each year on the Day of the Dead, the souls are allowed to visit their families in the Land of the Living.\nThe souls in the Land of the Dead appear as skeletal calaca figures. Alongside them are demons that have been summoned to help with the more mundane tasks of day-to-day life, such as vehicle maintenance. The souls themselves can suffer death-within-death by being &quot;sprouted,&quot; the result of being shot with &quot;sproutella&quot;-filled darts that cause flowers to grow out through the bones. Many of the characters are Mexican and occasional Spanish words are interspersed into the English dialog, resulting in Spanglish. Many of the characters smoke, following a film noir tradition; the manual asks players to consider that every smoker in the game is dead.\n\nImportant Notes:\n\n-The ISO file Is Password Protected\n-The password is the same as the file name, excluding the .iso extension\n-Copy and paste the name of the game in the little dialog box\n-Either mount using an image processor program onto a virtual drive or extract to    any desired location that you prefer.\n-Open the game folder and search for the executive button to play instantly!!!!\n-Injoy quality rips only from [The-B1ight3r]","torrent":{"xt":"urn:btih:cea39c1da20ddacb367d02417a5f9ce93d9a462f","amp;dn":"%5BGrim+Fandango%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea39c1da20ddacb367d02417a5f9ce93d9a462f","infoHashBuffer":{"type":"Buffer","data":[206,163,156,29,162,13,218,203,54,125,2,65,122,95,156,233,61,154,70,47]},"announce":[],"urlList":[]}}