{"title":"Inspired Sprinter","uid":8740353,"size":360577552,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cec6b1a1cf93b9815142157c1a23132c3ccb362f&amp;dn=Inspired+Sprinter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iamarto","files":-1,"time":1374768172,"description":"Simply put, there are 2 folders, one named SPRINT, the other RELAX. The music inside these folders is a compilation of my own favorites during the years. This is the list of my mp3 player that I use for short bursts of sprints as a sport.\n\nIn the SPRINT folder you will find a lot of inspirational, and encouraging soundtracks and songs, and in each of them there will be a certain time that you will feel compelled to run infinitely non-stop. No one in the world can stop you, sprint like a fire, and imagine that Time and the Environment is bending to your will. Imagine that you are the Sun and Sprint, imagine that running you are changing people's lives, because you are changing yours.\n\nYou can start by listening to Audiomachine - Reaching. Observe your emotions, what does this music tell you about yourself? It tells you that you are great, but you are not your maximum yet. Listen. Recharge. Sprint when you are ready.\n\nOnce you are tired, run a song/music from the relax folder. Then again, Recharge, Listen, Sprint. \n\nThe mp3s are normalized for your convenience. I'd appreciate it if you tell me your opinion about the compilation, I'm full open to your suggestions. Thank you.","torrent":{"xt":"urn:btih:cec6b1a1cf93b9815142157c1a23132c3ccb362f","amp;dn":"Inspired+Sprinter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cec6b1a1cf93b9815142157c1a23132c3ccb362f","infoHashBuffer":{"type":"Buffer","data":[206,198,177,161,207,147,185,129,81,66,21,124,26,35,19,44,60,203,54,47]},"announce":[],"urlList":[]}}