{"title":"FRONT_MISSION4.iso","uid":4321024,"size":2023227392,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:cf46cebe5654fb10f72765e42705c76758571486&amp;dn=FRONT_MISSION4.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Chimera2005","files":1,"time":1217462432,"description":"Release: 06/15/08\nGenre; Tactical RPG\n\nFront Mission 4 has two major scenarios that run parallel to each other, set in the year 2096. One scenario takes place in the European Commonwealth (E.C.) and the other scenario takes place in the United Continental States (U.C.S.). U.C.S. is the North American translation for the United States of the New Continent (U.S.N.), though the reasons for the change are unknown. In the North American translation for Front Mission 3, U.S.N. is left unchanged. A large portion of the between-mission dialogue is delivered through voice overs in English (for all regional versions of the game), which is a first for the series.\n\nAt the beginning of the game, the player assumes the role of Elsa Eliane, a new recruit for the EC Armored Tactics Research Corps, the &quot;Durandal&quot;. The Durandal&amp;#039;s initial assignment is to investigate a series of recent attacks on E.C. German military bases by unknown forces. After completing several missions with the Durandal and learning more about the causes of the attacks, the narrative shifts focus to the other scenario. The second scenario starts off in U.C.S. Venezuela (which has attempted to secede from the U.C.S.) and centers around Darril Traubel, a U.C.S. Sergeant, and his teammates Billy Renges and Phillip Chaeffer. The three witness the crash of a Venezuelan State Army (VSA) transport plane that turns out to be carrying gold bullion worth up to $25 million belonging to Venezuelan Governor Bruno Diaz. They decide to steal the gold and go AWOL, but it is not long before they are found out by the VSA and have to escape Venezuela.\n\nAfter a few more missions detailing their attempts to escape, the narrative returns focus to Elsa and the Durandal. For the rest of the game, the narrative continues to shift back and forth between the two scenarios after a certain amount of missions are completed. Eventually, a plot connection is established between the scenarios, though they remain independent of one other for the entire game. In both scenarios, the Republic of Zaftra is discovered to be source of their issues. Front Mission 4 expands on the unresolved plot elements regarding Zaftra that were revealed at the end of Front Mission 1st, detailing the real reasons behind Zaftra&amp;#039;s involvement in both installments. Two characters from Front Mission 1st also make appearances in Front Mission 4: Frederick Lancaster from the O.C.U. side and Maria Paredes from the U.C.S. side. Several minor loose ends are resolved in Front Mission 5: Scars of the War, though all of the major plot elements are resolved in Front Mission 4.","torrent":{"xt":"urn:btih:cf46cebe5654fb10f72765e42705c76758571486","amp;dn":"FRONT_MISSION4.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf46cebe5654fb10f72765e42705c76758571486","infoHashBuffer":{"type":"Buffer","data":[207,70,206,190,86,84,251,16,247,39,101,228,39,5,199,103,88,87,20,134]},"announce":[],"urlList":[]}}