{"title":"Photoshop CS Killer Tips-Manhide","uid":6993406,"size":13883181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d03bcc00d63343160977fecdf8db594258edcfb9&amp;dn=Photoshop+CS+Killer+Tips-Manhide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manhide","files":-1,"time":1327781441,"description":"why a book of nothing but tips? Because that's where all the really slick, really useful, and really fun stuff is. It's true! If we're looking through a book and we see the word &quot;Tip&quot; we're all immediately drawn to it, because we know we're about to learn something great. Maybe it's an undocumented keyboard shortcut, a hidden inside secret, or just a faster, better way to do something we do every day. The only problem with the tips in these books is, there's never enough of 'em. That is, until now.\nThat's because this book is packed cover-to-cover, wall-to-wall with nothing but those cool Photoshop CS sidebar tips. Every tip is designed to make you work faster, smarter, and have more fun using Photoshop CS. There's no detailed descriptions of CYMK separation set-ups, or long boring discussions on color management theory--it's just tips--short, sweet, and to the point.\n\nBut we've done the &quot;tip&quot; idea one better, because every tip has a full-color graphic to make the tips even more accessible, even more fun, and even easier to use. Most importantly, to get in this book they've got to be &quot;Killer Tips&quot; The kind of tip that makes you smile, nod, and then call all your friends and &quot;tune them up&quot; with your new status as Photoshop guru.\n\nIf you've wondered how the pros get twice the work done in half the time, it's because they know all the tips, all the tricks, and now with this book--so will you.","torrent":{"xt":"urn:btih:d03bcc00d63343160977fecdf8db594258edcfb9","amp;dn":"Photoshop+CS+Killer+Tips-Manhide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03bcc00d63343160977fecdf8db594258edcfb9","infoHashBuffer":{"type":"Buffer","data":[208,59,204,0,214,51,67,22,9,119,254,205,248,219,89,66,88,237,207,185]},"announce":[],"urlList":[]}}