{"title":"AoA Audio_Extractor Platinum v2.2.9 plus keymaker","uid":6431488,"size":7971209,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d0589774dc8c79fe6c6544112792daa865cdab0b&amp;dn=AoA+Audio_Extractor+Platinum+v2.2.9+plus+keymaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"malric","files":2,"time":1306667317,"description":"An affordable all-in-one digital audio application that bundles the tools you're most likely to need the most often. It incorporates an audio extractor; a converter that handles not only common file types like MP3, WAV, AVI, and WMV, but also less common types like OGG and iPhone Ringtone; a sound recorder; a voice changer; and even karaoke.\n\nAudio Extractor: Extract audio tracks from AVI, MPEG, MPG, FLV (Flash Video), Youtube, DAT, WMV, MOV, MP4, 3GP video files and save them as MP3, WAV, iPhone Ringtone, WMA and AC3 formats.\n\nIt can also be used to save any portion of the audio of a video file.\n\nAudio Conversion: Convert audio files between different formats, such as MP3, WMA, WAV, M4A, iPhone Ringtone, OGG and AC3.\n\nSound Recording (Capture Audio): Record your voice or any sound from microphone, CD/DVD player and any other input line available with your sound card. Save sound recordings directly to MP3, WAV.\n\nVoice Changer: Change your voice in real time by dragging the slider.\n\nKaraoke Song Recording You can select a popular song (WAV,MP3) and sing along with the song. AoA Audio Extractor Platinum records your voice while singing, process your voice with real time voice effects.","torrent":{"xt":"urn:btih:d0589774dc8c79fe6c6544112792daa865cdab0b","amp;dn":"AoA+Audio_Extractor+Platinum+v2.2.9+plus+keymaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0589774dc8c79fe6c6544112792daa865cdab0b","infoHashBuffer":{"type":"Buffer","data":[208,88,151,116,220,140,121,254,108,101,68,17,39,146,218,168,101,205,171,11]},"announce":[],"urlList":[]}}