{"title":"David Stone Basic Coin Magic","uid":8303611,"size":9215213568,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d0d4d7241c3c5aa3e9ca49a0d330f417a4c049ba&amp;dn=David+Stone+Basic+Coin+Magic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lethal111","files":2,"time":1364320021,"description":"A complete course for beginners, amateurs and professionals. Nine full routines you can use in real-world and professional conditions. More than 15 basic techniques!Multiple Awards winner ( Diavol Award 1995, Gold Dove Award 1996...), the french magician David STONE performs nine routines in this dvd. All the routines are explained in step by step detail, along with closely guarded moves still used by the world's greatest coin magicians ! \n\nMastering Coin Magic is difficult : Attention must be paid to technique, timing, rhythm, body language....In this one hour long video, 15 moves and techniques are explained and performed in short routines that you can use in the real-world.. Each routine is detailed in a progressive explanation : First, you see the routine, then you learn the techniques used. You finish by a full explanation of the routine. \n\nDavid offers more than just explanations, he provides you with a full progressive course on Coin Magic. Presentation has not been overlooked. \n\nMost of the routines explained in the tape are original : Old effects have been refreshed and performed in a new way. \n\nProfessionally produced with multiple camera angles. Don't miss the tool that will change the way you look at Coin Magic !","torrent":{"xt":"urn:btih:d0d4d7241c3c5aa3e9ca49a0d330f417a4c049ba","amp;dn":"David+Stone+Basic+Coin+Magic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d4d7241c3c5aa3e9ca49a0d330f417a4c049ba","infoHashBuffer":{"type":"Buffer","data":[208,212,215,36,28,60,90,163,233,202,73,160,211,48,244,23,164,192,73,186]},"announce":[],"urlList":[]}}