{"title":"(DivX-HD ITA) Segui il tuo cuore - Charlie S. Cloud (BR-RIP)","uid":6444284,"size":2328795606,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0e639e80957694025dcfb5256a2d511d342831e&amp;dn=%28DivX-HD+ITA%29+Segui+il+tuo+cuore+-+Charlie+S.+Cloud+%28BR-RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1307083694,"description":"(DivX-HD ITA) Segui il tuo cuore - Charlie S. Cloud (BR-RIP)\nAudio: Italiano &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1438254/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1438254/&lt;/a&gt; &lt;a href=&quot;\nhttp://filmup.leonardo.it/sc_charliestcloud.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://filmup.leonardo.it/sc_charliestcloud.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/daibmaadh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/daibmaadh.jpg&lt;/a&gt;\n\nSegui il tuo cuore\n\nTitolo originale:  Charlie St. Cloud \nNazione:  U.S.A. \nAnno:  2010 \nGenere:  Drammatico \nDurata:  99' \nRegia:  Burr Steers \nSito ufficiale:  www.charliestcloud.com \nSito italiano:  www.cinema.universalpictures.it/website/seguiiltuocuore \nSocial network:  facebook \n\n \nCast:  Zac Efron, Amanda Crew, Ray Liotta, Kim Basinger, Chris Massoglia, Dave Franco, Donal Logue, Charlie Tahan, Tegan Moss, Augustus Prew, Brenna O'Brien, Julia Maxwell, Matt Ward \nProduzione:  Marc Platt Productions \nDistribuzione:  Universal Pictures Italia \nData di uscita:  21 Gennaio 2011 (cinema) \n\nTrama:\nIl velista, neo diplomato, Charlie St. Cloud (Efron) vive circondato dall'amore della madre Claire (Kim Basinger) e del fratellino Sam (l'esordiente Charlie Tahan). Ha una borsa di studio della Stanford University che lo condurrÃƒÂ  lontano dall'assonnata cittadina natale della regione nordoccidentale del pacifico. Il suo brillante futuro, perÃƒÂ², viene stroncato da un'immane tragedia che condizionerÃƒÂ  e cancellerÃƒÂ  i sogni di un'intera vita.\nI due fratelli sono vittime di un incidente stradale e sanno che il momento fatale sta per arrivare. Charlie fa a Sam la solenne promessa di non abbandonarlo ma il repentino intervento di un coscienzioso paramedico Florio Ferrente (Ray Liotta) gli salva la vita; drammaticamente perÃƒÂ², quella di Sam non puÃƒÂ² essere salvata.\nCharlie ÃƒÂ¨ inconsolabile. Ai funerali del fratello, fugge dal luogo della sepoltura e si inoltra nella foresta alle spalle del cimitero, dove, al tramonto, s'imbatte in una piccola radura. Qui, sente in lontananza il riecheggiare dei cannoni del tramonto. Stordito, alza lo sguardo e resta stupito nel vedere Sam, con il guanto da baseball in mano, che lo aspetta per iniziare il consueto allenamento serale di baseball.\nSono passati cinque anni e la vita di Charlie ha preso una strada molto diversa da come se l'era sognata. Ora, lavora come guardiano del Seaside Cemetery, il cimitero in cui riposa il piccolo Sam, e la sua barca ÃƒÂ¨ custodita da qualche parte tra cumuli di altre imbarcazioni. Ha lasciato il college e si ÃƒÂ¨ allontanato dagli amici e dalla famiglia. Ogni sera, all'imbrunire, quando i cannoni iniziano a suonare, torna nella radura a giocare a baseball con Sam, la cui presenza svanisce puntualmente al calar di ogni giorno. Sam lo sprona a pensare alla sua vita ma Charlie ÃƒÂ¨ determinato ad onorare la solenne promessa.\nUn giorno, la vecchia compagna di liceo Tess (Amanda Crew) torna inaspettatamente in cittÃƒÂ . Charlie ÃƒÂ¨ diviso tra il desiderio di onorare la promessa fatta anni prima al fratello e andare avanti con la sua vita al fianco dell'amore ritrovato...\n\n","torrent":{"xt":"urn:btih:d0e639e80957694025dcfb5256a2d511d342831e","amp;dn":"%28DivX-HD+ITA%29+Segui+il+tuo+cuore+-+Charlie+S.+Cloud+%28BR-RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e639e80957694025dcfb5256a2d511d342831e","infoHashBuffer":{"type":"Buffer","data":[208,230,57,232,9,87,105,64,37,220,251,82,86,162,213,17,211,66,131,30]},"announce":[],"urlList":[]}}