{"title":"Culture Cumbolo","uid":7028478,"size":327768108,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0fabbc4a8022732f0f76678792ad86ec14b2889&amp;dn=Culture+Cumbolo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akasyliphone","files":-1,"time":1329151069,"description":"As roots reggae harmony groups go, Culture has always been a bit unique. Wholly dominated by the mystical and strangely charismatic lead singer and songwriter Joseph Hill, Culture has always dealt in simple (some would say simplistic) and yet absurdly catchy melodies, astringent harmonies and lyrics of the very dreadest character -- very few love songs, very few party songs, just lots and lots of dire warnings issued to Babylon and its fellow travellers. Although the band is most commonly praised for its work with producer Joe Gibbs (most notably the stone classic Two Sevens Clash album), many the tracks Culture recorded under the supervision of Sonia Pottinger are every bit as good, and Cumbolo includes ten of the best of those. Just about every song here counts as a highlight, but &quot;Natty Never Get Weary,&quot; &quot;Poor Jah People,&quot; and a charming adaptation of &quot;This Train&quot; are all particularly good. And the backup is provided by a shifting contingent of Jamaica's studio aristocracy that includes Sly &amp; Robbie, Ansel Collins, and &quot;Deadly&quot; Headley Bennett, among other luminaries. Highly recommended. \n\n\nEAC log, cue, m3u &amp; images","torrent":{"xt":"urn:btih:d0fabbc4a8022732f0f76678792ad86ec14b2889","amp;dn":"Culture+Cumbolo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0fabbc4a8022732f0f76678792ad86ec14b2889","infoHashBuffer":{"type":"Buffer","data":[208,250,187,196,168,2,39,50,240,247,102,120,121,42,216,110,193,75,40,137]},"announce":[],"urlList":[]}}