{"title":"The Quintessential Billie Holiday - Vol1-9 (1933-42) [FLAC img +","uid":5390080,"size":1399771756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2e326455fbb6e3eb7fca43fa6133b622c7d519c&amp;dn=The+Quintessential+Billie+Holiday+-+Vol1-9+%281933-42%29+%5BFLAC+img+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ill88eagle","files":-1,"time":1267035598,"description":"The Quintessential Billie Holiday Vol. 1-9\nFLAC img + CUE\n\nThe Quintessential Billie Holdiay, Vols. 1-9 is a terrific multi-volume series that chronicles all of Holiday's master takes for Columbia Records between 1933 and 1942.\nThe set is available as nine separate discs, all of which are essential for true Holiday fans.\nNeophytes who are slightly intimidated by the size of this series should look to Volume 2 as a starting point.\n\n\n\nThe Quintessential Billie Holiday, Vol.1: 1933-1935\n\nAfter years of reissuing Billie Holiday's recordings in piecemeal fashion,\nColumbia finally got it right with this nine-CD Quintessential series.\nAll of Lady Day's 1933-1942 studio recordings (although without the alternate takes) receive the treatment they deserve in this program.\nVol. 1 has Holiday's first two tentative performances from 1933 along with her initial recordings with Teddy Wilson's all-star bands.\nHigh points include &quot;I Wished on the Moon,&quot; &quot;What a Little Moonlight Can Do,&quot;\n&quot;Miss Brown to You,&quot; and &quot;Twenty-Four Hours a Day.&quot;\n\n1. Your Mother's Son-In-Law\n2. Riffin' The Scotch\n3. I Wished On The Moon\n4. What A Little Moonlight Can Do\n5. Miss Brown To You\n6. A Sunbonnet Blue\n7. What A Night, What A Moon, What A Girl\n8. I'm Painting The Town Red\n9. It's Too Hot For Words\n10. Twenty-Four Hours A Day\n11. Yankee Doodle Never Went To Town\n12. Eeny Meeny Miney Mo\n13. If You Were Mine\n14. These 'N' That 'N' Those\n15. You Let Me Down\n16. Spreadin' Rhythm Around\n\n\nThe Quintessential Billie Holiday, Vol.2: 1936\n\nThe second of nine volumes in this essential series continues the complete reissue of Billie Holiday's early recordings (although the alternate takes are bypassed).\nThis set is highlighted by &quot;I Cried for You&quot; (which has a classic alto solo from Johnny Hodges), &quot;Billie's Blues&quot; (from Holiday's first session as a leader), &quot;A Fine Romance,&quot; and &quot;Easy to Love&quot;.\nHoliday's backup crew includes such greats as pianist Teddy Wilson, baritonist Harry Carney, trumpeters Jonah Jones and Bunny Berigan, and clarinetist Artie Shaw. There's lots of great small-group swing.\n\n1. Life Begins When You're In Love - Billie Holiday\n2. It's Like Reaching For The Moon - Billie Holiday\n3. These Foolish Things - Billie Holiday\n4. I Cried For You - Billie Holiday\n5. Guess Who - Billie Holiday\n6. Did I Remember? - Billie Holiday And Her Orchestra\n7. No Regrets - Billie Holiday And Her Orchestra\n8. Summertime - Billie Holiday And Her Orchestra\n9. Billie's Blues - Billie Holiday And Her Orchestra\n10. A Fine Romance - Billie Holiday And Her Orchestra\n11. I Can't Pretend - Billie Holiday And Her Orchestra\n12. One, Two, Button Your Shoe - Billie Holiday And Her Orchestra\n13. Let's Call A Heart A Heart - Billie Holiday And Her Orchestra\n14. Easy To Love - Billie Holiday And Her Orchestra\n15. With Thee I Swing - Billie Holiday And Her Orchestra\n16. The Way You Look Tonight - Billie Holiday And Her Orchestra\n\n\nThe Quintessential Billie Holiday, Vol.3: 1936-1937\n\nThe third of nine CDs that document all of Billie Holiday's studio recordings of 1933-1942 for Columbia has classic versions of &quot;Pennies From Heaven,&quot; &quot;I Can't Give You Anything but Love&quot; (on which she shows the influence of Louis Armstrong),\nand &quot;My Last Affair,&quot; along with Lady Day's first meeting on record with tenor saxophonist Lester Young.\nTheir initial encounter resulted in four songs, including &quot;This Year's Kisses&quot; and &quot;I Must Have That Man.&quot; \n\n1. Who Loves You?\n2. Pennies From Heaven\n3. That's Life I Guess\n4. I Can't Give You Anything But Love (Baby)\n5. One Never Knows-Does One?\n6. I've Got My Love To Keep Me Warm\n7. If My Heart Could Only Talk\n8. Please Keep Me In Your Dreams\n9. He Ain't Got Rhythm\n10. This Year's Kisses\n11. Why Was I Born\n12. I Must Have That Man\n13. The Mood That I'm In\n14. You Showed Me The Way\n15. Sentimental &amp; Melancholy\n16. My Last Affair\n\n\nThe Quintessential Billie Holiday, Vol.4: 1937\n\nThe fourth of nine CDs in this essential series of Billie Holiday's studio recordings of 1933-1942 features the great tenor Lester Young on eight of the 16 performances.\nPrez and Lady Day make a perfect match on &quot;I'll Get By&quot; (although altoist Johnny Hodges steals the honors on that song), &quot;Mean to Me,&quot; &quot;Easy Living,&quot; &quot;Me, Myself and I,&quot; and &quot;A Sailboat in the Moonlight.&quot;\nOther strong selections without Young include &quot;Moanin' Low,&quot; &quot;Let's Call the Whole Thing Off,&quot; and &quot;Where Is the Sun?&quot; \n\n1. Carelessly\n2. How Could You?\n3. Moanin' Low\n4. Where Is The Sun?\n5. Let's Call The Whole Thing Off\n6. They Can't Take That Away From Me\n7. I Don't Know If I'm Coming Or Going\n8. Sun Showers\n9. Yours And Mine\n10. I'll Get By\n11. Mean To Me\n12. Foolin' Myself\n13. Easy Living\n14. I'll Never Be The Same\n15. Me, Myself And I\n16. A Sailboat In The Moonlight\n\n\nThe Quintessential Billie Holiday, Vol.5: 1937-1938\n\nThe fifth of nine CDs in the complete reissue of Billie Holiday's early recordings (sans alternate takes), this great set has 18 selections, all but four featuring tenor saxophonist Lester Young and trumpeter Buck Clayton.\nAmong the classics are &quot;Getting Some Fun Out of Life,&quot; &quot;Trav'lin' All Alone,&quot; &quot;He's Funny That Way,&quot; &quot;My Man,&quot; &quot;When You're Smiling&quot; (on which Prez takes a perfect solo), &quot;If Dreams Come True,&quot; and &quot;Now They Call It Swing.&quot;\n\n1. Born To Love\n2. Without Your Love\n3. Getting Some Fun Out Of Life\n4. Who Wants Love?\n5. Trav'lin' All Alone\n6. He's Funny That Way\n7. Nice Work If You Can Get It\n8. Things Are Looking Up\n9. My Man\n10. Can't Help Lovin' Dat Man\n11. My First Impression Of You\n12. When You're Smiling\n13. I Can't Believe That You're In Love With Me\n14. If Dreams Come True\n15. Now They Call It Swing\n16. On The Sentimental Side\n17. Back In Your Own Backyard\n18. When A Woman Loves A Man\n\n\nThe Quintessential Billie Holiday, Vol.6: 1938\n\nThe sixth of nine CDs in this very worthy series traces Billie Holiday's recording career throughout much of 1938.\nAlthough not containing as many true classics as Vol. 5, most of these 18 selections are quite enjoyable, particularly &quot;You Go to My Head,&quot; &quot;Having Myself a Time,&quot; &quot;The Very Thought of You,&quot; and &quot;They Say.\n\n1. You Go To My Head - Billie Holiday &amp; Her Orchestra\n2. The Moon Looks Down And Laughs - Billie Holiday &amp; Her Orchestra\n3. If I Were You - Billie Holiday &amp; Her Orchestra\n4. Forget If You Can - Billie Holiday &amp; Her Orchestra\n5. Having Myself A Time - Billie Holiday &amp; Her Orchestra\n6. Says My Heart - Billie Holiday &amp; Her Orchestra\n7. I Wish I Had You - Billie Holiday &amp; Her Orchestra\n8. I'm Gonna Lock My Heart (And Throw Away The Key) - Billie Holiday &amp; Her Orchestra\n9. The Very Thought Of You - Billie Holiday &amp; Her Orchestra\n10. I Can't Get Started - Billie Holiday &amp; Her Orchestra\n11. I've Got A Date With A Dream - Billie Holiday &amp; Her Orchestra\n12. You Can't Be Mine (And Someone Else's Too) - Billie Holiday &amp; Her Orchestra\n13. Everybody's Laughing - Billie Holiday\n14. Here It Is Tomorrow Again - Billie Holiday\n15. Say It With A Kiss - Billie Holiday\n16. April In My Heart - Billie Holiday\n17. I'll Never Fail You - Billie Holiday\n18. They Say - Billie Holiday\n\n\nThe Quintessential Billie Holiday, Vol.7: 1938-1939\n\nBy 1939 when the bulk of these 17 selections were recorded, Billie Holiday was dominating her own recordings, allocating less space for her sidemen to solo.\nThis was not really a bad thing since Lady Day's voice was getting stronger each year.\nOn the seventh of nine CD volumes that reissue all of Holiday's 1933-42 Columbia recordings (other than the alternate takes which have been bypassed), Holiday sounds at her best on &quot;More than You Know, Sugar&quot; (featuring a superb Benny Carter alto solo), &quot;Long Gone Blues&quot; and &quot;Some Other Spring.&quot;\n\n\n1. You're So Desirable - Bille Holiday\n2. You're Gonna See Alot Of Me - Bille Holiday\n3. Hello, My Darling - Bille Holiday\n4. Let's Dream In The Moonlight - Bille Holiday\n5. That's All I Ask Of You - Bille Holiday\n6. Dream Of Life\n7. What Shall I Say?\n8. It's Easy To Blame The Weather\n9. More Than You Know\n10. Sugar (That Sugar Baby O' Mine)\n11. You're Too Lovely To Last\n12. Under A Blue Jungle Moon\n13. Everything Happens For The Best\n14. Why Did I Always Depend On You?\n15. Long Gone Blues\n16. Some Other Spring\n17. Our Love Is Different\n\nThe Quintessential Billie Holiday, Vol.8: 1939-1940\n\nThe eighth of nine volumes that feature all of the master takes from Billie Holiday's Columbia recordings of 1933-1942\nis one of the better sets, although all nine CDs are recommended. High points include &quot;Them There Eyes,&quot; &quot;Swing, Brother, Swing,&quot; &quot;The Man I Love,&quot; &quot;Ghost of Yesterday,&quot; &quot;Body and Soul,&quot; &quot;Falling in Love Again,&quot; and &quot;I Hear Music.&quot;\nAmong the variety of all-stars backing her, tenor saxophonist Lester Young makes his presence known on eight of the 18 numbers.\n\n1. Them There Eyes\n2. Swing, Brother, Swing\n3. Night And Day\n4. The Man I Love\n5. You're Just A No Account\n6. You're A Lucky Guy\n7. Ghost Of Yesterday\n8. Body And Soul\n9. What Is This Going To Get Us?\n10. Falling In Love Again (Can't Help It)\n11. I'm Pulling Through\n12. Tell Me More And More, And Then Some\n13. Laughing At Life\n14. Time On My Hands\n15. I'm All For You\n16. I Hear Music\n17. The Same Old Story\n18. Practice Makes Perfect\n\n\nThe Quintessential Billie Holiday, Vol. 9 (1940-1942)\n\nThe final volume in this nine-CD series contains all of Billie Holiday's recordings from her final 16 months with the label.\nHighlights include &quot;St. Louis Blues,&quot; &quot;Loveless Love,&quot; &quot;Let's Do It,&quot; &quot;All of Me&quot;\n(arguably the greatest version ever of this veteran standard), &quot;Am I Blue,&quot; &quot;Gloomy Sunday&quot; and &quot;God Bless the Child.&quot;\nAll 153 of Lady Day's Columbia recordings (even the occasional weak item) are well worth hearing and savoring.\n\n1. St. Louis Blues\n2. Loveless Love\n3. Let's Do It\n4. Georgia On My Mind\n5. Romance In The Dark\n6. All Of Me\n7. I'm In A Low-Down Groove\n8. God Bless The Child\n9. Am I Blue?\n10. Solitude\n11. Jim\n12. I Cover The Waterfront\n13. Love Me Or Leave Me\n14. Gloomy Sunday\n15. Wherever You Are\n16. Mandy Is Two\n17. It's A Sin To Tell A Lie\n18. Until The Real Thing Comes Along","torrent":{"xt":"urn:btih:d2e326455fbb6e3eb7fca43fa6133b622c7d519c","amp;dn":"The+Quintessential+Billie+Holiday+-+Vol1-9+%281933-42%29+%5BFLAC+img+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2e326455fbb6e3eb7fca43fa6133b622c7d519c","infoHashBuffer":{"type":"Buffer","data":[210,227,38,69,95,187,110,62,183,252,164,63,166,19,59,98,44,125,81,156]},"announce":[],"urlList":[]}}