{"title":"Dan Snow's Norman Walks - Part 1   (BBC 2010)","uid":6118398,"size":434621244,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3b9f728d03b54620196529ca542e31866c4c929&amp;dn=Dan+Snow%5C%27s+Norman+Walks+-+Part+1+++%28BBC+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucy1948","files":1,"time":1295653242,"description":"Historian Dan Snow puts his walking boots on and sets off to see what the great British landscape can teach us about our Norman predecessors. From their violent arrival on these shores, to their most sustaining legacies, Dan's three walks follow an evolutionary path through the Normans' era from invasion, to conquest, to successful rule and colonization.\n\n\n1) Sussex - The Invasion Walk\nThe exploration begins on the Sussex coastline, on the cliffs overlooking the Channel where William the Conqueror and his army first encountered British soil in the run-up to Hastings. But whilst the end result of William's invasion is in no doubt, how much do we really know about events leading up to the Battle?\n\n2) Herefordshire and Monmouthshire - The March of Wales\nChallenging topography and local chieftains made the Welsh borders an uncivilized region and Dan's walk around the Monnow river system is dominated by the motte and bailey castles that sprang up throughout the Norman era. These were the handiwork of barons who made their mark on the 'march' - a border zone from which the Normans pushed their influence west into Wales and Ireland.\n\n3) Yorkshire - The Northern Abbeys\nDan's final walk takes him north, to lands brutally devastated by the Normans four years after the Invasion. But the genocide of the Harrying of the North campaign was the final act that brought the whole of England under Norman control. The walk explores how the region became the setting for one of the Normans' greatest legacies - the abbeys and monasteries of northern England.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d3b9f728d03b54620196529ca542e31866c4c929","amp;dn":"Dan+Snow%5C%27s+Norman+Walks+-+Part+1+++%28BBC+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3b9f728d03b54620196529ca542e31866c4c929","infoHashBuffer":{"type":"Buffer","data":[211,185,247,40,208,59,84,98,1,150,82,156,165,66,227,24,102,196,201,41]},"announce":[],"urlList":[]}}