{"title":"[TVRip-ITA] Mai Dire GF [17-03-2009][CR-Bt]","uid":4779259,"size":312401920,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d430de64e90bb11f2e5948d459015c33ddf82ad5&amp;dn=%5BTVRip-ITA%5D+Mai+Dire+GF+%5B17-03-2009%5D%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":1,"time":1237323968,"description":"Puntata del 17/03/2009\n\nMai dire Grande Fratello &amp; Figli nasce nel 2004, parallelo a Mai dire Iene. La formula prevede la classica presa in giro dei reality del periodo (Grande Fratello, Isola dei famosi, Campioni, il sogno) e attorniata dalle imitazioni e dalla creazione di nuovi personaggi e pseudo-reality (tra questi c'ÃƒÂ¨ Lettera 22, ambientato in una macchina da scrivere dove si narrano le disavventure delle lettere contro il loro dispotico scrittore e le tecnologia moderna (ad esempio il computer), e L'Intelligente, basato invece sulla politica italiana, Ã‚Â«in onda tutti i giorni, che lo vediate o noÃ‚Â»). Il programma andava in onda in diretta senza lo studio e senza il Mago Forest.\n\nNel 2006 parte di nuovo Mai dire Grande Fratello &amp; Figli su Italia 1, il lunedi. Dopo 5 puntate viene trasferito su Canale 5 di martedÃƒÂ¬ con il medesimo orario, in nottata, con la partecipazione del Mago Forest e i comici Ubaldo Pantani, Marcello Cesena e Caterina Guzzanti. I confortanti dati auditel hanno permesso il passaggio a Canale 5. In questa edizione cambia lo studio con vero pubblico e piÃƒÂ¹ in stile studio Tv (prima vi era una specie di &quot;casa-studio tv&quot;). Le Letteronze (parodia delle varie Veline e Letterine) sono paradossali Ã‚Â«opinioniste muteÃ‚Â» circa i Reality ironizzati. In ogni puntata viene presentato un ospite a sorpresa, vero concorrente del GF, solitamente appena escluso.\t\n\nPiÃƒÂ¹ info su colombo-reloaded.org\t","torrent":{"xt":"urn:btih:d430de64e90bb11f2e5948d459015c33ddf82ad5","amp;dn":"%5BTVRip-ITA%5D+Mai+Dire+GF+%5B17-03-2009%5D%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d430de64e90bb11f2e5948d459015c33ddf82ad5","infoHashBuffer":{"type":"Buffer","data":[212,48,222,100,233,11,177,31,46,89,72,212,89,1,92,51,221,248,42,213]},"announce":[],"urlList":[]}}