{"title":"Belphegor-Conjuring The Dead 320k mp3   ak2014","uid":10555646,"size":75363583,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d48f9838682e0b8824ddd4372b25cbbc92cc4cc0&amp;dn=Belphegor-Conjuring+The+Dead+320k+mp3+++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":10,"time":1405389850,"description":"Belphegor-Conjuring The Dead 320k mp3   ak2014What we got Belphegor nfo Belphegor is a demon, and one of the seven princes of Hell, who helps people make discoveries. He seduces people by suggesting to them ingenious inventions that will make them rich. Was that not interesting I wonder If Belphegor suggested to Maxx to start a band. More nfo..Belphegor is a blackened death metal band from Salzburg, Austria. They originally formed in 1991 under the name Betrayer before changing their name in 1993. They are named after the demon Belphegor.\n\nBelphegor was founded as Betrayer in 1991 by vocalist and bassist Maxx, guitarists Helmuth and Sigurd, and drummer Chris. The band released their first demo Kruzifixion in April 1991, and Unborn Blood later on.[1] After adopting the name Belphegor in 1993, they released another demo, Bloodbath in Paradise on Maxi-CD format. At somepoint before or after the release of this demo, Maxx departed from the band, resulting in Helmuth assuming his role as both vocalist and guitarist of Belphegor since. In between 1993 and 1996 session member A-X performed bass, after which bassist Mario &quot;Marius&quot; Klausner joined the band as a full-time member.\n\nThe band was briefly signed to Perverted Taste Records, the label on which the demo Obscure and Deep was released in 1994. This release featured a cover of the Black Sabbath song Sabbath Bloody Sabbath. Their first album, The Last Supper, was released by Lethal Records in January 1995. At this time the band's logo was also redesigned to include two inverted crosses surrounded by blood. Well so are there any Blackened Death metal fans left cause this may be for you ........","torrent":{"xt":"urn:btih:d48f9838682e0b8824ddd4372b25cbbc92cc4cc0","amp;dn":"Belphegor-Conjuring+The+Dead+320k+mp3+++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d48f9838682e0b8824ddd4372b25cbbc92cc4cc0","infoHashBuffer":{"type":"Buffer","data":[212,143,152,56,104,46,11,136,36,221,212,55,43,37,203,188,146,204,76,192]},"announce":[],"urlList":[]}}