{"title":"Uffie feat. Pharrell Williams - ADD SUV (2nafish)","uid":5771265,"size":113184772,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5484d0f7e1fb127d354072b80d794fbc5381592&amp;dn=Uffie+feat.+Pharrell+Williams+-+ADD+SUV+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282120453,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;ADD SUV&quot; is a song by the electro artist Uffie. It is her second and lead single from her debut album Sex Dreams and Denim Jeans, it was released in France on May 17, 2010, May 31, 2010 in most European and Asian countries, June 7, 2010 in The UK and Ireland and June 8, 2010 in the US. &quot;ADD SUV&quot; was written by Uffie and produced by acclaimed electro artist Mirwais, who worked with Uffie a lot on her debut album and features Pharrell Williams performing guest vocals.\n\nOn April 15, 2010 Uffie's latest single, &quot;ADD SUV&quot; featuring Pharrell Williams premiered on BBC Radio 1. Uffie describes &quot;ADD SUV&quot; as &quot;poking fun at the rap fraternity's obsession with possessions, particularly their cars...&quot;, but was more seriously influenced by the 1966 classic novel &quot;Valley of the Dolls&quot;, which Uffie was reading at the time she wrote the song.\n\nA music video began to shoot for &quot;ADD SUV&quot; in Los Angeles starring both Uffie and Pharrell Williams and directed by Nathalie Canguilhem on April 9, 2010 and was released on June 14, 2010. It was also announced that ADD SUV (feat. Pharrell Williams) will be released as an EP (which will include remixes by Armand Van Helden and Hudson Mohawke) on May 17, 2010, in France, May 31, 2010 in most European and Asian countries, June 7, 2010 in The UK and Ireland and June 8, 2010 in the US.\n\nThe single received extremely positive reviews from New York Post, Prefix Magazine, Spin Magazine, among others. Also, with so much anticipation around &quot;ADD SUV&quot; the song debuted at number one on The Hype Machine. Once released as an EP, &quot;ADD SUV&quot; charted very successfully in the UK.\n\nSex Dreams and Denim Jeans is the debut studio album by the French/American electro artist Uffie. It was released June 14, 2010 in Europe and June 22, 2010 in the United States through Ed Banger Records and Elektra Records. The album was produced by Feadz, Mr. Oizo, Mirwais, SebastiAn, J-Mat and Uffie, features guest appearances by Pharrell Williams and Matt Safer from acclaimed indie rock band The Rapture and includes a cover of Siouxsie and the Banshees song &quot;Hong Kong Garden&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d5484d0f7e1fb127d354072b80d794fbc5381592","amp;dn":"Uffie+feat.+Pharrell+Williams+-+ADD+SUV+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5484d0f7e1fb127d354072b80d794fbc5381592","infoHashBuffer":{"type":"Buffer","data":[213,72,77,15,126,31,177,39,211,84,7,43,128,215,148,251,197,56,21,146]},"announce":[],"urlList":[]}}