{"title":"Motorhead - Over The Top (Live-Germany) (2nafish)","uid":6065408,"size":95983620,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d565dfbb85bbf74968bc1353c381129b3705f207&amp;dn=Motorhead+-+Over+The+Top+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1293335362,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nBomber was the third studio album by the British heavy metal band MotÃƒÂ¶rhead. It was recorded in 1979, the same year as Overkill. The album reached number 12 on the UK charts and brought some of MotÃƒÂ¶rhead's most popular songs, like &quot;Bomber&quot;, &quot;Dead Men Tell No Tales&quot; and &quot;Stone Dead Forever&quot;.\n\n&quot;Bomber&quot; is a song by the English heavy metal band MotÃƒÂ¶rhead, recorded and released in 1979. It is the title track to their album Bomber and was released as a single peaking at 34 on the UK singles chart.\n\nThe single was released in the UK by Bronze Records as a 7&quot; vinyl single with the first 20,000 copies pressed in blue vinyl and thereafter in black. The band promoted its release with an appearance on the BBC TV show Top of the Pops on 3 December.\n\nThe track was inspired after Lemmy had read Len Deighton's novel Bomber. It became the inspiration for a forty foot aluminium tube lighting rig used for their shows, a replica of a Heinkel He 111 bomber that could fly backwards and forwards, and side to side - the first to be able to do so.\n\nThe B-side of the single was the non-album track &quot;Over the Top&quot;, which has subsequently been included as a bonus track on the re-masterd Bomber album.\n\nThe song was also performed as a joint collaboration between MotÃƒÂ¶rhead and The Damned for inclusion on the proposed &quot;Ballroom Blitz&quot; single, but the recording session ended in drunkenness and the results were deemed unsuitable for release. The recording was, however, finally issued in 2003 on the Stone Deaf Forever! boxset.\n\nLive versions of this song have been released as the B-side to the 1981 single &quot;Motorhead&quot;, on the 2005 video Stage Fright and on the 2007 album Better MotÃƒÂ¶rhead than Dead: Live at Hammersmith.\n\nThe song was covered by Mudhoney as a B-side to their 1992 single &quot;Suck You Dry&quot;, and has been included as a bonus track on their Piece of Cake album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d565dfbb85bbf74968bc1353c381129b3705f207","amp;dn":"Motorhead+-+Over+The+Top+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d565dfbb85bbf74968bc1353c381129b3705f207","infoHashBuffer":{"type":"Buffer","data":[213,101,223,187,133,187,247,73,104,188,19,83,195,129,18,155,55,5,242,7]},"announce":[],"urlList":[]}}