{"title":"La Decision De Anne BR-Screener Spanish 2009","uid":5285115,"size":1280684032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6ffaab891b01855c835f73ea67bdb5a8b9b13f3&amp;dn=La+Decision+De+Anne+BR-Screener+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1263683235,"description":"La vida de Sara (Cameron Diaz) y Brian Fitzgerald (Jason Patric), padres de un hijo y de Kate (SofÃƒÂ­a Vassilieva), una niÃƒÂ±a de dos aÃƒÂ±os, cambia radicalmente cuando a la pequeÃƒÂ±a le diagnostican una leucemia. La ÃƒÂºnica esperanza de los padres es tener otro niÃƒÂ±o para salvar la vida de Kate. Para algunas personas, estos temas de ingenierÃƒÂ­a genÃƒÂ©tica generan preguntas morales y ÃƒÂ©ticas; para los Fitzgerald, y para Sara en particular, no existe ninguna otra opciÃƒÂ³n sino hacer todo lo que se pueda para asegurar la vida de Kate. Y lo que sea es Anne. Kate y Anne (Abigail Breslin) comparten una relaciÃƒÂ³n aÃƒÂºn mÃƒÂ¡s cercana que la de la mayorÃƒÂ­a de las hermanas. Aunque Kate es mayor, ella confÃƒÂ­a en su joven hermana; de hecho, su vida depende de Anna. A lo largo de sus jÃƒÂ³venes vidas, las hermanas pasan por diversos procedimientos mÃƒÂ©dicos y estancias en el hospital, lo que no es sino una parte de la vida de una familia unida. Sara, esposa y madre abnegada que deja su carrera como abogado para cuidar a su hija, a veces se siente perdida dentro del papel que ha tomado en su esfuerzo por salvar a Kate. Su marido Brian, de gran fortaleza y apoyo moral, a menudo se vuelve totalmente pasivo ante la fuerza y la determinaciÃƒÂ³n de su esposa. Y el ÃƒÂºnico hijo varÃƒÂ³n que tienen, Jesse (Evan Ellingson), queda ocasionalmente relegado a un segundo plano, ya que Kate y Anne ocupan el centro de todo. Hasta que Anne, que ahora tiene 11 aÃƒÂ±os de edad, dice no. En busca de emancipaciÃƒÂ³n mÃƒÂ©dica, contrata a su propio abogado (Alec Baldwin), e inicia un proceso legal que divide a familia... y que podrÃƒÂ­a dejar rÃƒÂ¡pidamente al dÃƒÂ©bil cuerpo de Kate en manos del destino.","torrent":{"xt":"urn:btih:d6ffaab891b01855c835f73ea67bdb5a8b9b13f3","amp;dn":"La+Decision+De+Anne+BR-Screener+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ffaab891b01855c835f73ea67bdb5a8b9b13f3","infoHashBuffer":{"type":"Buffer","data":[214,255,170,184,145,176,24,85,200,53,247,62,166,123,219,90,139,155,19,243]},"announce":[],"urlList":[]}}