{"title":"Terminator - The Sarah Connor Chronicles S01E03 - The Turk.avi","uid":4199165,"size":368025656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8a2b2239d43c46052f2a1286b81d57765826c6d&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E03+-+The+Turk.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Chimera2005","files":1,"time":1211402861,"description":"n this episode Sarah visits Tarissa Dyson at Miles&amp;#039;s grave in an effort to track down Skynet&amp;#039;s creators. Sarah brings with her several pictures of people that were part of the package taken from the Resistance fighters&amp;#039; safe and asks Tarissa to identify them. Tarissa identifies one of the people in the pictures as a computer programmer named Andy Goode (Brendan Hines). Sarah finds Andy working as a cellphone salesman and is able to set up a dinner at Andy&amp;#039;s home. At the dinner, Andy reveals that he has built a learning computer, called The Turk, which plays chess, and that it is showing random behavior in solving problems in different ways. John has a panic attack when he finds out about it, and asks Sarah about every technical detail in order to know if it is capable of intelligent thought, the answer to which she does not know. John tells her about the Singularity, a point in time when machines will be able to build superior versions of themselves without the aid of humans. Sarah becomes more and more disturbed as she learns more of Andy&amp;#039;s intentions with The Turk, and at one point looks like she is going to kill him. Cameron supports this and believes he should die; however Sarah ends up setting fire to his home, destroying the computer but sparing his life.\n\nAt the new school, John gives Cameron a few lessons on proper social behavior in order for her to try to fit in with the students. Nevertheless she displays very poor social skills in the process. John tries to save a girl, Jordon Cowan (Alessandra Toreson), who is involved in a sexual situation at school that is becoming public. Jordan attempts committing suicide; however Cameron restrains John from helping, and Jordan dies. Back at home John becomes furious and lashes out at both Sarah and Cameron when he does not receive Sarah&amp;#039;s support to save the girl.\n\nIn another subplot, Agent Ellison tries to figure a link between the death of his contact Enrique and the dead Resistance agents. He vows that he will find the people who stole the contents of the safe. Ellison also remembers a substance he obtained from a crime scene he investigated in Red Valley, New Mexico, where Sarah and John were eight years ago, which resembled human blood yet had no red blood cells. Ellison asks Simpson to run some tests on the blood she obtained from the Resistance fighters&amp;#039; apartment, in order to see if there is anything peculiar about it.\n\nSarah returns to the doctor&amp;#039;s office, who assures Sarah that she&amp;#039;s currently in good health. Nevertheless, she&amp;#039;s in fear of cancer after Cameron&amp;#039;s revelation that she was supposed to have died of it two years before, and seeks preventive treatment from the doctor.\n\nCromartie has reassembled himself and goes to a hospital to obtain blood samples, seriously injuring (or killing) two people in the process. He then breaks into the home of Dr. Flemming, a medical scientist who specializes in cellular regeneration, and, after roughing him up, asks him if he has the ability to create synthetic flesh (Cromartie gives the doctor the working solution to the formula). The doctor replies that he does. The doctor prepares the liquid solution and pours it into a bathtub. Cromartie then takes all his clothes off and the doctor is shocked to see his robotic endoskeleton. After some time has passed, Cromartie rises from the solution, with flesh covering his entire body, because of the unrefined nature of its application his flesh does not look normal. Later, Ellison arrives at Dr. Flemming&amp;#039;s home and sees blood on the floor and blood over the flesh formula on the wall, wiping most of it out. He goes into a very bloodied bathroom and sees the doctor dead on the ground with his eyes missing.","torrent":{"xt":"urn:btih:d8a2b2239d43c46052f2a1286b81d57765826c6d","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E03+-+The+Turk.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8a2b2239d43c46052f2a1286b81d57765826c6d","infoHashBuffer":{"type":"Buffer","data":[216,162,178,35,157,67,196,96,82,242,161,40,107,129,213,119,101,130,108,109]},"announce":[],"urlList":[]}}