{"title":"Anthemion Software DialogBlocks v5.02 with Key [TorDigger]","uid":7929084,"size":8132343,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d901580c37cbe4839321223b6f8321c1796044f8&amp;dn=Anthemion+Software+DialogBlocks+v5.02+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1355674538,"description":"DialogBlocks\n\nFast, easy dialog editing and code generation.\n\nThe quickest way to build wxWidgets GUIs\n\nAnthemion DialogBlocks is a sizer-based resource editor that quickly gets you creating professional-looking dialogs, wizards and frames for deployment on Windows, Linux, Mac or any other supported wxWidgets platform.\n\nWhat can DialogBlocks help you do?\n\ncreate resizeable, portable dialogs;\ncreate complex wizards and property sheet dialogs;\ncreate frames complete with menubar and toolbar;\ncreate wxAUI-based layouts with docking;\nsee and edit the properties for each control or sizer in a convenient, consistent property editor;\noutput to C++ or XRC;\ngive your dialogs context-sensitive help and tooltips;\nstore image resources and convert to inline or file-based XPMs;\nedit the generated C++ code by hand, but have DialogBlocks insert changes to the dialog;\npreview your dialogs, then quickly compile and run the application from within DialogBlocks;\nbuild wxWidgets from within DialogBlocks;\nmigrate your old Windows RC dialogs as first-shot wxWidgets dialogs before full sizer-based conversion.\nWhat benefits will you get?\n\nspend minutes on your dialog UI, not hours;\nno more writing complex sizer-based layouts by hand;\nthe chore of adding event handlers becomes effortless;\nit's like having your own programming assistant updating your UI code.\nMore time-savers...\nDialogBlocks is aimed at getting the job done quickly, and so has keyboard shortcuts for most operations. And you can simply double-click some controls to edit the label or default value in a pop-up window, as a handy alternative to using the property editor.\n\nDialogBlocks is educational, too: there's a description mode that gives you an English 'translation' of the sizer settings for the selected element, as well as a short description of the element itself. This will make it much easier to spot mistakes and bring you up to speed with using sizers.\n\nDialogBlocks is available on Windows, several Linux variants, FreeBSD, Solaris x86, and Mac (PPC and Intel). The resulting C++ and XRC files can be used on any platform for which wxWidgets is supported.\n\nSupported OS:\n\nWindows XP/Vista/7/8\n\nHomepage: http://www.dialogblocks.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register program with given name and key.\n- Done, Enjoy","torrent":{"xt":"urn:btih:d901580c37cbe4839321223b6f8321c1796044f8","amp;dn":"Anthemion+Software+DialogBlocks+v5.02+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d901580c37cbe4839321223b6f8321c1796044f8","infoHashBuffer":{"type":"Buffer","data":[217,1,88,12,55,203,228,131,147,33,34,59,111,131,33,193,121,96,68,248]},"announce":[],"urlList":[]}}