{"title":"The Story of Ireland  (BBC 2011 - Complete Series)","uid":6543359,"size":3910848558,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db40dd7ac6a3da11b69791e6cd33fb122cc15cdb&amp;dn=The+Story+of+Ireland++%28BBC+2011+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":6,"time":1310770106,"description":"History Documentary hosted by Fergal Keane, published by BBC in 2011 - English narration\n\nThe Story of Ireland\nA new five-part landmark series, written and presented by BBC Special Correspondent Fergal Keane, The Story of Ireland is a clear-eyed and expansive view of the history of the island and its people from its earliest times to the present day.\n\n\n1) Age of Invasions\nFar from being a remote European outpost, episode one charts the formation of Ireland's DNA by successive ways of invaders and settlers. Along the way, Keane exposes the myth of Ireland's Celtic identity; he travels to Norway and presents the Vikings as resourceful settlers and traders in Ireland rather than as the barbarous marauders of popular belief. He also follows the trail of the early Iris monks as they bring their literature and learning through Europe to re-energise the Christian world, in the early middle ages.\n\n2) Age of Conquest\nIn this episode, Fergal Keane examines how the huge upheavals of Europe in the Middle Ages altered the story of Ireland irrevocably. Beginning with the Anglo Norman invasion of Ireland in 1169, he investigates how the Normans changed Irish life and why Gaelic Kings initially welcomed an English ruler. But it is also the story of an incomplete conquest. The English Crown only finally moves to impose its will in Ireland after the Protestant reformation places Ireland in the forefront of religious war.\n\n3) Age of Revolution\nFergal Keane explores how the influx of Scottish Presbyterians, during the 17th century Plantation of Ulster, changed the makeup of the island and its subsequent history. We also see how revolution in America and France paved the way for Ireland's 1798 rebellion.\n\n4) Age of Union\nFergal Keane's Story of Ireland explores the great changes of the 19th century. Starting with the 1801 Act of Union, when Ireland becomes part of the United Kingdom for the first time; Keane shows us how modern Ireland comes into being through the great constitutional battles for Catholic Emancipation, Land Reform and Home Rule. We also witness the horrors of the potato famine of the 1840s.\n\n5) Age of Nations\nThe dramatic history of Ireland through the 20th century is the subject of this concluding episode of Fergal Keane's series. The War of Independence in the south and the fierce resistance that ensues in the north leads to partition of the island for the first time in its history. Keane charts the developments of the two religiously dominated states , driven by big personalities like Edward Carson and Ian Paisley in the North and Eamonn de Valera and Charles Haughey in the South, up to present-day. He follows Northern Ireland's Troubles and Peace Process and the boom and bust of the Celtic Tiger years in The Republic.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:db40dd7ac6a3da11b69791e6cd33fb122cc15cdb","amp;dn":"The+Story+of+Ireland++%28BBC+2011+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db40dd7ac6a3da11b69791e6cd33fb122cc15cdb","infoHashBuffer":{"type":"Buffer","data":[219,64,221,122,198,163,218,17,182,151,145,230,205,51,251,18,44,193,92,219]},"announce":[],"urlList":[]}}