{"title":"Monsters Inc Scare Island Game","uid":7547391,"size":129053924,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dcd13ac053575c06c5a1379aa388165ab931b76e&amp;dn=Monsters+Inc+Scare+Island+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1345390479,"description":"This 12-level game begins after completion of an orientation program hosted by Roz, who shows the monsters the basics of their training. The levels are divided among three training grounds located on Scare Island. With names hinting at the nature of their design, the Urban Training Grounds, Desert Training Grounds and Arctic Training Grounds contain four areas to be explored. Each region ranges in scenery from a city park to a frozen lake, and players can choose to play as either Sulley or Mike, with each monster having different moves and scare abilities.\n \nThe objective of the game is to successfully scare all the robot children (known as &quot;Nerves&quot;) on the island and graduate from monster training with top honors. This is accomplished by collecting bronze, silver and gold medals that are awarded throughout the game. The bronze medal can be obtained by sacaring five Nerves on a level; the silver medal can be obtained by finding and collecting 10 &quot;Monsters, Inc.&quot; Tokens scattered on a level; and the gold medal can be obtained by scaring all the 8 Nerves of a level. Obtaining the bronze medal in each sub-level of one training ground unlocks a hidden item that may help the player reach previously unreachable areas. By each level the player beats, he unlocks a clip of the Monsters, Inc. film.","torrent":{"xt":"urn:btih:dcd13ac053575c06c5a1379aa388165ab931b76e","amp;dn":"Monsters+Inc+Scare+Island+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd13ac053575c06c5a1379aa388165ab931b76e","infoHashBuffer":{"type":"Buffer","data":[220,209,58,192,83,87,92,6,197,161,55,154,163,136,22,90,185,49,183,110]},"announce":[],"urlList":[]}}