{"title":"The Art of SpeedReading People: How to Size People Up and Speak ","uid":8436479,"size":15477308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df8358d680c7abba06f92fba792b60558c6f8ef4&amp;dn=The+Art+of+SpeedReading+People%3A+How+to+Size+People+Up+and+Speak+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":1,"time":1367653302,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51qZmGzkigL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51qZmGzkigL.jpg&lt;/a&gt;\n\n\nThe Art of Speed Reading People: How to Size People Up and Speak Their Language\n\n\nLittle, Brown and Company  \nPaul D. Tieger,Barbara Barron-Tieger\n1999\nLanguage: English\nISBN-10: 0316845183\nISBN-13: 978-0316845182\n224 pages  \nPDF \n14.7 MB \n\nDo you communicate ineffectively with some people and powerfully with others? The reason may be a difference in personalities and communication preferences. The Art of Speedreading People is a crash course in communication strategies, showing you how to observe behavioral clues to gain valuable insights into people's personalities and communication styles. The result: you become a more effective and convincing communicator, and you are more likely to receive the response you want. \n\n\nThis book is like a practical communications seminar based on the psychology model called Personality Typing, which is focused on identifying key personality traits in order to communicate most effectively. First, you analyze your own personality type and determine your placement on the scales of extrovert/introvert, sensor/intuitive, thinking/feeling, and judging/perceiving. The book then teaches you about the clues that indicate other people's personality type, including speaking style, body language, and occupation. You test yourself by reading a few scenarios and personality typing the characters described. You put the system to work by learning approaches to &quot;speedreading&quot; people in person and on the phone using skill-building exercises. Finally, you learn how to communicate effectively with people who are a different type or temperament than you. The Art of Speedreading People is intriguing and useful, especially for those who work in a sales, service, teaching, or managerial position, or any job where effective and positive communication is paramount.\n\n","torrent":{"xt":"urn:btih:df8358d680c7abba06f92fba792b60558c6f8ef4","amp;dn":"The+Art+of+SpeedReading+People%3A+How+to+Size+People+Up+and+Speak+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df8358d680c7abba06f92fba792b60558c6f8ef4","infoHashBuffer":{"type":"Buffer","data":[223,131,88,214,128,199,171,186,6,249,47,186,121,43,96,85,140,111,142,244]},"announce":[],"urlList":[]}}