{"title":"[Kung Fu] Invincible Kung Fu aka Kung Fu Fighter (2007) - DVD/Rm","uid":3686910,"size":368286580,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfb3ac803391e92dfa09ed5fee464fd1b725e531&amp;dn=%5BKung+Fu%5D+Invincible+Kung+Fu+aka+Kung+Fu+Fighter+%282007%29+-+DVD%2FRm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"John Smith","files":4,"time":1179013332,"description":"Invincible Kung Fu aka Kung Fu Fighter (2007)\n\nFilm Director: Yongjian Ye\n\nFilm Cast: Vanness Wu, Siu-Wong Fan, Emme Wong, Chi Chung Lam, Kwok Kuen Chan, Kai Man Tin, Hsiao Liang\n\nMovie review/description: A martial arts comedy produced by Sharon Yeung and directed by Ye Yong Jian, has hit the screens on April 27 in China. With help from Stephen Chow, Sharon Yeung manages to get several prominent actors from Kung Fu Hustle onboard, including Bruce Liang, Chan Kwok Kwan, Tin Kai Man and Lam Tse Chung. Tin Kai Man plays a greedy, cunning, and licentious person who constantly fights with Chan Kwok Kun, a secret society boss, while Lam Tse Chong again brings about comic relief in this movie. Bruce Leung plays a master of kungfu. This My Way Film production also stars Vaness Wu Fan Siu Wong, Emme Wong. Fan Siu Wong, who also action directs the movie, hopes to create fight scenes that are not only modern but reflect the true spirit of martial arts. Kung Fu Fighter, set in 1940s, is about a rickshaw puller Vaness Wu who arrives at Shanghai in search of his father but is inevitably drawn into various feuds due to an accidental involvement in a gamble. Can he rise above all and establish himself as a worthy kungfu master?\n","torrent":{"xt":"urn:btih:dfb3ac803391e92dfa09ed5fee464fd1b725e531","amp;dn":"%5BKung+Fu%5D+Invincible+Kung+Fu+aka+Kung+Fu+Fighter+%282007%29+-+DVD%2FRm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb3ac803391e92dfa09ed5fee464fd1b725e531","infoHashBuffer":{"type":"Buffer","data":[223,179,172,128,51,145,233,45,250,9,237,95,238,70,79,209,183,37,229,49]},"announce":[],"urlList":[]}}