{"title":"Island City Pilot (1994)","uid":7642367,"size":892721199,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e063ec12b5a9fa9dd516e49b2295807d743c0e13&amp;dn=Island+City+Pilot+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Daemonward","files":2,"time":1347813399,"description":"Island City is a science fiction television pilot movie that was aired by Prime Time Entertainment Network in 1994. The film was produced by Lee Rich Productions in association with Lorimar Television.\n\nThe premise was that mutations resulting from genetic experimentation in the 21st century create chaos when a few people are made essentially immortal while the rest revert to a barbaric proto-humanoid state. The movie touched on many themes including genetic experimentation, virtual reality, and state-controlled marriages. Citizens of the city would wear a colored crystal on their neck and could only mate with other citizens of the same color. The color of the crystal was based on the individual's genetic makeup. Outside the domed city were humans that devolved into a more primitive state due to a genetic engineering disaster in the 21st century. To keep citizens entertained in the city there were virtual reality goggles they could wear that simulated environments and sensations to the user.\n\nThe film stars Kevin Conroy (known for his voice role as Batman in the DC animated universe), Brenda Strong (known for her role as Mary Alice Young on the ABC television comedy-drama series Desperate Housewives), Eric McCormack (known playing Will Truman in the American sitcom Will &amp; Grace), and Constance Marie (known for her role as Angie Lopez on George Lopez).","torrent":{"xt":"urn:btih:e063ec12b5a9fa9dd516e49b2295807d743c0e13","amp;dn":"Island+City+Pilot+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e063ec12b5a9fa9dd516e49b2295807d743c0e13","infoHashBuffer":{"type":"Buffer","data":[224,99,236,18,181,169,250,157,213,22,228,155,34,149,128,125,116,60,14,19]},"announce":[],"urlList":[]}}