{"title":"Frank Thorne - Ribit! (Restored)","uid":8394236,"size":153783747,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e16d8b8561cb2c6edc215e24fa4ed0e7d42a49b2&amp;dn=Frank+Thorne+-+Ribit%21+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1366524860,"description":"Issues 1-4 of 'Ribit!'\n\nComico - The Comic Company, Jan-April, 1989\n\nWritten and Illustrated by Frank Thorne\n\nFrank Thorne (born June 16, 1930) is an American comic book artist-writer, best known for popularizing the Marvel Comics character Red Sonja.\n\nOriginally drawn by Barry Windsor-Smith for Conan the Barbarian, Sonja was transposed from a minor Robert E. Howard 16th-century gunslinger character ('Red Sonya') to a mainstay of the sword and sorcery Conan canon by Roy Thomas. Having featured in half-a-dozen issues of Conan the Barbarian (with art by Smith and John Buscema), Sonja graduated to a starring role in other comics, and it was then that Thorne took over from Dick Giordano in drawing her for Marvel Feature (Jan. 1976), continuing through most of her 1977-79 solo series, where he established her characteristic image as a ferocious and beautiful female barbarian wearing a chainmail bikini, which later became a popular fantasy literature archetype.\n\nHe 'left Sonja' in 1978 to create his own woman warrior, Ghita of Alizarr,and has subsequently created a number of erotic fantasy comics and characters, alongside other works. His most notable works include being the creator/artist/writer of 'Moonshine McJugs' for Playboy magazine, as well as Ghita of Alizarr for Fantagraphics Books, 'Lann' for Heavy Metal magazine, Ribit for Comico, The Iron Devil and Devil's Angel for Eros Comix, and Danger Rangerette for National Lampoon and High Times.\n\nHis published works include two autobiographies, Drawing Sexy Women and The Crystal Ballroom, as well as a novel, Nymph. All are published by Fantagraphics Books.","torrent":{"xt":"urn:btih:e16d8b8561cb2c6edc215e24fa4ed0e7d42a49b2","amp;dn":"Frank+Thorne+-+Ribit%21+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e16d8b8561cb2c6edc215e24fa4ed0e7d42a49b2","infoHashBuffer":{"type":"Buffer","data":[225,109,139,133,97,203,44,110,220,33,94,36,250,78,208,231,212,42,73,178]},"announce":[],"urlList":[]}}