{"title":"Secret Societies - 02 - H E L L B O U N D","uid":13261052,"size":7159319580,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2e259ae6cd864060f315cd48247a0387a8d55eb&amp;dn=Secret+Societies+-+02+-+H+E+L+L+B+O+U+N+D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":125,"time":1453279072,"description":"\nFreemasonry\r\n \t\r\nIlluminati\r\n \t\r\nMartyrs of Today\r\n \t\r\nScull and Bones\r\n \t\r\nSigns of the Times\r\n \t\r\nSIN-ister Clips\r\n \t\r\nThe Holy Spirit\r\n \t\r\nThe New World Order\r\nDescription\r\nSecret Societies are everywhere. Nothing good comes them. They think they are better than all of us. Pooooey on that. The will all burn.\r\n\r\n\r\nThere is a list below.\r\n\r\nA secret society is a club or organization whose activities, events, and inner functioning are concealed from non-members. The society may or may not attempt to conceal its existence. The term usually excludes covert groups, such as intelligence agencies or guerrilla insurgencies, that hide their activities and memberships but maintain a public presence. The exact qualifications for labeling a group as a secret society are disputed, but definitions generally rely on the degree to which the organization insists on secrecy, and might involve the retention and transmission of secret knowledge, denial of membership or knowledge of the group, the creation of personal bonds between members of the organization, and the use of secret rites or rituals which solidify members of the group.\r\n\r\nAnthropologically and historically, secret societies are deeply interlinked with the concept of the Mannerbund, the all-male &quot;warrior-band&quot; or &quot;warrior-society&quot; of pre-modern cultures (see H. Schurtz, Alterklassen und Mannerbunde, Berlin, 1902; A. Van Gennep, The Rites of Passage, Chicago, 1960).\r\n\r\nA purported &quot;family tree of secret societies&quot; has been proposed, although it may not be comprehensive.[2]\r\nThe Thuggee were a secret cult of assassins who worshipped the Hindu goddess Kali.\r\n\r\nAlan Axelrod, author of the International Encyclopedia of Secret Societies and Fraternal Orders, defines a secret society as an organization that:\r\n\r\nIs exclusive.\r\nClaims to own special secrets.\r\nShows a strong inclination to favor its own.\r\n\r\nDavid V. Barrett, author of Secret Societies: From the Ancient and Arcane to the Modern and Clandestine, uses slightly different terms to define what does and does not qualify as a secret society. He defines it as any group that possesses the following characteristics:\r\n\r\nIt has &quot;carefully graded and progressed teachings&quot;\r\nTeachings are &quot;available only to selected individuals&quot;\r\nTeachings lead to &quot;hidden (and 'unique') truths&quot;\r\nTruths bring &quot;personal benefits beyond the reach and even the understanding of the uninitiated.&quot;\r\n\r\nBarrett goes on to say that &quot;a further characteristic common to most of them is the practice of rituals which non-members are not permitted to observe, or even to know the existence of.&quot; Barrett's definition would rule out many organizations called secret societies; graded teaching is usually not part of the American college fraternities, the Carbonari, or the 19th century Know Nothings.\r\n\r\n\r\nSkull and Bones\r\nRosicrucians\r\nThe Sons of Liberty\r\nThule Society\r\nThe Priory of Sion\r\nThe Improved Order of Red Men\r\nThe Ancient Arabic Order of the Nobles of the Mystic Shrine\r\nWoodmen\r\nKnights of the Golden Eagle\r\nOrdo Templi Orientis\r\nKu Klux Klan\r\nBilderberg Group\r\nFreemasonry\r\nThe Loyal Order of Moose\r\nHermetic Order of the Golden Dawn\r\nP.E.O. Sisterhood\r\nForesters Society\r\nIlluminati\r\nKnights of Columbus\r\nKnights of Pythias\r\nAncient Order of Hibernians\r\nNational Grange\r\nUnited Order of the Golden Cross\r\nThe United Ancient Order of Druids\r\nThe Mystic Order of Veiled Prophets of the Enchanted Realm","torrent":{"xt":"urn:btih:e2e259ae6cd864060f315cd48247a0387a8d55eb","amp;dn":"Secret+Societies+-+02+-+H+E+L+L+B+O+U+N+D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e259ae6cd864060f315cd48247a0387a8d55eb","infoHashBuffer":{"type":"Buffer","data":[226,226,89,174,108,216,100,6,15,49,92,212,130,71,160,56,122,141,85,235]},"announce":[],"urlList":[]}}