{"title":"House Of Cards Season 1 720p","uid":8393212,"size":9927547418,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e31f6ed0b85a97ca0a5cd0ee8bba9ce2ef07f68b&amp;dn=House+Of+Cards+Season+1+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"GWSucks","files":1,"time":1366491469,"description":"House Of Cards (2013)\nNetflix Exclusive &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1856010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1856010&lt;/a&gt;\n720p\n\nAll files originally uploaded by my sista from anotha mista/brotha from anotha motha DibyaTPB.\n\n*********\n*********\n\nA very happy Earth Day pirates!\n\nA note on piracy: The MPAA/RIAA loves you for you are the bane of their existence. Shutting down TPB would be their demise for their only purpose is to grease the wheels of congress. Their exists not a single person within these lobbyist organizations whose breath doesn't reek with the fowl, bleach stench of congressional cum. I've seen a number of lobbyist who have been unable to wash away the Oompa Loompa color blowing John Boehner (it's pronounced boner no matter how he spins it).  In turn, the walls of DC are permeated with the odor of lobbyist ball sweat from all the handjobs going on behind closed doors.\n\nPiracy is a weapon against the collusion of big business and the best congress money can buy! The entire political system is the mafia collecting dues to protect only the mightiest of corporations and weed out competition from the little guy. Is their a multinational corporation out there who isn't benefiting from the way patent and copyright law is setup? If you're a rising star in the tech industry then Apple can just go after you for copyright infringement. They don't have to prove it, just keep you tied up in court long enough to go broke.\n\nAnyone calling President Barack Obama a socialist suffers from delusions, paranoia, and/or is just fucking braindead (which accounts for the majority of the GOP/Tea Party). No socialist would appoint douchebags from Monsanto to key positions within the USDA/FDA. A socialist would also not embark on an ongoing war against whistleblowers. Then again, the same people making these accusations are incapable of distinguishing the differences between political and economic systems which is why they quite often accuse people who are socialists of being communists. They also confuse a market system for capitalism and belie the necessary relationship a corporation has with government. Who the fuck do they think gave corporations their rights to begin with?\n\nDo not have guilt about downloading your entertainment. You are not hurting the people who created the material. Those people have already been paid. Copyright holders are these corporations and those making the most money wouldn't be able to sing a tune, write a script, direct a film, play a guitar, or dance to save their fucking lives. They're the Simon Cowell's of the world getting rich off other people's talents and you should be proud to take away from the fatness of their wallets. Fucking vampires! They dispose of people once they no longer have an ability to make exponential wads of cash. In 10 more years Justin Bieber is going to be on a reality television series with other washed up hacks trying to get back an inkling of the popularity he has now. The only reason he'll be there is because it's making someone millions for people to enjoy watching how pathetic he's become.\n\nI long for the day. Keep up the good work pirates! Download mercilessly.\n*********\n*********","torrent":{"xt":"urn:btih:e31f6ed0b85a97ca0a5cd0ee8bba9ce2ef07f68b","amp;dn":"House+Of+Cards+Season+1+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e31f6ed0b85a97ca0a5cd0ee8bba9ce2ef07f68b","infoHashBuffer":{"type":"Buffer","data":[227,31,110,208,184,90,151,202,10,92,208,238,139,186,156,226,239,7,246,139]},"announce":[],"urlList":[]}}