{"title":"Engineering Analysis - Interactive Methods and Programs with FOR","uid":12182779,"size":5104635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e42499979b0e099061bd96bbdec41121f0719bcb&amp;dn=Engineering+Analysis+-+Interactive+Methods+and+Programs+with+FOR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1438485088,"description":"Engineering Analysis - Interactive Methods and Programs with FORTRAN, QuickBASIC, MATLAB, and Mathematica (CRC, 1999).pdf\n\nISBN 084932016X\n\nThis book provides a concise introduction to numerical concepts in engineering analysis, using FORTRAN, QuickBASIC, MATLAB, and Mathematica to illustrate the examples. Discussions include:\nmatrix algebra and analysis\nsolution of matrix equations\nmethods of curve fit\nmethods for finding the roots of polynomials and transcendental equations\nfinite differences and methods for interpolation and numerical differentiation\nnumerical computation of single and double integrals\nnumerical solution of ordinary differential equations\nEngineering Analysis:\nteaches readers to become proficient in FORTRAN or QuickBASIC programming to solve engineering problems\nprovides an introduction to MATLAB and Mathematica, enabling readers to write supplementary m-files for MATLAB and toolkits for Mathematica using C-like commands\nThe book emphasizes interactive operation in developing computer programs throughout, enabling the values of the parameters involved in the problem to be entered by the user of the program via a keyboard.\nIn introducing each numerical method, Engineering Analysis gives minimum mathematical derivations but provides a thorough explanation of computational procedures to solve a specific problem. It serves as an exceptional text for self-study as well as resource for general reference","torrent":{"xt":"urn:btih:e42499979b0e099061bd96bbdec41121f0719bcb","amp;dn":"Engineering+Analysis+-+Interactive+Methods+and+Programs+with+FOR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42499979b0e099061bd96bbdec41121f0719bcb","infoHashBuffer":{"type":"Buffer","data":[228,36,153,151,155,14,9,144,97,189,150,187,222,196,17,33,240,113,155,203]},"announce":[],"urlList":[]}}