{"title":"The Song of the Quarkbeast - Jasper Fforde","uid":10189823,"size":484622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e440933ee3e83a7c9f472c76b14f21acc684210d&amp;dn=The+Song+of+the+Quarkbeast+-+Jasper+Fforde&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1400622440,"description":"A long time ago magic faded away, leaving behind only yo-yos, the extremely useful compass-pointing-to-North enchantment and the spell that keep bicycles from falling over. Things are about to change. Magical power is on the rise and King Snodd IV of Hereford has realised that he who controls magic controls almost anything. One person stands between Snodd and his plans for power and riches beyond the wildest dreams of avarice. Meet Jennifer Strange, sixteen-year-old acting manager of Kazam, the employment agency for sorcerers and soothsayers. With only one functioning wizard and her faithful assistant 'Tiger' Prawns, Jennifer must use every ounce of ingenuity to derail King Snodd's plans. It may involve a trip on a magic carpet at the speed of sound to the Troll Wall, the mysterious Transient Moose, and a powerless sorceress named Once Magnificent Boo. But one thing is certain: Jennifer Strange will not relinquish the noble powers of magic to big business and commerce without a fight.\n\nReview\n\n'Highly recommended. Very funny' -- Independent on THE LAST DRAGONSLAYER '[Fforde's] ripping yarn of magic in decline mashes up the usual spells-and-beasts motif with a satire on corporate cash and tabloid values.' -- i on THE LAST DRAGONSLAYER 'This year's grown-up JK Rowling' -- Sunday Times 'True literary comic genius' -- Sunday Express\n\nAbout the Author\n\nJasper Fforde traded a varied career in the film industry for staring out of the window and chewing the end of a pencil. He lives and works in Wales and has a passion for aviation. ","torrent":{"xt":"urn:btih:e440933ee3e83a7c9f472c76b14f21acc684210d","amp;dn":"The+Song+of+the+Quarkbeast+-+Jasper+Fforde","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e440933ee3e83a7c9f472c76b14f21acc684210d","infoHashBuffer":{"type":"Buffer","data":[228,64,147,62,227,232,58,124,159,71,44,118,177,79,33,172,198,132,33,13]},"announce":[],"urlList":[]}}