{"title":"Be Careful with my Heart - EP 271-275 - July 29-Aug 2, 2013","uid":8770301,"size":804868698,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e452495afaffe48117e6d3aa30944a945114f904&amp;dn=Be+Careful+with+my+Heart+-+EP+271-275+-+July+29-Aug+2%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Alexdokko","files":6,"time":1375436011,"description":"A simple girl, Maya dela Rosa (Jodi Sta. Maria), her older sister, Cristina Rose, and Cristina's son are introduced as tour guides for their hometown, San Nicolas, with their mother running a souvenir shop. Money is often less than the living expenses and household repairs. Cristina hopes to work at sea while Maya dreams of becoming a flight stewardess. One rainy night, after an attempt to fix the roof, Cristina breaks her leg and is thus unable to complete her schooling to become a sea woman. With a large medical bill, the future and current expenses, Maya deemed it necessary to work overseas for two years to help her family. Upon arrival in Manila, Maya discovers that the woman who had offered work overseas had swindled her. Maya is stuck in Manila with no money or place to go. Relentless, Maya allows no one to stop her, not even the handsome, wealthy widower Richard Lim (Richard Yap), who reminds her of her shortcomings.\nIronically, Richard is her last hope because of his influence in the airline industry. He offers Maya to become his childrenÎ“Ã‡Ã–s temporary nanny in exchange for his help. Maya agrees to the offer. Upon entering the Lim home, she finds herself involved in the private lives of Richard and his three problematic children: Luke (Jerome Ponce), Nikki (Janella Salvador) and Abby (Mutya Orquia).\nMaya realizes that since RichardÎ“Ã‡Ã–s wife died, the familyÎ“Ã‡Ã–s joy died with her; hence their problems. Maya is tasked to bridge Richard to his children and eventually she succeeds in rebuilding the family. However, in repairing their broken hearts, Maya encounters bigger challenges that test her determination and, more importantly, her heart. While fulfilling her obligation, she falls in love with the Lim children and, admittedly, with Richard.\t","torrent":{"xt":"urn:btih:e452495afaffe48117e6d3aa30944a945114f904","amp;dn":"Be+Careful+with+my+Heart+-+EP+271-275+-+July+29-Aug+2%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e452495afaffe48117e6d3aa30944a945114f904","infoHashBuffer":{"type":"Buffer","data":[228,82,73,90,250,255,228,129,23,230,211,170,48,148,74,148,81,20,249,4]},"announce":[],"urlList":[]}}