{"title":"Frank Wilczek: The LHC and Unified Field Theory","uid":4739324,"size":200521059,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e6cf1c53b237e0e2ecdf90c56277956599bd5695&amp;dn=Frank+Wilczek%3A+The+LHC+and+Unified+Field+Theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1235472899,"description":"Light and matter have long been seen as separate: spirit vs. flesh, earthy vs. divine. However, according to Wilczek, physics has blurred the line between light and matter, showing that reality is far from permanent, but rather ever-changing.\n\nThe 2004 Nobel Prize winner in physics takes a closer look at the very nature of reality, and how our perceptions of reality have changed over time - The Commonwealth Club of California \n\n\nFrank Wilczek - Frank Wilczek has received many prizes for his work in physics, including the Nobel Prize of 2004 for work he did as a graduate student at Princeton University, when he was only 21 years old. He is known, among other things, for the discovery of asymptotic freedom, the development of quantum chromodynamics, the invention of axions, and the exploration of new kinds of quantum statistics (anyons). Much in demand for public lectures to a wide range of audiences, Frank has been anthologized in the Norton Anthology of Light Verse and twice in Best American Science Writing (2003, 2005). His television appearances include &quot;ghostbusting&quot; for Penn and Teller (2005). Longing for the Harmonies, a beautiful exposition of modern physics Frank wrote with his wife Betsy Devine, was named a NY Times Notable Book of the Year and has recently been re-issued in paperback. Frank is also the author of Fantastic Realities, a &quot;playful yet profound&quot; (to quote one reviewer) collection of his short pieces on wide-ranging topics, which concludes with a family's-eye view of the Nobel adventures, drawn from Betsy's blog Funny Ha-Ha or Funny Peculiar. Early reviews have called Frank's latest book, The Lightness of Being, &quot;a lively, playful, and inventive tour de force&quot; as well as &quot;a colorful and masterful treatment of recent developments in fundamental physics.&quot; A central theme of this book is that the ancient contrast between celestial Light and earthy Matter has been transcended. In modern physics, all the stuff out there is unified into a &quot;Being&quot; more like the traditional idea of light than the traditional idea of matter. Frank grew up in Queens, NY and attended the University of Chicago. After getting his Ph.D. from Princeton, he spent time on the faculty there and at the Institute for Advanced Study, as well as at UCSB's Institute for Theoretical Physics, now the KITP. Frank is currently the Herman Feshbach professor of physics at MIT.\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:e6cf1c53b237e0e2ecdf90c56277956599bd5695","amp;dn":"Frank+Wilczek%3A+The+LHC+and+Unified+Field+Theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6cf1c53b237e0e2ecdf90c56277956599bd5695","infoHashBuffer":{"type":"Buffer","data":[230,207,28,83,178,55,224,226,236,223,144,197,98,119,149,101,153,189,86,149]},"announce":[],"urlList":[]}}