{"title":"Adam Brown - Fanatics. Power, Identity and Fandom in Football [1","uid":10476027,"size":3013395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6fd49f278587e387ccc1139d3fcab249ead512c&amp;dn=Adam+Brown+-+Fanatics.+Power%2C+Identity+and+Fandom+in+Football+%5B1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1404335076,"description":"Description\nProduct Details\nBook Title: Fanatics: Power, Identity and Fandom in Football\nBook Author: Adam Brown (Editor)\nPaperback: 289 pages\nPublisher: Routledge (July 30, 1998)\nLanguage: English\nISBN-10: 0415181046\nISBN-13: 978-0415181044\n\n===================================================================================\nBook Description\nPublication Date: July 30, 1998\nEmbracing studies of football fans across Europe, this book tackles questions of power, national and regional identities, and race and racism, highlighting the changing role of fans in the game. Combining new approaches to the study of fan culture with critical assessments of the commercialization of the game, this fascinating book offers a comprehensive and timely examination of the state of European football supporters culture as the game prepares itself for the next millennium.\nThe contributors, all leading figures in sports studies, consider:\n* whether football remains the peoples game, or if it is now run entirely by and for club owners and directors who have overseen the flotation of clubs on the stock exchange, a new focus on merchandising and the escalation of players salaries\n* the role of FIFA and UEFA in the struggle for control of world football\n* manifestations of racism and extreme nationalism in football, from the English medias xenophobic coverage of Euro 96 to the demonisation of Eric Cantona\n* media representations of national identity in football coverage in Germany, France and Spain * the interplay of national, religious and club identities among fans in England, Scotland, Ireland, Portugal and Scandinavia\n* the role of the law in regulating football\n* the future for supporters at a time when watching the match is more likely to mean turning on the television than going to a football ground.\n\n===================================================================================\nAbout the book\nWhile football has never been more popular, the rapidly-changing cultures of its supporters take an ever greater variety of forms, from the New Lad culture which produced Three Lions and Fantasy Football to the extremist ultras in Italy. Embracing studies of fandom across Europe, this text tackles questions of power, national and regional identities, race and racism, highlighting the changing role of fans in the game. From the fast painters of Denmark to the Sonvolti of Italy, the book puts Europe's fans centre stage. The opening section deals with issues of power at all levels in the game, from the floating of UK clubs on the Stock Exchange to supporters' demands for greater democracy. Focusing on the issue of racism in British and Italian football, the second section examines the take-over of Partick Thistle and offers a critical account of Euro '96, while the third examines the way national identities are represented in sports coverage.\n===================================================================================","torrent":{"xt":"urn:btih:e6fd49f278587e387ccc1139d3fcab249ead512c","amp;dn":"Adam+Brown+-+Fanatics.+Power%2C+Identity+and+Fandom+in+Football+%5B1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fd49f278587e387ccc1139d3fcab249ead512c","infoHashBuffer":{"type":"Buffer","data":[230,253,73,242,120,88,126,56,124,204,17,57,211,252,171,36,158,173,81,44]},"announce":[],"urlList":[]}}