{"title":"Roller Coaster Rampage RIP-Unleashed","uid":7381500,"size":157680790,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ea9ec11d3a141b622beeec7f91b581285b66fa06&amp;dn=Roller+Coaster+Rampage+RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2ndzone","files":1,"time":1340516025,"description":"Description: Roller Coaster Rampage revolutionizes the coaster genre by introducing on-the-fly track construction and deformation. In previous games the coaster riding experience was a passive, non-interactive experience. Roller Coaster Rampage introduces an innovative approach, and a specialized procedural coaster engine that allows players to build coasters in real-time as they ride them. Players leave behind a trail of procedurally-generated coaster tracks and supports, which then become obstacles as the player circles back. While riding players can also dynamically connect to isolated track segments like loops, cobra rolls, bat wings, and barrel rolls. With these innovative game features and engine technology players can now build coasters while enjoying a fast paced, arcade style, roller coaster racing simulator.\nFeatures:\n\nCampaign mode with 30 fast paced challenges of increasing difficulty.\nBuild your track rails in real-time through a specialized procedural game engine.\nPerform crazy stunts like corkscrews barrel rolls, outside loops, inverted loops, and more!\nLink to existing tracks including cobra rolls, loops, helix, bat wing, inverted batwing, and more!\nSoar off mammoth jumps for an extra intense, front seat, replay experience.\nCoasters can even derail, slide, and link back to track rails again.\nAddictive gameplay with preferred and alternate paths for an extended replay experience.\nFreeride mode for simply creating wild coasters to upload to the Steam community.\nAI stunt recognition. The more stunts you pull, the higher your leaderboard placement.\nWhen finished, take a front seat ride in your custom coaster design.\nDestructible environments provide extra points for leaderboard placement.\nIn game Global/Friends Leaderboard support along with Achievements and Stats.\n3D stereoscopic support including 3D Vision, side by side, and above/below modes.\n\n","torrent":{"xt":"urn:btih:ea9ec11d3a141b622beeec7f91b581285b66fa06","amp;dn":"Roller+Coaster+Rampage+RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea9ec11d3a141b622beeec7f91b581285b66fa06","infoHashBuffer":{"type":"Buffer","data":[234,158,193,29,58,20,27,98,43,238,236,127,145,181,129,40,91,102,250,6]},"announce":[],"urlList":[]}}