{"title":"The Jesus And Mary Chain - April Skies","uid":4772610,"size":138573828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb2828f458b58a73cec19d09a2443326456d4742&amp;dn=The+Jesus+And+Mary+Chain+-+April+Skies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1237100305,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Jesus and Mary Chain are a Scottish alternative rock band formed in East Kilbride in 1983. The band revolves around the songwriting partnership of brothers Jim and William Reid. They released a string of albums, singles and EPs between their 1983 formation and their 1999 breakup, and gained notoriety in their early days for short sets and violence that became common at their live shows. In 2007 the band reunited and began working on a new album.\n\nIn September 1986, the band parted ways with manager Alan McGee, and came close to splitting up later in the year, with Jim Reid suffering from &quot;exhaustion&quot;. John Moore had become an established member, but moved to rhythm guitar, with former Redskins member Martin Hewes joining the band briefly and former Dead Can Dance percussionist James Pinker taking over on drums. Blanco y Negro manager Geoff Travis took over management duties, and the band returned in December with two gigs at the National Ballroom in Kilburn, where they premiered new songs including &quot;April Skies&quot; and &quot;Don't Get Hit&quot;. Early in 1987, they entered the studio to record their second album. The first fruits of these sessions were released on the &quot;April Skies&quot; single in April, which saw the band have their first top ten hit. The Beach Boys influence weas evident on the B-side, which included &quot;Kill Surf City&quot;, a reworking of Brian Wilson's &quot;Surf City&quot;. The various formats released also included a cover of Bo Diddley's &quot;Who Do You Love?&quot;, a tribute to him with &quot;Bo Diddley is Jesus&quot;, and a live version of Can's &quot;Mushroom&quot;. &quot;Happy When It Rains&quot; was the second pre-album single, strongly influenced by Smokey Robinson's &quot;My Girl&quot;, but it failed to match the success of &quot;April Skies&quot;, only reaching number twenty-five. The band set out on another UK tour, this time with sets stretching to 45 minutes, although to a mixed reaction from the music press. They toured without a drummer, instead using a drum machine.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:eb2828f458b58a73cec19d09a2443326456d4742","amp;dn":"The+Jesus+And+Mary+Chain+-+April+Skies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb2828f458b58a73cec19d09a2443326456d4742","infoHashBuffer":{"type":"Buffer","data":[235,40,40,244,88,181,138,115,206,193,157,9,162,68,51,38,69,109,71,66]},"announce":[],"urlList":[]}}