{"title":"Firecreek 1968 DvdRip Avi Lee1001","uid":9947131,"size":734398508,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb517c131049520e28848db57e9f417d0559b041&amp;dn=Firecreek+1968+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1397330338,"description":"Firecreek 1968 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0062975/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0062975/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Firecreek&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Firecreek&lt;/a&gt;\nFebruary 22, 1968\nFirecreek' Has Stars\nHOWARD THOMPSON.\nPublished: February 22, 1968\n&quot;FIRECREEK&quot; is a good, sturdy and occasionally powerful little Western. James Stewart is plain wonderful and Henry Fonda almost matches him. For some strange reason those peerless veteran cowboys have never appeared on the same movie prairie before, only once together in a 1948 comedy called &quot;On Our Merry Way.&quot; To see what they, a fine cast and a dandy new director have accomplished on a small patch of ground has been worth the twenty-year wait.\n\nThis unpretentious little color movie, which looks as though it cost a dime, is almost exactly right every step of the way, with Mr. Stewart as a peaceful farmer aroused to wrath when five killers terrorize a tiny, quaking community. That's &quot;Firecreek&quot; (and what a grand title!), just a wide place in the road. Warner Brothers-Seven Arts opened it yesterday in circuit showcases.\n\nIn a cold light, the film is a kind of vest-pocket &quot;High Noon,&quot; with Mr. Stewart as a part-time sheriff and the culprits, led by Mr. Fonda, arriving in town at the outset. The place is a dusty dot, quietly inhabited by a few old or defenseless folk. With Mr. Fonda partially disabled, his animalistic pals make mischief that leads to murder and a hanging, until a climactic gun battle takes place between the two stars. It sounds familiar, as it certainly should.\n\nBut the beauty of this picture is its professional and genuine simplicity, the way nearly every line of dialogue has been made to count, either limning a characterization or edging the action forward. Calvin Clements, the scenarist and a man who knows people, is attacking complacency about evil head-on.\n\nAnd if the villagers seem more than types they are also well-played by an uncommonly impressive and unglittery cast of familiar, unfamiliar and new faces, from J. Robert Porter, as a brave, dim-witted stable boy, to Inger Stevens, as a disillusioned spinster. Dean Jagger, Ed Begley and Jay C. Flippen are capable as ever, and credit should go to briefer work by Barbara Luna, Louise Latham and Jacqueline Scott.\n\n&quot;Firecreek&quot; also marks the first film directed by Vincent McEveety, from television, and let's hope he makes more. Mr. McEveety starts at a deliberate, casual pace, whips up a chilling crescendo and stages a shoot-'em-up climax that's a graphic beaut. This sequence is something to see, with the wounded, hobbling Mr. Stewart almost berserk with righteous rage.\n\nAnd pitted against each other at the end, Mr. Stewart and Mr. Fonda, as a ruthless, enigmatic loner, play like flint on steel. Small-size &quot;Firecreek,&quot; sparked by two veteran aces, makes a little go a long, long way.\n\nFonda used to shake his head when reminded of this film. Any man who tries to kill Jimmy Stewart, he said, has to be marked as a man who's plain rotten. But it's a must, boys and girls.\n\nVIDEO\nSize.... 700mb\nDuration.... 01:17:24\nCodec.... divx\nFrame Width..... 608\nFrame Height.... 256\nData Rate....870kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 70kbps\n1 Channel mono\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:eb517c131049520e28848db57e9f417d0559b041","amp;dn":"Firecreek+1968+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb517c131049520e28848db57e9f417d0559b041","infoHashBuffer":{"type":"Buffer","data":[235,81,124,19,16,73,82,14,40,132,141,181,126,159,65,125,5,89,176,65]},"announce":[],"urlList":[]}}