{"title":"Testosterone - Sex, Power and the Will to Win (2015) Gooner","uid":12722943,"size":2430314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebb10b7c532671f61259128f654489c8223aafc3&amp;dn=Testosterone+-+Sex%2C+Power+and+the+Will+to+Win+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1447012087,"description":"Testosterone - Sex, Power and the Will to Win - 1st Edition (2015).pdf Gooner\r\n\r\nPublisher: Oxford University Press; 1 edition (June 30, 2015)\r\nLanguage: English\r\nISBN-10: 0198724977\r\nISBN-13: 978-0198724971\r\n\r\nWe inherit mechanisms for survival from our primeval past; none so obviously as those involved in reproduction. The hormone testosterone underlies the organization of activation of masculinity: it changes the body and brain to make a male. It is involved not only in sexuality but in driving aggression, competitiveness, risk-taking - all elements that were needed for successful survival and reproduction in the past. But these ancient systems are carried forward into a modern world. The ancient world shaped the human brain, but the modern world is shaped by that brain. How does this world, with all its cultural, political, and social variations, deal with and control the primeval role of testosterone, which continues to be essential for the survival of the species? Sex, aggression, winning, losing, gangs, war: the powerful effects of testosterone are entwined with them all. These are the ingredients of human history, so testosterone has played a central role in our story.\r\n\r\nIn Testosterone, Joe Herbert explains the nature of this potent hormone, how it operates in mammals in general and in humans in particular, what we know about its role in influencing various aspects of behavior in men, and what we are beginning to understand of its role in women. From rape to gang warfare among youths, understanding the workings of testosterone is critical to enable us to manage its continuing powerful effects in modern society","torrent":{"xt":"urn:btih:ebb10b7c532671f61259128f654489c8223aafc3","amp;dn":"Testosterone+-+Sex%2C+Power+and+the+Will+to+Win+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb10b7c532671f61259128f654489c8223aafc3","infoHashBuffer":{"type":"Buffer","data":[235,177,11,124,83,38,113,246,18,89,18,143,101,68,137,200,34,58,175,195]},"announce":[],"urlList":[]}}