{"title":"Rolling Stones DVD1","uid":3640577,"size":2697891303,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebbc914b42edbc2f4e74a6e205514dc5b2de92c6&amp;dn=Rolling+Stones+DVD1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mr.Cheese","files":1121,"time":1174142684,"description":"Har samlat mina album till dvd.\nHar du laddat ned nÃƒÂ¥gon eller nÃƒÂ¥gra av dessa tidigare kan du enkelt komplettera.\nLÃƒÂ¤s bara in dem under respektive album och fortsÃƒÂ¤tt sedan nedladdningen.\nDVD 1 innehÃƒÂ¥ller\nCD1 = 1964-1970\thttp://thepiratebay.se/tor/3224122/Rollings_Stones_64-70\nCD2 = 1971-1980 http://thepiratebay.se/tor/3224195/Rolling_Stones_71-80\nCD3 = 1981-1990 http://thepiratebay.se/tor/3256777/Rolling_Stones_81-90\nCD4 = 1991-1998 http://thepiratebay.se/tor/3275827/Rolling_Stones_91-98\n\nDvd 2 innehÃƒÂ¥ller mtrl som jag inte tidigare hunnit med att lÃƒÂ¤gga upp.\nJag gjorde dessa album under min konvalescens efter den andra trafikolyckan 1998.\nDÃƒÂ¤rav att de fÃƒÂ¶rsta skivorna innehÃƒÂ¶ll musik tom 1998.\nFick en ny syn pÃƒÂ¥ livet. Lever och har en underbar familj. Samt ÃƒÂ¤r numera en nybliven morfar.\n\nAtt det ÃƒÂ¤r rippat med 128 kb beror pÃƒÂ¥ att CD-skivor dÃƒÂ¥ fortfarande var ganska dyra.\nJag har ocksÃƒÂ¥ lagt till de lÃƒÂ¥tar som saknades i &quot;90x The Rolling Stones - Atlantic City '89 (Live)&quot;.\n\nCD8 i DVD 2 innehÃƒÂ¥ller de 3 officiella album som tillkommit.\n\nAlla album kan brÃƒÂ¤nnas separat pÃƒÂ¥ CD. Eller allt pÃƒÂ¥ en DVD.\nI Nero ÃƒÂ¶ppna mappen DVDX och tag sedan innehÃƒÂ¥llet och lÃƒÂ¤gg till.\nVill du brÃƒÂ¤nna pÃƒÂ¥ CD ÃƒÂ¶ppnar du det album du vill ha. Filerna och mapparna ska ligga pÃƒÂ¥ roten pÃƒÂ¥ skiva.\nDÃƒÂ¥ fÃƒÂ¥r du funktionen autostart.\n\n===============================\n\n\nI have gathered my CD-album to DVD.\nIf you already have downloaded one or more of these you can simply complete.\nJust upload the album in respectively album and then continue downloading\nDVD 1 contains\nCD1 = 1964-1970\thttp://thepiratebay.se/tor/3224122/Rollings_Stones_64-70\nCD2 = 1971-1980 http://thepiratebay.se/tor/3224195/Rolling_Stones_71-80\nCD3 = 1981-1990 http://thepiratebay.se/tor/3256777/Rolling_Stones_81-90\nCD4 = 1991-1998 http://thepiratebay.se/tor/3275827/Rolling_Stones_91-98\n\nDVD 2 has material that I haven't had time to upload earlier.\nI did these albums under my convalescence after the second traffic-accident 1998. \nSo I got a new (bright) view of life. Lives and have a lovely wife and two marvellous daughters. Plus now I?m also grandfather. The life goes on.\n\n128 kb/s depends on that media was relative expensive at the time.\nI have also added missing tracks in &quot;90x The Rolling Stones - Atlantic City '89 (Live)&quot;.\n\nCD 8 in DVD 2 contains the 3 official albums that have arisen.\nAll albums can be burned separately on a CD. Or everything on a DVD.\nIn Nero open folder DVDX and grab all files and album and add.\nDo you want to burn a CD just open that folder and the contents.\nNote that all files and album must be on the root-level. The function auto start will work.\n\n\n********************************************************************************************\n\n\nIt was in the mid 60ies, 1964 to be exact. The summer passed quietly. People lay sunbathing on the beach, well actually it was varamonbadet (the Varamo Swimming Bath) in Motala town, but even so it wasn't too bad. And there was plenty of new, very different music. The transistor radio was all the rage. Walkman, MD players were all a figment of the imagination. Tape-recorders could be seen, cassette players were not invented. Instead it was about a radio, a Luxor about 1 kg (2 lbs) heavy. It was manufactured, by the way, about 3 km (2 miles) from the beach. In those days, in 1964, Luxor still made radios and television sets. At home people listened to the gramophone - mono sound. Stereo was just for a few lucky people. Stereo radio would take a while longer to become every man's property. And there were tape recorders. Even that had mono sound. I bought my first stereo tape recorder in 1966.\n\nYouth programmes and music were rationed. P3 wasn't broadcast like today. You had to wait for Saturday afternoon to come. And then you listened to Top Ten\n\nBeatles, Them with Van Morrison, Dave Clark Five, Hollies were some of the favourites.\n\nThe sand was passing through the fingers, the gravel or more precisely, The Stones were on their way to be famous in Sweden.  The song &quot;It's all over now&quot; came in July. The Rolling Stones had made their entry in Sweden and to the Top Ten list. At best that song came second and was on the list for 12 weeks. In September &quot;Around and Around&quot; came with at best, a third position and was on for 11 weeks. The Rolling Stones-fever had come to stay, not just in Motala or Sweden but in other parts of the world.\n\nA couple of years earlier people had chosen to be Elvis Presley fans or Tommy Steele fans\nNow it was Beatles or Stones. Not that the Stones were that fantastic as musicians, but they came with a new style that caused a great stir. They were loud and troublemakers. And they would remain that way. They were introduced, a little on purpose, as the mean twins of the Beatles, sleazier, angrier and meaner, and not always totally clean. \n\nOne could say that the group ceased to exist, to some extent at any rate, in 1969, when \nMick and Keith forced Brian Jones to leave the group because of his drug problems.\nAs if he was the only one that he was a drug user! The name of the group was Brian's idea. He had even introduced some new instruments and new musical styles. \nBrian was later found drowned in his own swimming pool. In November they released\n &quot;Let It Bleed&quot;, possibly their best album. \n\nAnyway, here you find most of what has been released during a number of years. In the beginning the material wasn't very original, but had been borrowed from R&amp;B. You will also find some songs which have been published a number of times in different albums. I have not taken any notice of that, but have endeavoured to include as many albums as possible. The result was a number of CD's in MP3 format.\n\n&quot;Here you are!&quot; or &quot;Here we go again!&quot; \nFirst DVD with Rolling Stones albums.\n\nSmile\nMr Cheese \n","torrent":{"xt":"urn:btih:ebbc914b42edbc2f4e74a6e205514dc5b2de92c6","amp;dn":"Rolling+Stones+DVD1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebbc914b42edbc2f4e74a6e205514dc5b2de92c6","infoHashBuffer":{"type":"Buffer","data":[235,188,145,75,66,237,188,47,78,116,166,226,5,81,77,197,178,222,146,198]},"announce":[],"urlList":[]}}