{"title":"Cyber Update Apr.2012--------HT-20663 Remy LaCroix","uid":7169531,"size":310285232,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ec8e33df912b248959092aaf20e3541efc49ac31&amp;dn=Cyber+Update+Apr.2012%5C--------HT-20663+Remy+LaCroix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1333912915,"description":"Cyber Update Apr.2012HT-20663 Remy LaCroix   + Pics\n\n\nBound on her knees, legs spread, like a good slut, the first thing we get to see is her nice round ass flogged. Add a vibrator to her cunt hole and a nice predicament is created. Matt switches between pain an pleasure. Her body twitches and leans into the vibrator as much as she can get it from him. Yanking on her neck rope, he pulls Remy down further to meet the vibrator.\n\n\n&quot;You want to cum? Then shut up.&quot; Matt says in response to her whining from having her feet caned. He gives her a nice hard stroke then tells her to come and get the orgasm. As a reward Matt vibes her clit and slides a nice fat dick on a stick into her very tight asshole. &quot;Do you know what this is called Dear? Anal training.&quot; He adds more lube to the dick then goes for her ass without any coddling.\n\n\nShe takes it like a champ... like a real hot porn star should. Oncer her ass is filled with the nice big cock, he adds one to her pussy, double penetrating her with absolutely no space left in either hole. Her hot body takes it all. He gives her a nice hard orgasm, 3 in fact, but he is not done with her ass yet.\n\n\nMatt sticks a nice cold anal hook into her ass, making her keep her ass in the air and goes after her with the vibrator again. He says &quot;there is nothing you can do, you might as well give in&quot; to the orgasm. She begs and cums and cums and cums. She begs for it to stop. Matt is not interested in stopping. You will have to watch for the rest of the action... and listen to their intense dialogue. Its incredibly hot!\n\n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=20663&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=20663&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:ec8e33df912b248959092aaf20e3541efc49ac31","amp;dn":"Cyber+Update+Apr.2012%5C--------HT-20663+Remy+LaCroix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec8e33df912b248959092aaf20e3541efc49ac31","infoHashBuffer":{"type":"Buffer","data":[236,142,51,223,145,43,36,137,89,9,42,175,32,227,84,30,252,73,172,49]},"announce":[],"urlList":[]}}