{"title":"Ambient Design ArtRage v2.5.20+Keygen","uid":4382208,"size":14840745,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ecd259ddf0c5782c74dbbd3d44ef3733e394f819&amp;dn=Ambient+Design+ArtRage+v2.5.20%2BKeygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vibept","files":7,"time":1220717720,"description":"The easy to use, stylish painting package that lets you get painting \nfrom the moment you open it up. You can paint with oils, sketch with \npencils, sprinkle glitter, and more. You can paint with gold leaf, \nsilver foil, and other metallic colors. You can even load in your \nphotos as Tracing Images to help you recreate them as paintings.\nFor the professional user, ArtRage also offers multiple Layers for \npainting, and layered PSD document import and export so you can easily \nuse it alongside your existing tools.\n\n::Painting Tools::\n\n *Oils\n *Pencils\n *Airbrush\n *Chalk\n *Glitter\n *Roller\n *Tube\n *Cryon\n *Markers\n \nEach of the tools in ArtRage is designed to work like its real world \ncounterpart (minus the smell of paint thinners, and that piece of \nglitter you just can?t get out of the carpet).\n\nThick paint smears and blends, pencils and chalks smudge, and markers \nwork just like they do in the real world. Many of the tools can be \nadjusted to give different effects. You can paint with thinned oils, \nuse wet or dry markers, soften your pencil and control the hardness of \nthe crayon, and much more.\n \nStencils and Rulers.  \nStencils and rulers let you make precise shapes and lines while still \npainting freehand. Place down as many stencils as you like, then paint \nover them and the paint will only touch the canvas through the holes. \nLay down rulers and have the brush stick to their edges to create \nstraight lines or smooth curves with any of the ArtRage tools.\n\nMetallics.  \nBy turning on the Metallic Paint option, you can work with spreadable, \nblendable gold and silver oil paints, sparkling glitter, silver leaf \nsprays and more. Any of the ArtRage tools can be switched to Metallic \nmode for a wide range of different effects.\nMetallic paint still blends with normal paint, and smears and smudges \njust as easily. Thin metal coating can be applied to any texture using \nthe airbrush, or you can build up thick metal lumps using the Tube tool \nand Oil Brush to add more depth to your metallic image.\n\nTracing Images and References.  \nArtRage makes it easy to recreate photos or other images using its paint \ntools. When you load a Tracing Image the original is projected on to \nyour canvas so that you can use it as a guide while you sketch and paint.\nBetter still, you can tell ArtRage to choose the correct colour for you, \nso that when you start to paint you know the colour you?re getting is the \nright one for where you?re painting in the image.\nFor users who just want a reference while painting, you can pin an image \nto your canvas and scale, rotate and position it as required.\n \nOther Features.  \n \nMetallic paint still blends with normal paint, and smears and smudges \njust as easily. Thin metal coating can be applied to any texture using \nthe airbrush, or you can build up thick metal lumps using the Tube tool \nand Oil Brush to add more depth to your metallic image.\n \nMore Features.\n\nLayers: Paint on transparent layers to build up more complex images \nwithout the paint blending with your underlying work. The texture of \nthe underlying paint will still show through, as if it were dry on \nyour canvas. ArtRage also provides full support for all 23 Photoshop \nlayer blend modes.\nPSD Support: Import and export PSD files, with their layers intact.\nCustom Colours: Load and save custom colour set and colour pickers to \nfine tune your colour work.\nCrop &amp; Resize: Crop and resize your paintings during work.\nSimple, Intuitive Interface: The ArtRage interface is easy to under-\nstand and doesn?t get in the way of your work. In fact, it even gets out \nof the way while you?re painting...\nCustomisable Canvases: Change the grain, colour, and even metallic nature \nof your canvas at any time during your work.\nCanvas Positioning: Move, Scale, and Rotate the canvas to your preferred \nangle.\nTablet Support: ArtRage uses your tablet?s pressure and tilt support \nwhere available.\nTool Cursors: Every tool has a cursor that tells you exactly how big the \ntool head is, to make it easier to see what?s going to be applied.\nMulti-Monitor Support: ArtRage supports multi-monitor systems.\n\n","torrent":{"xt":"urn:btih:ecd259ddf0c5782c74dbbd3d44ef3733e394f819","amp;dn":"Ambient+Design+ArtRage+v2.5.20%2BKeygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd259ddf0c5782c74dbbd3d44ef3733e394f819","infoHashBuffer":{"type":"Buffer","data":[236,210,89,221,240,197,120,44,116,219,189,61,68,239,55,51,227,148,248,25]},"announce":[],"urlList":[]}}