{"title":"Amateur.Introductions.12.XXX.DVDRip.x264-XCiTE","uid":10708989,"size":1707471015,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:edbedc41f8ce229d9dec812d31d80a183e930a22&amp;dn=Amateur.Introductions.12.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":6,"time":1407332664,"description":"Where nice girls come to swallow cum!\nAimee Addison is a gorgeous professional model that was recently featured in Penthouse. This is her very first hardcore scene and she can really work a cock. She takes my cock into her gorgeous wet mouth, and then I fucked her amazing tight pussy. I shoot a thick river of cum into her mouth and watch is slide right down her throat. Awesome!\nBrooke Van Buren is a very cute 18 year old waitress from Pennsylvania. On vacation in California she met Ray at a club. Brooke agreed to show off her oral skills for the very first time on camera. After a good fuck and suck fest, Ray unloads in Brooke's hot mouth. She gulps him down with a cute smile. I think you will love the second cum shot as well!\nLexi Diamond is only 18 years old and is very naughty. She's a petite hottie with a tight body that loves to swallow cum. She pulls out Rays cock and starts sucking. Then Ray pounds her tight little shaved pussy before he dumps a huge load of jizz into her mouth.\nAnna Stevens is a gorgeous blonde mainstream model. She is 5 ft 10 inches tall and she is 22 years old. She wants to move into the adult marketing world and asks me to give her a chance. I am more than willing to let this beautiful babe suck my cock. Watch her swallow two big cum shots.\nJolie is 18 years old and works at a bookstore. She is 5' 8' tall with really pretty eyes. Jolie came to me because she needed a little adventure and excitement. I sent her over to my buddy Ray. He shows her a great time and slides his big cock down her sweet little throat.\nMia Lina is a very cute, 20 year old student. A college friend of hers, that is already on the site, sent her over to audition for Amateur Allure. Mia really sucks cock very well and of course chugs down two big loads. She even gets her lil shaved pussy banged.\nAlyssa is 18, and has an enormous 38DD chest. This is Alyssa's first scene ever. She has never ever been naughty on camera before and has a lot to learn, so I give her some pointers. She does her best swallowing my cock and gulps down two big loads!\n\nBrooke Van Buren,Lexi Diamond,Mia Lina,Aimee Addison,Alyssa,Jolie,Anna Stevens\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=79084161202627124806.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=79084161202627124806.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=61077578925313261888.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=61077578925313261888.jpeg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:edbedc41f8ce229d9dec812d31d80a183e930a22","amp;dn":"Amateur.Introductions.12.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edbedc41f8ce229d9dec812d31d80a183e930a22","infoHashBuffer":{"type":"Buffer","data":[237,190,220,65,248,206,34,157,157,236,129,45,49,216,10,24,62,147,10,34]},"announce":[],"urlList":[]}}