{"title":"RailWorks - DB Class E18","uid":6614013,"size":44845688,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f03223803c59fc8a02ca0c32effb8f9e9633e55b&amp;dn=RailWorks+-+DB+Class+E18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RailGamer","files":-1,"time":1313710042,"description":"About the Game\nThe E18 is a German electric locomotive built from 1935 to 1939, and again briefly from 1954 to 1955. The design was based on the earlier E17, which had been a major step forward over slower previous electric locomotives. Thanks partly to its basic streamlining, the E18 was an even better performer with a top speed of 150km/h, despite weighing a hefty 108 tons. Following World War 2, the E18 was operated in West Germany and Austria, though much of the electrified lines in East Germany were unusable so some examples remaining in East Germany were sold to West Germany's Deutsche Bundesbahn. A total of 55 examples were built, and incredibly the E18 remained in service until 1984 with 6 remaining in preservation today. This add-on also includes the Class 151, an electric heavy freight locomotive built for German Federal Railways between 1972 and 1978. With a top speed of 120km/h, the Class 151 was designed to replace the aging Class 150 which was increasingly struggling to meet the greater demands placed upon it. It was designed to haul both freight and passenger trains, but is now unable to operate passenger services because it no longer meets passenger train safety equipment standards. A total of 170 Class 151 locomotives were ordered, with some still in service today.\n\n\nIncludes:\nE18 locomotive in green and blue liveries\nBR151 locomotive in green livery\nGbs254 freight wagon\nOmm52 freight wagon\nSilber-Coach Class 1/2 coach\nSilber-Coach Class 2 coach\nEnglish and German manuals\n12 standard scenarios","torrent":{"xt":"urn:btih:f03223803c59fc8a02ca0c32effb8f9e9633e55b","amp;dn":"RailWorks+-+DB+Class+E18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03223803c59fc8a02ca0c32effb8f9e9633e55b","infoHashBuffer":{"type":"Buffer","data":[240,50,35,128,60,89,252,138,2,202,12,50,239,251,143,158,150,51,229,91]},"announce":[],"urlList":[]}}