{"title":"Conduit 2 (Wiimmfi Patched For Online)","uid":11195133,"size":4133486592,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:f09194d100613d10b96a4fe94d88984494115b86&amp;dn=Conduit+2+%28Wiimmfi+Patched+For+Online%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1413075164,"description":"Conduit 2 is a first-person shooter video game developed by High Voltage Software. It is the sequel to The Conduit.\nThe game makes use of the Quantum3 engine, a game engine designed by High Voltage Software specifically for the Wii. The engine allows effects such as bump mapping, reflection and refraction, and gloss and detail mapping to be implemented. Conduit 2 supports a wide variety of peripherals such as Wii MotionPlus, Classic Controller, Classic Controller Pro, and the PDP Headbanger Headset.\nConduit 2's single player mode has had many changes. Players now have the ability to flip over objects such as tables, bookshelves and soda machines to use as cover. A sprint button allow players to charge or flee from opponents. At the beginning of levels, players can choose their weapon loadouts, and customize their character's appearance and ability upgrades.The use of iron sights has been implemented, and grenades explode on a timer.Levels are less &quot;corridor-based&quot; in design, with multiple paths to explore.Enemy AI has been enhanced; to make them appear more lifelike. The enemies can flip and knock over things like tables for makeshift cover, and enemies blind fire when players aim at them while they're behind cover.The enemies possess randomized weapons. The enemy AI behavior also changes depending on which weapon they have. For example, a foe with a shotgun will attempt to run up to the player to shoot him at close range, while a foe with a rifle will hang back and shoot from afar. Enemies dive out of the way of fragmentation grenades and attempt to suicide bomb the player when stuck with a radiation grenade. Conduit 2 features 23 enemy types.\n\nMultiplayer\n\nAlong with a standard single-player and multiplayer online modes, the title features four-player split-screen multiplayer with offline and online modes.The online element features &quot;increased security&quot; over the first game to prevent hackers. Bounty Hunter mode returned from the first game, as well as a new Co-op mode which features &quot;Invasion Mode&quot;, in which players combat waves of enemies on the same console in split-screen mode. The game allows up to 12 players to battle online, and was one of the first Wii games to support the PDP Headbanger Headset.\nConduit 2 also features a female NP C skin for multiplayer, which was absent in the first game. Conduit 2 features a currency system that allows players to earn experience points and medals that can be used to purchase weapons, upgrades and armor pieces to alter their characters look.[8][26] A new voting system has been implemented into the multiplayer which allows players to choose between two online maps and game types when the player enters the lobby for a specific mode. There is also a playlist featuring no radar and no lock-on.\nThis game was Wii mm-fi patched to allow online play/interactions even after Nintendo Wi-fi Shutdown. For more info check here: &lt;a href=&quot;\nhttp://wiki.tockdom.com/wiki/Wiimmfi_Project&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiki.tockdom.com/wiki/Wiimmfi_Project&lt;/a&gt; &lt;a href=&quot;\nhttp://wiimmfi.de/stat?all=1&amp;test=sep&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiimmfi.de/stat?all=1&amp;test=sep&lt;/a&gt;\nThis torrent contains a Nintendo Wii Game in WBFS format, which is actually just a compressed ISO image that your Wii reads directly from a hard drive via these Usb Loaders. (CFG Loader/ USB Loader GX)","torrent":{"xt":"urn:btih:f09194d100613d10b96a4fe94d88984494115b86","amp;dn":"Conduit+2+%28Wiimmfi+Patched+For+Online%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f09194d100613d10b96a4fe94d88984494115b86","infoHashBuffer":{"type":"Buffer","data":[240,145,148,209,0,97,61,16,185,106,79,233,77,136,152,68,148,17,91,134]},"announce":[],"urlList":[]}}