{"title":"Bum Fights: The Trilogy","uid":5269500,"size":702284107,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0a686929936d366898dd6f6d7acebcdba31cd5a&amp;dn=Bum+Fights%3A+The+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gofreemovies","files":1,"time":1262997864,"description":"Bumfights\nFrom Wikipedia, the free encyclopedia\n\n\nBumfights is a film series created by Indecline Films. The videos feature homeless men (most notably Rufus Hannah and Donnie Breenan) in the San Diego and Las Vegas metropolitan areas fighting and attempting amateur stunts in exchange for money, alcohol, and other incentives. The first video, Bumfights: A Cause for Concern, was produced by Ryan McPherson, with friends Zachary Bubeck, Daniel J. Tanner, and Michael Slyman, as Indecline Films. Shortly after sales began to escalate, Indecline Films sold the rights to two investors,[1] who went on to produce three sequels.\n\nThe videos immediately gained criticism from mainstream organizations. The US-based National Coalition for the Homeless (NCH) has stated that the Bumfights videos disseminate hate against the homeless and dehumanize them.[2] In April 2006, the four original filmmakers agreed not to produce any more &quot;Bumfights&quot; videos or distribute videos already made, and to pay three homeless men depicted in the videos, under a settlement announced as a lawsuit was to go to trial.[3]\n\n \nBumfights: A Cause for Concern (2002) \nBumfights 2: Bumlife (2003) \nBumfights 3: The Felony Footage (2004) \n \n\n\n\nControversies\nThe videos have proven to be highly controversial. They have been banned in a number of countries including the United Kingdom, Canada, and New Zealand. The internet auction site eBay routinely cancels listings which contain copies of the video, citing their policy which prohibits the sale of materials which promote or glorify violence.[4] In the state of California, both felony and misdemeanor charges were filed against the producers, as well as civil lawsuits; in 2005,[5] the producers were sentenced to six months in prison for having failed to complete the community service to which they had previously been sentenced.[citation needed] The filmmakers maintain that the production of the video was a mutually beneficial arrangement and that the homeless people depicted freely chose to participate.[6]\n\nThe films have likewise been blamed for inspiring a number of violent teenage attacks on the homeless, both in the United States[7] and other countries[citation needed]. A group of suburban Nevada teenagers, who took on the moniker &quot;311 Boyz&quot;, also faced criminal charges, including attempted murder, after filming several violent exploits inspired by Bumfights. The suspects attempted to make a profitable video by instigating fights around their neighborhoods, in some instances imposing on unwilling participants.\n\nProducers: Indecline\nRyen McPherson, who sold the rights to Bumfights after only the first installment, moved on to produce a similar reality video called Indecline: Volume One - It's Worse Than You Think. [8] Though controversial for its fight footage and acts of elaborate graffiti art, legal troubles did not hinder the sales of this video, although the website went offline in June 2008. The indecline web site went back online on November 2008. [1]\n\nIndecline also acted as a record label for a few underground acts, most notably the abstract hip-hop duo Ninth Cloud. [9]\n\n\n\n- Popular culture\nIn 2005, The Daily Show with Jon Stewart, had a segment featuring Bumvertising, in which they made a comparison to Bumfights, showing a video clip of two bums fighting. The episode of The Daily Show was titled 'Face For Rent'. \nIn one episode of the 2003 remake of Dragnet, the case investigated is strongly based on the Bumfights videos (called &quot;Bum Wars&quot; in the episode). \nIn the episode of American Dad, Threat Levels, Stan begins a Bumfights Federation for himself, staging Bumfights on his own street, in a wrestling ring and giving the competitors professional wrestling-style personas and nicknames. \nA Scottish version of Bumfights titled &quot;Jaikie Japes&quot; was initially released on the independent label Beefheart Films, but has now been deleted due to threats of civil actions. \nThe December 12, 2006 episode of Dr. Phil featured Bumfights producer Ty Beeson. Dr. Phil McGraw had stopped the tape and requested that the producer leave the set (though he was taken off the set by uniformed Paramount Studios security guards), stating he refused to &quot;publicize&quot; the subject because he claimed the short video was despicable. Debate, however, has arisen as to why the segment, which featured clips from the videos, was not edited from the show if Dr. Phil truly wished to deny the videos publicity. It's worth mentioning that Beeson dressed like Dr. Phil himself, even shaving the top of his head as male pattern baldness and growing a mustache, in open mockery of the host.[10] \nIn the show Arrested Development, George Sr. forces his sons to fight on camera and sells the videos, calling the series Boyfights. \nThe episode &quot;Return of the Kane&quot; of Veronica Mars features the character Logan Echolls staging Bumfights. \nIn episode 2 of the TV series Nathan Barley, Nathan finds a web site parody of Bumfights called Tramp Racing. \nIn the mockumentary LolliLove, about giving lollipops to the homeless, James Gunn writes in his diary about wanting to see Bumfights. \n\n\nReferences\n- \nRyen McPherson Q&amp;A Part 2 [Bumfights / Indecline / King of the Jews ] - Polly Staffle - Movie &amp; DVD Reviews \n^ National Coalition for the Homeless \n^ SignOnSanDiego.com &gt; News &gt; Metro - Homeless men in 'Bumfights' get settlements over video \n^ http://pages.ebay.com/help/policies/offensive.html#what \n^ http://www.businessethics.ca/blog/2006/09/exploitative-videos-bumfights-girls.html \n^ http://www.reviewjournal.com/lvrj_home/2002/May-05-Sun-2002/news/18662641.html \n^ &quot;Killer cites 'Bumfights' as influence&quot;. http://www.sptimes.com/2006/09/30/State/Killer_cites__Bumfigh.shtml. Retrieved 2008-08-21.  \n^ Default PLESK Page \n^- (n1nth)cloud - Denver (soon to be mountains of utah), Colorado - Indie / Hip Hop / Electronica -\n^ &quot;'Bumfights' creator no match for Dr. Phil&quot;. http://www.upi.com/Entertainment_News/2006/12/16/Bumfights_creator_no_match_for_Dr_Phil/UPI-14371166291605/. Retrieved 2007-11-12.  \n[edit] External links\nIndeclineFilms \nReview of the video at Rotten.com \nBumfights: Cause for Concern at the Internet Movie Database \nInterview with Bumfights creator Ryan McPherson \nQ&amp;A with Bumfights creator Ryen McPherson before serving jail sentence \nHomeless men in 'Bumfights' get settlements over video - SignOnSanDiego.com \nVideo of Dr. Phil Kicking Ty Beeson off his show' \nRetrieved from &quot;http://en.wikipedia.org/wiki/Bumfights&quot;\n\n\nI will seed up to 6.0 ratio. After that peers will be responible for seeding.","torrent":{"xt":"urn:btih:f0a686929936d366898dd6f6d7acebcdba31cd5a","amp;dn":"Bum+Fights%3A+The+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a686929936d366898dd6f6d7acebcdba31cd5a","infoHashBuffer":{"type":"Buffer","data":[240,166,134,146,153,54,211,102,137,141,214,246,215,172,235,205,186,49,205,90]},"announce":[],"urlList":[]}}