{"title":"CMT Crossroads Reba McEntire and Kelly Clarkson","uid":3728894,"size":319853007,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f1a8147859a90b5a83cf0594a52b3c8008f16c24&amp;dn=CMT+Crossroads+Reba+McEntire+and+Kelly+Clarkson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vette86pc","files":2,"time":1183229921,"description":"Two dynamic women. Two powerhouse voices. Put them together and you have an electrifying combination. CMT Crossroads: Kelly Clarkson and Reba McEntire pairs America&amp;#039;s first Idol with a country music icon for a riveting performance. The concert features the two superstars sharing the spotlight and taking turns on each other&amp;#039;s songs.\n\nTaped at the legendary Ryman Auditorium for an invitation-only audience, the performance marked Clarkson&amp;#039;s first appearance at the famous venue. The platinum-selling pop star recently collaborated with the country icon on McEntire&amp;#039;s upcoming duets project, Reba Duets. The first single from that album is their recording of Clarkson&amp;#039;s hit, &quot;Because of You.&quot; The duet was the natural culmination of a friendship that began five years ago when Clarkson made her admiration of McEntire known to the world. CMT Crossroads provides the perfect platform for these two talented women to showcase their music and their friendship.\n\nBoth singers are known for recording honest songs with raw emotion. During the taping, the pair had the audience on its feet with their super-charged versions of &quot;Walkaway,&quot; &quot;Why Haven&amp;#039;t I Heard From You,&quot; &quot;Since You&amp;#039;ve Been Gone&quot; and &quot;Fancy.&quot; Special moments include their emotional performance of &quot;Because of You.&quot; In the intimate interview, Clarkson talks about working with her idol and what she likes about her voice. McEntire discusses her career and her favorite song of Clarkson&amp;#039;s.\n\nMcEntire has garnered 33 No. 1 hits, twelve Academy of Country Music awards, seven Country Music Association Awards and two Grammys. Her many awards for acting include a Golden Globe nomination and a People&amp;#039;s Choice Award. She was the first female country artist since Patsy Cline to sell 5 million copies of one record. Her first professional gig was singing &quot;Jesus Loves Me&quot; for a nickel at the age of 4.\n\nClarkson catapulted to fame after her friend encouraged her to audition for a new television show called American Idol. Her debut album, Thankful, went double-platinum and she was nominated for a Grammy in the best pop female performance for her song, &quot;Miss Independent.&quot; She was going to major in marine biology until the high school chorus teacher encouraged her to join the choir.\n\nCMT Crossroads pairs country music stars with popular artists from other genres to play together, swap stories and share their common love of music.","torrent":{"xt":"urn:btih:f1a8147859a90b5a83cf0594a52b3c8008f16c24","amp;dn":"CMT+Crossroads+Reba+McEntire+and+Kelly+Clarkson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a8147859a90b5a83cf0594a52b3c8008f16c24","infoHashBuffer":{"type":"Buffer","data":[241,168,20,120,89,169,11,90,131,207,5,148,165,43,60,128,8,241,108,36]},"announce":[],"urlList":[]}}