{"title":"Bulletstorm.Proper.Read.Nfo-SKIDROW(Murlok)","uid":6200065,"size":21340,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f288aa930926d63dec1cde4287e16783539abbfd&amp;dn=Bulletstorm.Proper.Read.Nfo-SKIDROW%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Murlok","files":3,"time":1298584410,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nBulletstorm Proper Read Nfo\n\n24-02-2011........Release Date &lt;-&gt; Protection................g4wl\nFPS..................Game Type &lt;-&gt; Disk(s)..............Statement\n\nREAD NFO NOTES\n\nDear Fairlight\n\nIf you were right, then of course we would accept your crack fix, but\napparently you wont admit you lost this game\n\nOur g4wl crack is fully working and it does not crash, like you stated\nin your crack fix. Our own testers have played through the game with\nupdated xlive.dll and no crashes. We have done researches and we did\nnot find people reporting crashes\n\nYou stated (did you need it anyways?) about our proper, but yet you\ncame to us last night and told us, that our proper is 100% valid. Today\nyou decide to tell the public otherwise - Truely stinks!\n\nYou don't accept nukes for false reasons, but apparently crackfixes\nwith false reasons is allowed\n\nWe can live with you winning this game, but you can't live losing it!\n\nTo anyone that had imaginary crashes contact us at 0-8000-IMAGINARY\n\nPROPER NOTES\n\nFLT's g4wl emulation makes saves corrupt and also the settings changes\ncan't be saved\n\nHere you have a working version, as true to the original, with g4wl\nfully working\n\nInstead of the need to download whole game once more, you can get the\nsmall sr-bustp.rar with update and proper crack\n\nRELEASE NOTES\n\nSet in a futuristic utopia, an elite peacekeeping force thwarts the\nrumblings of civil war. But deception within the ranks has caused two\nmembers of the most feared unit to strike out on their own. Now\nstranded on an abandoned paradise, Grayson Hunt and Ishi Sato find\nthemselves surrounded by hordes of mutants and flesh eating gangs\nThey survive on two objectives: get off the planet alive and extract\nrevenge on the man who sent them there\n\nOver-The-Top, Intense Action: Epic Games and People Can Fly deliver a\ntruly unique and over the top gameplay experience\n\nUnique &quot;Skillshot&quot; Gameplay: rewards players who &quot;kill with skill&quot;\nUpgrades System: enables players to pull off even bigger and better\nskillshots and earn further upgrades\n\nMassive Boss Battles: People Can Fly bring their unique sense of scale\nto Bulletstorm with huge boss battles interspersing the intense action\nexperience\n\nINSTALL NOTES\n\n1. Unpack release\n2. Mount or burn the image\n3. Install using serial: 11111-11111-11111-11111-11111\n4. Copy all files from the SKIDROW folder to the game installation\n5: Delete these two files:\n\nBinariesWin32ShippingPC-StormGame.exe.zdp\nBinariesWin32ZdpZdpConfig.xml\n\n6. Update the game with the content from UPDATE folder\n7. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nRemember to create a Game for Windows Live offline account to be able\nto save\n\nKeep in mind that the FLT saves are not compatible with our version!\n\nIf SKIDROW.dll gets caught by your antivirus program, don't worry about\nit\n\nGREETINGS\n\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - Fairlight\nSHOCK - CRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision\n\nEnjoy","torrent":{"xt":"urn:btih:f288aa930926d63dec1cde4287e16783539abbfd","amp;dn":"Bulletstorm.Proper.Read.Nfo-SKIDROW%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f288aa930926d63dec1cde4287e16783539abbfd","infoHashBuffer":{"type":"Buffer","data":[242,136,170,147,9,38,214,61,236,28,222,66,135,225,103,131,83,154,187,253]},"announce":[],"urlList":[]}}