{"title":"Dropkick Murphys - I'm Shipping Up To Boston (2nafish)","uid":6039040,"size":119259140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f350221cbbfb5e7158b7bf207414060787b67389&amp;dn=Dropkick+Murphys+-+I%5C%27m+Shipping+Up+To+Boston+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292286238,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;I'm Shipping Up to Boston&quot; is a song with lyrics written by the folk singer Woody Guthrie and music written and performed by the Celtic punk band Dropkick Murphys. It appeared on their 2005 album, The Warrior's Code. An earlier recording of it can be found on the Hellcat Records compilation Give 'Em the Boot Vol. 4.\n\nThe song has so far sold 1,044,000 digital copies without ever charting on the Hot 100.\n\nThe Warrior's Code is the fifth studio album of the Dropkick Murphys. Released in June 2005, it is also their bestselling. It features a dedication to Lowell's own &quot;Irish&quot; Micky Ward. It is also their final record with Hellcat Records before moving to their own vanity label, Born &amp; Bred Records.\n\n&quot;Your Spirit's Alive&quot; was written for the band's dear friend Greg &quot;Chickenman&quot; Riley, who died in a motorcycle accident in 2004. &quot;The Warrior's Code&quot; is about boxing legend Micky Ward, who hails from Lowell, Massachusetts. &quot;Captain Kelly's Kitchen&quot; is another of the band's traditional arrangements. &quot;Sunshine Highway&quot; was the first single from this album and has surfaced in many places including Royal Caribbean's Sports' Deck. &quot;The Green Fields of France&quot; is a cover of a song originally performed by Eric Bogle. The lyrics to &quot;I'm Shipping Up to Boston&quot; come from unpublished Woody Guthrie lyrics, consisting of a short rant by a sailor looking for a wooden leg in Boston. It is similar to &quot;There's Gonna Be a Blackout&quot; from their previous album, Blackout. &quot;Wicked Sensitive Crew&quot; is a spit at the band's critics who claim that they glorify violence and come across as 'tough guys'. &quot;Last Letter Home&quot; was correspondence between American Sgt. Andrew Farrar and his family before his death in the current Iraq War. &quot;Tessie&quot; is a reworking of a Boston Red Sox rally song. On this release, it is called a bonus track because it was already released on the Tessie EP in 2004 during the Red Sox season where they ended up winning the World Series for the first time in 86 years. A second bonus track titled &quot;Hatebomb&quot; can be found on the Japanese release. The band filmed music videos for &quot;Sunshine Highway&quot;, &quot;The Warrior's Code&quot; and two videos for &quot;I'm Shipping Up To Boston&quot;, one of which was used to promote the movie The Departed and contained clips from the movie. A video for the track &quot;Tessie&quot; was also filmed in 2004.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f350221cbbfb5e7158b7bf207414060787b67389","amp;dn":"Dropkick+Murphys+-+I%5C%27m+Shipping+Up+To+Boston+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f350221cbbfb5e7158b7bf207414060787b67389","infoHashBuffer":{"type":"Buffer","data":[243,80,34,28,187,251,94,113,88,183,191,32,116,20,6,7,135,182,115,137]},"announce":[],"urlList":[]}}