{"title":"The.Mentalist.Season 2.Complete.TeaM RCP","uid":5754363,"size":8442942147,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f380ccfe44b039f05b5d9697754d268b6ab71413&amp;dn=The.Mentalist.Season+2.Complete.TeaM+RCP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChetanG","files":27,"time":1281513722,"description":"THE MENTALIST SEASON 2 COMPLETE ALL EPISODES HDTV\nSummary:\nThe Mentalist follows Simon Baker as Patrick Jane, an independent consultant for the California Bureau of Investigation (CBI) based in Sacramento, California. Although not an officer of the law of any sort, he uses skills and knowledge from his former career as a successful psychic medium  (this was a ruse; he does not believe anyone actually has psychic abilities) to help a team of CBI agents solve various crimes, with the hope of one day bringing his wife and daughter's murderer to justice.\n\nPatrick Jane used to be a con man who earned a lucrative career successfully posing as a psychic medium and enjoying near-celebrity status. He appeared on television to claim that his paranormal abilities helped the police profile a serial killer named Red John. Red John, angered by the perceived slight, murders Jane's wife and young daughter in revenge. Riddled with remorse, Jane consequently abandons his career as a psychic and teams up with the CBI, using his skills to help them solve various crimes. His main focus is on the cases involving Red John or Red John copycats. He admits to faking the supernatural aspects of his skills, often asserting that &quot;there's no such things as psychics&quot;; however, he has finely honed skills in cold reading, hypnotism, pickpocketing, as well as powerful skills of observation and a deep insight into the human psyche and behavior. These skills come in handy in every episode, and his unorthodox and bizarre techniques to solve crimes sometimes offend the team of agents he works with. They often involve elaborate ruses and mind games to trick the culprit into confessing.","torrent":{"xt":"urn:btih:f380ccfe44b039f05b5d9697754d268b6ab71413","amp;dn":"The.Mentalist.Season+2.Complete.TeaM+RCP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f380ccfe44b039f05b5d9697754d268b6ab71413","infoHashBuffer":{"type":"Buffer","data":[243,128,204,254,68,176,57,240,91,93,150,151,117,77,38,139,106,183,20,19]},"announce":[],"urlList":[]}}