{"title":"Leadwerks Engine SDK + Tutorials","uid":6148861,"size":229491164,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f41a24153c76d57b6eb39c11d0ae266c8c1b9810&amp;dn=Leadwerks+Engine+SDK+%2B+Tutorials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Syad","files":5,"time":1296802882,"description":"Leadwerks Engine SDK, version 2.21 + Tutorials.\n\nFeatures:\nDeferred dynamic lighting allows you to display an unlimited number of dynamic shadow-casting lights. No tricks, no hacks, just beautiful lighting that works like real life.\n\nPhysics Leadwerks provides an advanced physics simulation using Newton Game Dynamics, the most accurate real-time physics library in the world. Stable joints and silky smooth character motion means your game will feel just as good as it looks.\n\nAnimation Bring your world to life with our advanced animation system. Leadwerks Engine supports hardware-accelerated skinned animation, with support for up to 256 bones per character. Movement can be controlled with animation, physics, or programmatic motion. \n\nMaterials are the key to next-generation graphics. Choose from our library of effects include normal mapping, specular reflection, cube mapping, parallax occlusion mapping, and more. \n\nForest Rendering Our advanced rendering technology allows an unlimited number of trees and plants with enormous view ranges. Make dense jungles or plains covered in grass. Leadwerks can handle it all. \n\nRendering Leadwerks Engine is the graphical leader of the industry. Our renderer features bloom, depth-of-field, volumetric light scattering, screen-space directional occlusion (SSDO), high dynamic range (HDR), and more. If you want your games to look their best, you've come to the right place. \n\nTerrain Make huge terrains covered in vegetation. Combine satellite images with painted layers for maximum realism. \n\nSystem Requirements:\nMinimum:\n\n    * NVidia GEForce series 7000 or ATI Radeon series 3000 graphics card\n    * 1.0 GHz CPU\n    * 512 MB RAM\n\n\nRecommended:\n\n    * NVidia GEForce 8800 or ATI Radeon 3870 graphics card\n    * 3.0 GHz CPU\n    * 2 GB RAM\n\n\nOperating System:\n\n    * Windows 7, Vista, or XP","torrent":{"xt":"urn:btih:f41a24153c76d57b6eb39c11d0ae266c8c1b9810","amp;dn":"Leadwerks+Engine+SDK+%2B+Tutorials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f41a24153c76d57b6eb39c11d0ae266c8c1b9810","infoHashBuffer":{"type":"Buffer","data":[244,26,36,21,60,118,213,123,110,179,156,17,208,174,38,108,140,27,152,16]},"announce":[],"urlList":[]}}