{"title":"Michael Merzenich: Exploring the re-wiring of the brain","uid":4878592,"size":79488476,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f453ad9da3a1634c0dc21d01fcac3b59a2b6cbde&amp;dn=Michael+Merzenich%3A+Exploring+the+re-wiring+of+the+brain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263474,"description":"Michael Merzenich: Exploring the re-wiring of the brain\n\nNeuroscientist Michael Merzenich looks at one of the secrets of the brain's incredible power: its ability to actively re-wire itself. He's researching ways to harness the brain's plasticity to enhance our skills and recover lost function.\n\nOne of the foremost researchers of neuroplasticity, Michael Merzenich's work has shown that the brain retains its ability to alter itself well into adulthood -- suggesting that brains with injuries or disease might be able to recover function, even later in life. He has also explored the way the senses are mapped in regions of the brain and the way sensations teach the brain to recognize new patterns.\n\nMerzenich wants to bring the powerful plasticity of the brain into practical use through technologies and methods that harness it to improve learning. He founded Scientific Learning Corporation, which markets and distributes educational software for children based on models of brain plasticity. He is co-founder and Chief Science Officer of Posit Science, which creates &quot;brain training&quot; software also based on his research.\n\nMerzenich is professor emeritus of neuroscience at the University of California, San Francisco.\n\n    &quot;Merzenich is perhaps the most recognizable figure in brain plasticity and how one develops competence through experience and learning.&quot;\n\nDominique M. Durand","torrent":{"xt":"urn:btih:f453ad9da3a1634c0dc21d01fcac3b59a2b6cbde","amp;dn":"Michael+Merzenich%3A+Exploring+the+re-wiring+of+the+brain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f453ad9da3a1634c0dc21d01fcac3b59a2b6cbde","infoHashBuffer":{"type":"Buffer","data":[244,83,173,157,163,161,99,76,13,194,29,1,252,172,59,89,162,182,203,222]},"announce":[],"urlList":[]}}