{"title":"Time Team, UK - Season 01 - 4 Episodes","uid":8603643,"size":1249664366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f544618f958b87279dd93bac6a8a62b06470f5ce&amp;dn=Time+Team%2C+UK+-+Season+01+-+4+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":4,"time":1371946798,"description":"I have been trying to find episodes of Time Team for quite some time, but in order to obtain the first few seasons I was forced to download an enormous file which contained almost ALL of the episodes and specials of the first 17 seasons.\n\nI have started downloading a couple of those files and intend to break them up into individual seasons.  This is Season ONE.\n\nEpisodes:\n\n1. Athelney, Somerset - 640x480 - H264/MP3\n\n   In this first ever episode of Time Team, Tony and the team travel to Athelney in Somerset to investigate a series of hills (once islands in a bog) that became Alfred The Great last defensive positions after a series of losses to invading Viking forces. It is also the place Alfred began the great rally that saw him re-conquer most Wessex and laid the foundations of the nation that was to become England.\n\n2. Ribchester, Lancashire - 640x480 - H264/MP3\n\n   Ribchester in Lancashire has been known for some time as a site of a Roman fort. The Time Team arrive in the town to answer two questions, one is to consolidate all the previous excavations on the site, and the second to define the outline of a possible older wooden fort that is thought to have been in the area.\n\n3. Much Wenlock, Shropshire - 640x480 - H264/MP3\n\n   The Time Team go to the small town of Much Wenlock, after they receive a letter from a resident explains a recent excavation uncovered possibly the oldest house in the town. What they discover is the remains of an old Saxon village transitioning into a larger newer Norman settlement.\n\n4. Llangorse Lake, Powys - 640x480 - H264/MP3\n\n   The Time Team travel to Brecon Beacons in Wales, they have come to investigate a small man-made island in Llangorse Lake. Locals tell many strange legends including hearing the sounds of Church bells echoing across the body of water at night. The Team want to know who built the island and try to find evidence to support the stories of it eventual fall into disuse.\n\n","torrent":{"xt":"urn:btih:f544618f958b87279dd93bac6a8a62b06470f5ce","amp;dn":"Time+Team%2C+UK+-+Season+01+-+4+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f544618f958b87279dd93bac6a8a62b06470f5ce","infoHashBuffer":{"type":"Buffer","data":[245,68,97,143,149,139,135,39,157,217,59,172,106,138,98,176,100,112,245,206]},"announce":[],"urlList":[]}}