{"title":"The Next Big Thing: A Rough Guide to things that seemed like a g","uid":9024508,"size":1200707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f58811fd2ce4e881d741f04faa8fdc26724f2c6b&amp;dn=The+Next+Big+Thing%3A+A+Rough+Guide+to+things+that+seemed+like+a+g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1381341874,"description":"Rhodri Marsden - The Next Big Thing: A Rough Guide to things that seemed like a good idea at the time\nPublished: 2009-10-05 | ISBN: 1848363524 | EPUB | 216 pages | 3 MB\n\n\nTimes change. People move on. Plunging a hand into a pot of boiling oil is no longer considered an accurate way of determining the guilt of an adulterous woman. We tend not to casually vomit at the dinner table, do the Macarena, or fly around in airships inflated with highly flammable gas. We live our lives amid a complex web of rapidly changing ideas, desires and ethics; we pick the ones that seem like a good idea, and jettison the ones that don't. &quot;The Next Big Thing&quot; points, laughs and winces at all those things that were suddenly deemed not that great after all. The guide is a tribute to the fad, the dead-end trend, the ephemeral nature of our beliefs, needs and aspirations. Choose your fad by era - Prehistory, Ancient Civilizations, The Middle Ages, Renaissance &amp; Elizabethan, Georgian and Victorian, World Wars, The Post-War Years, The 1960s and 70s, The 1980s and 90s right through to today. Think about it: In the 1930s, men who played the clarinet were considered incredibly sexually attractive by young women. This is no longer the case. &quot;The Next Big Thing&quot; will tell you why.","torrent":{"xt":"urn:btih:f58811fd2ce4e881d741f04faa8fdc26724f2c6b","amp;dn":"The+Next+Big+Thing%3A+A+Rough+Guide+to+things+that+seemed+like+a+g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f58811fd2ce4e881d741f04faa8fdc26724f2c6b","infoHashBuffer":{"type":"Buffer","data":[245,136,17,253,44,228,232,129,215,65,240,79,170,143,220,38,114,79,44,107]},"announce":[],"urlList":[]}}