{"title":"Spider-Man and Philosophy Mp3 and Epub","uid":7975679,"size":239635587,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f6acc8655284cb19fdbc3c63d6a24e4f81a5873c&amp;dn=Spider-Man+and+Philosophy+Mp3+and+Epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hombrep","files":-1,"time":1356976012,"description":"Spider-Man and Philosophy: The Web of Inquiry (The Blackwell Philosophy and Pop Culture Series)\n\nAs usual, here it is a number of excellent essays, a few duds, and most were in-between. Neil Mussett starts the show off with an excellent essay, &quot;Does Peter Parker Have a Good Life?&quot; We are introduced to four different philosophers, each with his own angle on what the good life is, from Epictetus to Ayn Rand, and then end with Aquinas, who, it is shown, combines all of the previous viewpoints. It was a good comparative survey on the question of what the good life is, and wrapping it up with Aquinas put an almost &quot;tallmanesque&quot; spin to this essay.\n\nAndrew Terjesen's &quot;Why Is My Spider-Sense Tingling?&quot; used Spider-Man's &quot;spider-sense&quot; as a springboard for exploring the world of perceptions and the three schools of thought: indirect realism (Locke), idealism (Berkeley), and phenomenalism (Hume). A superb compare and contrast essay.\n\nMeaghan P. Godwin's &quot;Red or Black: Perception, Identity and Self&quot; took the perspective of Pragmatism (William James, Charles Sanders Peirce, John Dewey) to look at the &quot;social self&quot;, and how one's identity is a web (*sigh*) of conditions that contribute to the notion of the self.\n\nMark K. Spencer's &quot;With Great Power: Heroism, Villainy, and Bodily Transformation&quot; is the shining gem of this collection. Mr. Spencer looks at how changes (modifications) to the body result in corresponding changes to one's perceptions. That is, one is not simply a passive/pure mind, but rather a mind and a body. Mr. Spencer invokes Husserl, Merleau-Ponty and Levinas, and uses their ideas to point to a &quot;holistic version of virtue ethics&quot;. This leads Mr. Spencer to ask &quot;What kind of responsibility flows from great power?&quot; A great essay, one that you will go back to read again.\n\nOther essays held their own quite well. Ron Novy's &quot;Transhumanism: Or, Is It Right to Make a Spider-Man?&quot; begins with the story of the cloak of invisibility from Plato's &quot;The Republic&quot; and looks at the effect of technology on what it means to be human. Will transhumanism damage the principle of human equality? Will radical modifications of the body fundamentally alter our human essence? Does a human essence exist? (Hint, Mr. Novy: Sartre says &quot;Non.&quot;) Daniel P. Malloy's &quot;The Quipslinger: The Morality of Spider-Man's Jokes&quot; was a unique and refreshing essay that explored ideas about humor and making jokes. Mr. Malloy explores three theories on why we find something funny: the superiority theory, the incongruity theory, and the relief theory.\n\nThe last essay, by Editor Sanford, was a good ending to this collection. &quot;Spider-Man and the Importance of Getting Your Story Straight&quot; looked at how telling the story of one's life can help one be more self-reflective, and in the process encourage one's moral development. Mr. Sanford invoked Aristotle and Alasdair MacIntyre while trying to tie together involuntary obligations and free choice. &quot;Success or failure in our lives will be measured by how well we respond to them, which is to say, how virtuously we act.&quot; (p. 252). Indeed.\n","torrent":{"xt":"urn:btih:f6acc8655284cb19fdbc3c63d6a24e4f81a5873c","amp;dn":"Spider-Man+and+Philosophy+Mp3+and+Epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6acc8655284cb19fdbc3c63d6a24e4f81a5873c","infoHashBuffer":{"type":"Buffer","data":[246,172,200,101,82,132,203,25,253,188,60,99,214,162,78,79,129,165,135,60]},"announce":[],"urlList":[]}}