{"title":"House of Wax (2005)","uid":4917507,"size":735887407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f6dce1c12c13320f17919c00efeb83c1a6ef2e86&amp;dn=House+of+Wax+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fanebabanu","files":2,"time":1243501264,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0397065/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0397065/&lt;/a&gt;\n\nSix friends are on their way to a football game. They decide to camp out for the night and continue driving the next day. The next day the friends find that their having car troubles, so two of the friends accept a strangers ride into a small town named Ambrose. The main attraction in Ambrose is the House of Wax. Except something is not right in this town the wax figures are so realistic and the whole town is deserted- except for two murderous twin brothers. The six friends must fight to survive and escape from being the next exhibits in the House of Wax. Starring Chad Michael Murray, Jared Padalecki, Elisha Cuthbert, Paris Hilton, Jon Abrahams and Robert Ri'chard.\n\nCarly Jones (Elisha Curtberth), her bad boy brother Nick (Chad Michael Murray), her boyfriend Wade (Jared Padalecki), and her friends Paige (Paris Hilton) and her boyfriend Blake (Robert Richard) and Dalton (Jon Abrahams) travel to another city to watch an important game. They decide to camp in a field halfway and proceed their journey on the next day. However, the fan belt of Wade's car breaks and he stays with Carly to buy a new one in a close town, where there is a house of wax. When they arrive in the place, they realize that the place is a ghost town, and two deranged former Siamese brothers have transformed people in wax statues.","torrent":{"xt":"urn:btih:f6dce1c12c13320f17919c00efeb83c1a6ef2e86","amp;dn":"House+of+Wax+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6dce1c12c13320f17919c00efeb83c1a6ef2e86","infoHashBuffer":{"type":"Buffer","data":[246,220,225,193,44,19,50,15,23,145,156,0,239,235,131,193,166,239,46,134]},"announce":[],"urlList":[]}}