{"title":"The Lgend of korra episode 11-12","uid":8603135,"size":428144069,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f7d2f87bb4bc202f65afbead18504d31669364fb&amp;dn=The+Lgend+of+korra+episode+11-12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PS3234","files":1,"time":1371936193,"description":"Episode 11.Skeleton's in the Closet\nGeneral Iroh, grandson of the now retired Fire Lord Zuko, joins in the war against the Equalists. Meanwhile, the new Team Avatar is hiding in an alley where benders and non-benders seem to coexist harmoniously. Mako and Korra go to take down Amon while the rest of the group heads to take down the airfield launching the strike force that will wipe out Bumi's fleet. Korra and Mako find out who Amon really is from an imprisoned Tarrlok. \n\nEpisode 12.Endgame\nKorra and Mako are set to expose Amon's true identity to his followers, but discover that he has captured Tenzin and his family. Amon baits her and succeeds in taking Korra's bending except for airbending, since she had not yet unlocked the fourth element. Asami, Bolin, and Iroh face Hiroshi and the Equalist pilots, working together to destroy the Equalist biplanes. Korra finally manages to establish a link to her spiritual side. The past Avatars help unblock her bending, and Korra is given the ability to energybend which allows her to restore the bending abilities of others. Korra and Mako admit their feelings toward each other, and share a loving hug and a passionate kiss. \n\n1280 * 720\n\nSUBSCRIBE TO MY CHANNEL ON YOUTUBE AT KidStar03 :) and please seed!!!!!","torrent":{"xt":"urn:btih:f7d2f87bb4bc202f65afbead18504d31669364fb","amp;dn":"The+Lgend+of+korra+episode+11-12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d2f87bb4bc202f65afbead18504d31669364fb","infoHashBuffer":{"type":"Buffer","data":[247,210,248,123,180,188,32,47,101,175,190,173,24,80,77,49,102,147,100,251]},"announce":[],"urlList":[]}}