{"title":"Alice Sebold - Wijde hemel","uid":8265469,"size":282485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f888a1555decf3d3955cd4d907cbea699c94e94f&amp;dn=Alice+Sebold+-+Wijde+hemel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sumofmind","files":-1,"time":1363481979,"description":"Nederlands\nBezige Bij b.v., Uitgeverij De\nseptember 2010\n\nDe veertienjarige Susie Salmon is al in de hemel voordat De wijde hemel goed en wel begint. Het zijn de argeloze jaren zeventig, toen er nog geen foto's van vermiste personen op de televisie werden getoond. In 1973, het jaar waarin ze van de aardbodem verdween, geloofde men niet dat deze dingen werkelijk konden gebeuren, zo vertelt Susie ons. \nSusie - een luchthartige maar vroegrijpe tiener - beschrijft de gebeurtenissen rond haar dood, en de vreemde nieuwe wereld waarin ze zich bevindt ('Ik wil u graag vertellen dat het hier prachtig is en dat ik voor eeuwig veilig ben, net als u ooit zult zijn. Maar in deze hemel speelt veiligheid geen rol, evenmin als, hoe aangenaam ook, de droge werkelijkheid.'). \nMet pijn en verlangen ziet Susie vanuit de hemel toe hoe ontreddering haar achterblijvende familie treft: terwijl haar vader ronddoolt om de vermeende moordenaar van zijn dochter op te sporen, verzint haar broertje in alle eenzaamheid een imaginair zusje en glijdt Susie's moeder langzaam weg van haar gezin. Maar gaandeweg blijkt dat er in Susie's afwezigheid ook een nieuwe kracht schuilt, die de breekbare familiebanden opnieuw en voorgoed met elkaar verbindt.","torrent":{"xt":"urn:btih:f888a1555decf3d3955cd4d907cbea699c94e94f","amp;dn":"Alice+Sebold+-+Wijde+hemel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f888a1555decf3d3955cd4d907cbea699c94e94f","infoHashBuffer":{"type":"Buffer","data":[248,136,161,85,93,236,243,211,149,92,212,217,7,203,234,105,156,148,233,79]},"announce":[],"urlList":[]}}