{"title":"Stephen and Matilda: The Civil War of 1139-53   (1996)","uid":9433342,"size":1645889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f89bed1deedb369e3ff9c8a9a3c79e5b4b4b891a&amp;dn=Stephen+and+Matilda%3A+The+Civil+War+of+1139-53+++%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":5,"time":1388847139,"description":"Books : History : English\n\n\nProduct Description\nCivil war and the battle for the English Crown dominated the reign of King Stephen, and this popular account is the only complete account of the complex and fascinating military situation. The war is examined in detail throughout the various campaigns, battles and sieges of the period, including the two major battles at the Standard and Lincoln, showing that Stephen always held more ground than his opponents and was mostly on the offensive. The nature of the warfare and the reasons for its outcome are examined, along with comment on the strategy, tactics, technology in arms and armour, and the important improvements in fortifications. Full use has been made of the numerous detailed chronicle sources which give some indication of the horrors of twelfth-century war, the depredations which affected the ordinary people of the land, and the atrocities which sometimes accompanied it. Full of colourful characters - the likeable king, the domineering Matlida, the young and vital Henry of Anjou (later Henry II), his intelligent and effective father Geoffrey Count of Anjou, the powerful barons from Geoffrey de Mandeville to Ranulf of Chester - and illustrated with photographs, maps and manuscript illustrations, this is a fascinating story of rivalry for the English throne which throws new light on a much-neglected aspect of Stephen's reign.\n\nAbout the Author\nJim Bradbury taught history at Brunel University College before taking early retirement to devote himself to writing. He has written widely on medieval military history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f89bed1deedb369e3ff9c8a9a3c79e5b4b4b891a","amp;dn":"Stephen+and+Matilda%3A+The+Civil+War+of+1139-53+++%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89bed1deedb369e3ff9c8a9a3c79e5b4b4b891a","infoHashBuffer":{"type":"Buffer","data":[248,155,237,29,238,219,54,158,63,249,200,169,163,199,158,91,75,75,137,26]},"announce":[],"urlList":[]}}