{"title":"Batman Returns 1992 Catwoman fanedit v2 1080p 6ch 62minutes","uid":10274559,"size":1580842142,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f916feb18030e37f8ddb33094f381f3294256d50&amp;dn=Batman+Returns+1992+Catwoman+fanedit+v2+1080p+6ch+62minutes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bsg4you","files":3,"time":1401637189,"description":"Batman.Returns.1992.Catwoman.fanedit.v2.1080p.6ch.62minutes.mkv\n\nBatman Returns 1992 Catwoman FANEDIT v2 1080p 6ch 62minutes\ntotal 62min 9sec - fanedit 54m 34s - credits 7m 35s\nV: 2-Pass Encoding (Turbo first pass) Preset = 09 (very slow) 3000Kbps AVC\nA: 5.1 384Kbps AAC\n\nTHIS IS THE SAME CONTENT AS VERSION1 JUST SMALLER WITH THE SAME QUALITY\n\nVersion1 had V: 5.63Mbps AVC and A: 448Kbps AC3 and was 2,955,068,533bytes.\nVersion2 is much smaller at 1,580,795,876bytes with no discernible loss in video or audio quality.\n\nWhy download this FANEDIT? Because you like ...\nCatwoman, Michelle Pfeiffer, Tim Burton's Batman universe\n\nCatwoman FANEDIT is a version of Batman Returns 1992 that just focuses on Selina Kyle and Catwoman's story. Selina is a struggling secretary, actually an administrative assistant. She's trying to make it in Gotham on her own but can't get anywhere with work or love. Everything changes when she uncovers wrong doing by her boss, the powerful and ruthless Max Shreck. Now Selina is taking matters into her own hands as Catwoman, a tough, mercurial vigilante, taking no sides but her own. Catwoman is both combative with and attracted to Batman and at times she's allies with the Penguin. Torn by her old world and what she's become, Selina stumbles forward with her human life going on a date with Bruce Wayne while also lashing out at Batman because of her inner demons.\n\nThe Batman Returns Catwoman incarnation was a masterpiece of writing, directing and, most of all, acting by the incomparable Michelle Pfeiffer. Her acting is perfect for this dual role of conflicted secretary who's boss tried to kill her and the unpredictable and dangerous Catwoman. Even as Selina, her range is excellent - for example her anxious nervousness pouring coffee at the Shreck/Mayor meeting to her commanding entrance the next day at the end of the Shreck/Wayne meeting. After her fall and rebirth Selina could now exhibit complete command of a room as she exuded total confidence along with a baffling charm and beauty that stunned both Shreck and Wayne. Pfeiffer played this perfectly.\n\nMichelle's voicing and body language as Catwoman couldn't have been better. She could savagely beat a mugger and then scold the mugging victim for being such an easy target and then waiting for some Batman to save her. Catwoman's romp through Shreck's Department store, alternately vandalizing the store, skipping rope with her whip and scaring off security guards was very cat like, playful and dangerous. Her flipping out across the street to breathlessly say &quot;meow&quot; to Batman and Penguin right before the store explodes is another great example of Michelle playing the unpredictable cat just right. And Michelle's sexy, slinky body language in that cat suit plus her deep, sultry voice were mesmerizing.\n\nSelina and Catwoman's flirting, dating and fighting with Bruce and Batman are just wonderful. This is without a doubt the best on screen chemistry for any Batman relationship. Keaton is excellent on the receiving end of Selina and Catwoman's roller-coaster of intense attraction and violent conflict. The dialogue and acting for Selina and Bruce at the ball and Catwoman and Batman at the climax in Arctic World really cements this couple as the best ever in the Batman big screen universe.\n\nCHANGES:\n- Everything with Selina/Catwoman was kept including some solo Wayne and Shreck scenes talking about her.\n- Some establishing shots were kept as were some spacing scenes like the Shreck/Wayne meeting and the Batman/Strong Man encounter.\n- Most of the Penguin's storyline is removed though he's there for talks with Catwoman and at his speech as Selina glares in disgust and anger at the two men who tried to kill her.\n- The credits were completely replaced by a 7min 35sec clip montage of Selina and Catwoman set to the Siouxsie And The Banshees song Face To Face that played at the ball while Selina and Bruce danced. The song is looped since there were so many great clips to include. Also, the song volume is lowered and the movie soundtrack unmuted during some great Catwoman and Selina lines and excellent dialogue, especially with the clips at the end like &quot;I would love to live with you in your castle ... forever, just like in a fairy tale&quot; - she suddenly claws Batman - &quot;I just couldn't live with myself, so don't pretend this is a happy ending!&quot;\n\nPlease check out other fanedits of Battlestar Galactica, DC Comics and Star Trek Enterprise plus Rifftrax, documentaries and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:f916feb18030e37f8ddb33094f381f3294256d50","amp;dn":"Batman+Returns+1992+Catwoman+fanedit+v2+1080p+6ch+62minutes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f916feb18030e37f8ddb33094f381f3294256d50","infoHashBuffer":{"type":"Buffer","data":[249,22,254,177,128,48,227,127,141,219,51,9,79,56,31,50,148,37,109,80]},"announce":[],"urlList":[]}}