{"title":"La storia in giallo 167 - Il Parmigianino [Mp3 Ita] [TNTvillage]","uid":6756353,"size":70997181,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9369321a384bff3d671a12fcff298706e6e9e28&amp;dn=La+storia+in+giallo+167+-+Il+Parmigianino+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darayava","files":1,"time":1319046293,"description":"La storia in giallo 167 - Il Parmigianino [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra.\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 03/06/2006\n\nFRANCESCO MAZZOLA\nIl Parmigianino\n\n\nArtista precoce, di bell'aspetto e di straordinario genio, Francesco Mazzola, detto il Parmigianino, consumÃƒÂ² la sua breve esistenza tra i fasti e i tumulti del sedicesimo secolo. Visse prima a Parma, per poi trasferirsi a Roma, dove partecipÃƒÂ² al fervido clima culturale alimentato da artisti e letterati giunti da tutta Europa. Ma il Sacco di Roma con la devastante avanzata dei Lanzichenecchi, troncÃƒÂ² improvvisamente le sue speranze. \nFurono forse questi eventi a compromettere il talento del pittore o piuttosto la seduzione per l'alchimia, che egli praticÃƒÂ² con crescente ossessione. La passione per quella scienza oscura e demoniaca lo allontanÃƒÂ² infatti dalla pittura, trasformando - come scrisse il Vasari - l'artista angelico e dai modi gentili, nell'uomo selvatico, schivo e tenebroso.\nLo chiamavano il &quot;novello Raffaello, e proprio come il pittore d'Urbino, anche il Parmigianino, si spense prematuramente a soli 37 anni.\nLa voce del Parmigianino ÃƒÂ¨ quella di Riccardo Rossi.\nAntonella Ferrera intervista il critico d'arte Vittorio Sgarbi, che al Parmigianino ha dedicato una monografia.\n\nFile Details\n========================================\nName..........: 2006 - Il Parmigianino.mp3\nFilesize......: 67Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:f9369321a384bff3d671a12fcff298706e6e9e28","amp;dn":"La+storia+in+giallo+167+-+Il+Parmigianino+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9369321a384bff3d671a12fcff298706e6e9e28","infoHashBuffer":{"type":"Buffer","data":[249,54,147,33,163,132,191,243,214,113,161,47,207,242,152,112,110,110,158,40]},"announce":[],"urlList":[]}}