{"title":"Sir Charles Thompson - 2013 - The Jazz Legend FLAC","uid":8774143,"size":327835097,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb0154e84d60f39c99c1def2e820759acb71600e&amp;dn=Sir+Charles+Thompson+-+2013+-+The+Jazz+Legend+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1375512401,"description":"Sir Charles Thompson - 2013 - The Jazz Legend\n\nThe elegantly nicknamed Sir Charles Thompson was one of the few musicians associated with swing who was able to make a graceful, wholehearted transition to bop at the time the revolution was happening. His piano style is light-fingered and spare in a witty, inventive, Basie-descended bop manner, and he was able to adapt it effectively to the organ. Thompson's first instrument was the violin, but the piano beckoned when he was a teenager, and he started working with territory bands in the midwest in the late 1930s. He briefly joined Lionel Hampton in 1940, but left in order to work with small groups and contribute arrangements to Basie, Hampton, Fletcher Henderson, Jimmy Dorsey, and other bands. While working in New York's 52nd St. clubs during World War II, he began to pick up on the beginnings of bop. In 1944-1945, Thompson played in the Coleman Hawkins/Howard McGhee band, journeying to Hollywood with them to record several terrific swing/bop sides for Capitol (now on Hollywood Stampede) and also his lively tune &quot;Ladies' Lullaby&quot; for Asch. So thoroughly had Thompson absorbed the language and ethos of bop that he was able to write one of the quintessential classics of the idiom, &quot;Robbins' Nest,&quot; which became a hit for Sir Charles' next employer, Illinois Jacquet, and inspired a haunting, pathbreaking Gil Evans arrangement for Claude Thornhill in 1947.\nThompson recorded a number of small group albums for Vanguard in the '50s, and two more for Columbia in 1959 and 1960, and appeared as a sideman for Buck Clayton and Jimmy Rushing, but spent much of the '50s freelancing as an organist. He toured the U.S., Canada, and Puerto Rico in the '60s leading small groups, as well as Europe with Clayton. Following a bout of ill health, he returned to action in 1975. His early bop sides for Apollo, including some with Hawkins and Charlie Parker, are available on the Delmark reissue Takin' Off. (Biography from AllMusic)\n\nTrack list:\n01 - What's New\n02 - Good-bye\n03 - Indiana\n04 - I Surrender Dear\n05 - Blue Skies\n06 - Everything Happens to Me\n07 - I Found a New Baby\n08 - I'm a Fool to Want You\n09 - What a Wonderful World\n10 - Russian Lullaby\n11 - Stella by Starlight\n12 - Dark Eyes\n13 - Robbins' Nest\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:fb0154e84d60f39c99c1def2e820759acb71600e","amp;dn":"Sir+Charles+Thompson+-+2013+-+The+Jazz+Legend+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb0154e84d60f39c99c1def2e820759acb71600e","infoHashBuffer":{"type":"Buffer","data":[251,1,84,232,77,96,243,156,153,193,222,242,232,32,117,154,203,113,96,14]},"announce":[],"urlList":[]}}