{"title":"Charlotte Church - Even God Can't Change The Past(Xvid-2nafish)","uid":6035457,"size":32711026,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb46c39644f9ebec5cf75e30a06dc4223c69e308&amp;dn=Charlotte+Church+-+Even+God+Can%5C%27t+Change+The+Past%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292216526,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:07\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1266 Kbps\nQuality Factor : 0.19 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Even God Can't Change the Past&quot; is a pop song written by Rick Nowels, George O'Dowd and John Themis, produced by David Fortman for Charlotte Church's fifth album Tissues and Issues (2005). The song was written by Boy George, after Charlotte Church attended to his musical Taboo and was impressed by his musical score.\n\nTissues and Issues is the fifth studio album by the Welsh singer Charlotte Church released by Sony BMG UK in the United Kingdom on July 11, 2005. Church states that she titled the album Tissues and Issues because &quot;it epitomises teenage problems, which everybody goes through.&quot; The album debuted on the UK Albums Chart at number five and was accredited platinum by BPI for sales over 300,000. The album yielded Church four successful top twenty singles; &quot;Crazy Chick&quot;, &quot;Call My Name&quot;, &quot;Even God&quot; and &quot;Moodswings (to Come at Me like That)&quot;.\n\nThe album represents a wholly new direction for the singer. Her previous album, Prelude, a 'best of' album, had concluded her classical career; Tissues and Issues is her first pop album.\n\nThe first single to be taken from the album, &quot;Crazy Chick&quot;, released shortly before the album itself, reached number two on the UK Singles Chart. &quot;Call My Name&quot;, the second single, reached number ten in October 2005. &quot;Even God&quot;, the third single has debuted in the Top twenty in early December 2005. The fourth single, &quot;Moodswings&quot;, was released on February 27, 2006, and peaked at number fourteen on the UK charts.\n\nAn early batch of the album had print errors on the right and left hand side title faces. The faces had the title &quot;Charlotte Church : Crazy Chick&quot;, when it should have been &quot;Charlotte Church : Tissues and Issues&quot;.\n\nTissues and Issues is Charlotte's last album with Sony Music UK.\n\nWhen &quot;Even God&quot; was released as a single on December 12, 2005, the name was changed to &quot;Even God Can't Change the Past&quot;.\n\nCharlotte Church (born Charlotte Maria Reed; 21 February 1986) is a Welsh singer-songwriter, actress and television presenter. She rose to fame in childhood as a classical singer before branching into pop music in 2005. By 2007, she had sold more than 11,000,000 albums worldwide and in 2010 was said to be worth as much as Ã‚Â£11m (though one 2003 report had her worth Ã‚Â£25m). She recently hosted the third series of her Channel 4 chat show The Charlotte Church Show.\n\nChurch released her first album in 5 years, titled Back To Scratch, on 25 October 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb46c39644f9ebec5cf75e30a06dc4223c69e308","amp;dn":"Charlotte+Church+-+Even+God+Can%5C%27t+Change+The+Past%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb46c39644f9ebec5cf75e30a06dc4223c69e308","infoHashBuffer":{"type":"Buffer","data":[251,70,195,150,68,249,235,236,92,247,94,48,160,109,196,34,60,105,227,8]},"announce":[],"urlList":[]}}