{"title":"Eartship, I want one - Mike Reynolds","uid":6935551,"size":1682893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd79548b52c55537f8dc7f5d0c8b78d737aef410&amp;dn=Eartship%2C+I+want+one+-+Mike+Reynolds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SR4T9US","files":2,"time":1325812072,"description":" &lt;a href=&quot;http://www.amazon.co.uk/Earthship-I-want-one-ebook/dp/B004YTHYS4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.co.uk/Earthship-I-want-one-ebook/dp/B004YTHYS4&lt;/a&gt;\n\nThis book the first in a series of short publications designed to provide the information necessary for people to secure the type of sustainable housing that will soon be a necessity. These books discuss concepts relative to today's current way of thinking and ways in which we will we have to think in the future as a species in order to survive on this planet. We must evolve.\n\nMichael Reynolds is a world famous architect who has spent the last forty plus years evolving the concept of home as well as the home itself. His vision is for the home to care for the inhabitants and not vice versa. With this logical goal in mind he set out to design and refine the Earthship. After forty years it is now an affordable reality. Designed with concepts that any person can adopt, these buildings can provide housing for the people. \nDuring this evolution of the building concept other ideas arose. Why is this so important for humanity? How can we make this improve a persons existence? And finally how do we make it so everyone can have one especially in third world countries where the functionality of these buildings would save lives.\nIn short it is not only about building it is about humanity and its needs.\n\nSorry Mike, it should be out there for free, it's only a brochure!","torrent":{"xt":"urn:btih:fd79548b52c55537f8dc7f5d0c8b78d737aef410","amp;dn":"Eartship%2C+I+want+one+-+Mike+Reynolds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd79548b52c55537f8dc7f5d0c8b78d737aef410","infoHashBuffer":{"type":"Buffer","data":[253,121,84,139,82,197,85,55,248,220,127,93,12,139,120,215,55,174,244,16]},"announce":[],"urlList":[]}}