{"title":"Prison Architect - Alpha 16 - Mac OSX","uid":9406463,"size":104147901,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:fde26d0564269ed32752543ccd50a48b763c75eb&amp;dn=Prison+Architect+-+Alpha+16+-+Mac+OSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sharpshot94549","files":-1,"time":1388169008,"description":"Prison Architect Alpha 16\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\n\nPrison Architect Alpha 16 changelog follows:\n\n= Procedural landscape generation\nThere are new options when generating a new prison:\nForests adds random collections of trees, including new types of tree (Oak, Pine, Orange, Cypress, Palm)\nBuildings are usually derilict and can be used or demolished as you wish\nLakes provide additional construction challenges by forcing you to work around them.\nWarning: Including lakes can make your map totally unplayable. Experimental!\n= Wood industry\nYou can now cut down trees using &quot;Dismantle&quot; from the objects menu, and each tree will produce wooden Logs\nYou can sell the logs for an immediate cash boost (&quot;Sell&quot; from the objects menu)\nOr if you have a workshop, your prisoners will cut the logs into stacks of wood planks, which sell for more\nGardeners are now required to plant trees, and trees take time to grow from saplings\nStacks of finished wood planks will auto-sell at 1am\n= Steam Workshop for mods (Steam versions only)\nMods can now be shared via the Steam Workshop, just like prisons\nThe mods menu now lets you publish mods, highlights mods you have published, and shows newly downloaded mods\nMods will automatically download when an update is available\nAdding FileID &quot;-1&quot; to your mod's manifest.txt will stop the game asking users to publish the mod. Useful for mods shared outside of the Steam Workshop.\n= Full segregation support\nExtensive AI work means you can now fully segregate your prison by prisoner category\nYou can create self contained wings (eg for Max Sec only) containing their own cells, yard, canteen, laundry, workshop etc\nNew zone type : Med Sec, for medium security prisoner ONLY (orange)\nNote: The default zone colour (White) is SHARED, meaning all prisoners are permitted to enter\nWork/Employment/Industry AI improvements\nKitchens are now significantly more efficient (Chefs waste much less time)\nYou can now build any combination of kitchens and canteens, and your chefs will figure it out\n(Eg one kitchen serving multiple canteens, or each canteen having its own kitchen etc)\nFixed: Multiple chefs would sometimes go to collect a box of ingredients from the deliveries zone, wasting time\nFixed: Chefs often stood around doing nothing in the kitchen when they should be cooking\nLaundries and Workshop jobs are now performed more efficiently and intelligently\nLaundries will only service zones of the prison that prisoners working in that laundry would be permitted to reach\nJanitors will now help out with the prison Laundry service\nPrisoner cell re-assignments now happen without requiring shackled guard escort (if possible)\nThey will be shackled and escorted by a guard if they are not permitted to make the journey themselves\nNew object : Road Gate\nCan be built spanning the entire road\nActs as a secure door, requiring a guard to unlock it whenever a vehicle or person wants to pass through\nYou can use this to span your prison across the road, or build a totally contained drop off zone\nDoors now open at different speeds. A normal wood door is the fastest. The large road gate is the slowest.\nThe Large jail door opens slower than the normal jail door.\nPrisoners will now &quot;make a run for it&quot; if they are near the exit and you leave too many doors unlocked\nBe careful when setting zones to &quot;Unlocked&quot; (green), or setting doors to &quot;Locked open&quot;\nNote: More dangerous prisoners are more likely to take advantage of lapses in security\nNew red marker icon for escaping prisoners\nElectrical items no longer short out when wet\nIt is now safe to use Firemen in the kitchen, or to repair laundry machines without having to worry about electrocution\nEXCEPT the power station which now explodes most spectacularly when wet\nWorkshop balance nerf\nThe workshop has been judged far too ridiculously profitable\nCutting sheet metal and stamping license plates now takes twice as long as before\nSheet metal now costs $10 per sheet, and produces 2 license plates which sell for $10 each, giving $10 profit\n(Previously $3 per sheet, producing 3 license plates selling at $10 each, giving $27 profit)\nWorkshop saws and presses now cost 50% more to build\nPrisoners will now make better use of their stolen contraband when misbehaving:\nLighters if they are feeling destructive\nWeapons if they get into a fight\nTools if they are escaping\nAll staff now have a base toughness of 5 (previously 1) so they no longer die from a single punch\nOffices must now be indoor\nVehicles will no longer be blocked by entities, objects, trees etc\nFixed : Purchasing neighbour plots of land sometimes caused the game to get the road location wrong. \nVehicles spawned in the wrong place and construction was blocked in a stripe down the middle of the prison\nFixed : Purchasing land west or north of your prison broke all in-progress escape tunnels\nFixed : Prisoners who are digging escape tunnels will now be rumbled if a guard comes to escort them somewhere \n(Previously they were able to keep digging despite being taken to a different place!)\nFixed : Some long running prisons had active escape tunnels that were being dug by prisoners who were no longer on site - either dead, escaped or released.\nFixed : Sometimes workmen took a very long time to finish foundations, leaving them unfinished for hours\nFixed : Trees will no longer be generated on the road\nFixed : Workers will no longer get stuck in the first delivery truck trying to do a job\nFixed : Guards no longer need to use their keys to open wood doors\nFixed : Mod system now correctly loads replacement font graphics every time\nFixed : Mods can now override the base grants with their own if the grants share the same name\nFixed : Dead visitors will no longer float home\nFixed : Historical contraband moved when you purchased a neighbour plot of land\nFixed : Released prisoners will no longer get stuck on the toilet or in bed\nFixed (Alpha15b) : Right click to cancel stopped working\nFixed (Alpha15c) : All existing contraband was being lost after level load","torrent":{"xt":"urn:btih:fde26d0564269ed32752543ccd50a48b763c75eb","amp;dn":"Prison+Architect+-+Alpha+16+-+Mac+OSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde26d0564269ed32752543ccd50a48b763c75eb","infoHashBuffer":{"type":"Buffer","data":[253,226,109,5,100,38,158,211,39,82,84,60,205,80,164,139,118,60,117,235]},"announce":[],"urlList":[]}}