{"title":"Lowell Fulson -  I've Got The Blues (2000)","uid":5159165,"size":101271228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe8859270c869530f1595f03a0a81b753b55e213&amp;dn=Lowell+Fulson+-++I%5C%27ve+Got+The+Blues+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1258041716,"description":"Track List:\n\n1. Teach Me \n2. I've Got the Blues \n3. Every Second a Fool Is Born \n4. Don't Leave Me Baby \n5. Change of Heart \n6. Fed Up \n7. Searchin' Out \n8. Crying Won't Help \n9. Too Soon \n10. Stoned to the Bone \n11. Last One to Know \n12. How Do You Want Your Man \n13. Thug \n14. Baby! \n15. I Started Out Wrong \n16. You're Gonna Miss Me \n17. Please Let Me Go \n18. Hurry Home \n\nmp3   256kbps\n\n\nBorn Mar 31, 1921 in Tulsa, OK\n\nDied Mar 6, 1999 in Long Beach, CA\n\n \n\n\n \n\nLowell Fulson recorded every shade of blues imaginable. Polished urban blues, rustic two-guitar duets with his younger brother Martin, funk-tinged grooves that pierced the mid-'60s charts, even an unwise cover of the Beatles' &quot;Why Don't We Do It in the Road!&quot; Clearly, the veteran guitarist, who was active for more than half a century, wasn't afraid to experiment. Perhaps that's why his last couple of discs for Rounder were so vital and satisfying -- and why he remained an innovator for so long.\n\n \n\nExposed to the western swing of Bob Wills as well as indigenous blues while growing up in Oklahoma, Fulson joined up with singer Texas Alexander for a few months in 1940, touring the Lone Star state with the veteran bluesman. Fulson was drafted in 1943. The Navy let him go in 1945; after a few months back in Oklahoma, he was off to Oakland, CA, where he made his first 78s for fledgling producer Bob Geddins. Soon enough, Fulson was fronting his own band and cutting a stack of platters for Big Town, Gilt Edge, Trilon, and Down Town (where he hit big in 1948 with &quot;Three O'Clock Blues,&quot; later covered by B.B. King).\n\n \n\nSwing Time records prexy Jack Lauderdale snapped up Fulson in 1948, and the hits really began to flow: the immortal &quot;Every Day I Have the Blues&quot; (an adaptation of Memphis Slim's &quot;Nobody Loves Me&quot;), &quot;Blue Shadows,&quot; the two-sided holiday perennial &quot;Lonesome Christmas,&quot; and a groovy mid-tempo instrumental &quot;Low Society Blues&quot; that really hammers home how tremendously important pianist Lloyd Glenn and alto saxist Earl Brown were to Fulson's maturing sound (all charted in 1950!).\n\n \n\nFulson toured extensively from then on, his band stocked for a time with dazzling pianist Ray Charles (who later covered Lowell's &quot;Sinner's Prayer&quot; for Atlantic) and saxist Stanley Turrentine. After a one-off session in New Orleans in 1953 for Aladdin, Fulson inked a longterm pact with Chess in 1954. His first single for the firm was the classic &quot;Reconsider Baby,&quot; cut in Dallas under Stan Lewis's supervision with a sax section that included David &quot;Fathead&quot; Newman on tenor and Leroy Cooper on baritone.\n\n \n\nThe relentless mid-tempo blues proved a massive hit and perennial cover item -- even Elvis Presley cut it in 1960, right after he got out of the Army. But apart from &quot;Loving You,&quot; the guitarist's subsequent Checker output failed to find widespread favor with the public. Baffling, since Fulson's crisp, concise guitar work and sturdy vocals were as effective as ever. Most of his Checker sessions were held in Chicago and L.A. (the latter his home from the turn of the '50s).\n\n \n\nFulson stayed with Checker into 1962, but a change of labels worked wonders when he jumped over to Los Angeles-based Kent Records. 1965's driving &quot;Black Nights&quot; became his first smash in a decade, and &quot;Tramp,&quot; a loping funk-injected workout co-written by Fulson and Jimmy McCracklin, did even better, restoring the guitarist to R&amp;B stardom, gaining plenty of pop spins, and inspiring a playful Stax cover by Otis Redding and Carla Thomas only a few months later that outsold Fulson's original.\n\n \n\nA couple of lesser follow-up hits for Kent ensued before the guitarist was reunited with Stan Lewis at Jewel Records. That's where he took a crack at that Beatles number, though most of his outings for the firm were considerably closer to the blues bone. Fulson was never been absent for long on disc; 1992's Hold On and its 1995 follow-up Them Update Blues, both for Ron Levy's Bullseye Blues logo, were among his later efforts, both quite solid. Fulson continued to perform until 1997, when health problems forced the career bluesman into a reluctant retirement. His health continued to deteriorate and on March 6, 1999 - just a few weeks shy of his 78th birthday - Lowell Fulson passed away.\n\n \n\nFew bluesmen managed to remain contemporary the way Lowell Fulson did for more than five decades. And fewer still will make such a massive contribution to the idiom.\n\n\n--------------------------------------------------------------------------------\n\n\nwell download it then\n","torrent":{"xt":"urn:btih:fe8859270c869530f1595f03a0a81b753b55e213","amp;dn":"Lowell+Fulson+-++I%5C%27ve+Got+The+Blues+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8859270c869530f1595f03a0a81b753b55e213","infoHashBuffer":{"type":"Buffer","data":[254,136,89,39,12,134,149,48,241,89,95,3,160,168,27,117,59,85,226,19]},"announce":[],"urlList":[]}}