{"title":"Sarah Jones: One woman, eight hilarious characters","uid":4878593,"size":71580384,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ffe5959b185ce3fcde75423803e3d35161686f10&amp;dn=Sarah+Jones%3A+One+woman%2C+eight+hilarious+characters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263477,"description":"Sarah Jones: One woman, eight hilarious characters\n\nIn this hilariously lively performance, actress Sarah Jones channels an opinionated elderly Jewish woman, a fast-talking Dominican college student and more, giving TED2009 just a sample of her spectacular character range.\n\n&quot;Chameleon-like&quot; barely describes the astonishing ease in which Sarah Jones slips in out out of the characters in her solo performances -- as many as fourteen personae in her off-Broadway hit Bridge &amp; Tunnel. Critics marvel not only at her ability to perfectly mimic accents and mannerisms, but also to seemingly reshape her body down to pupils and dimples in the blink of an eye.\n\nJones' performances showcase a biting political awareness, and she has received commissions from Equality Now, the Kellogg Foundation and the National Immigration Forum to address issues of injustice and inequality. She is the official spokesperson on Violence Against Children for UNICEF, and performs globally to  focus awareness on child abuse.\n\n    &quot;Jones, who is ... a sort of multicultural mynah bird, lays our mongrel nation before us with gorgeous, pitch-perfect impersonations of the rarely heard or dramatized.&quot;\n\nNew Yorker","torrent":{"xt":"urn:btih:ffe5959b185ce3fcde75423803e3d35161686f10","amp;dn":"Sarah+Jones%3A+One+woman%2C+eight+hilarious+characters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe5959b185ce3fcde75423803e3d35161686f10","infoHashBuffer":{"type":"Buffer","data":[255,229,149,155,24,92,227,252,222,117,66,56,3,227,211,81,97,104,111,16]},"announce":[],"urlList":[]}}